[
    {
        "Published": "2019-09-13",
        "Title": "Feeling Anxious? Perceiving Anxiety in Tweets using Machine Learning",
        "Authors": "Dritjon Gruda, Souleiman Hasan",
        "Summary": "This study provides a predictive measurement tool to examine perceived\nanxiety from a longitudinal perspective, using a non-intrusive machine learning\napproach to scale human rating of anxiety in microblogs. Results suggest that\nour chosen machine learning approach depicts perceived user state-anxiety\nfluctuations over time, as well as mean trait anxiety. We further find a\nreverse relationship between perceived anxiety and outcomes such as social\nengagement and popularity. Implications on the individual, organizational, and\nsocietal levels are discussed.",
        "Page_content": "ANXIETY IN TWEETS \nFeeling Anxious? Perceiving Anxiety in Tweets using Machine Learning \nDritjon Gruda1, Souleiman Hasan1 \n1 National University of Ireland Maynooth, School of Business, Maynooth, Ireland \n \nAbstract \nThis study provides a predictive measurement tool to examine perceived anxiety from a \nlongitudinal perspective, using a non-intrusive machine learning approach to scale human \nrating of anxiety in microblogs. Results suggest that our chosen machine learning approach \ndepicts perceived user state-anxiety fluctuations over time, as well as mean trait anxiety. We \nfurther find a reverse relationship between perceived anxiety and outcomes such as social \nengagement and popularity. Implications on the individual, organizational, and societal levels \nare discussed. \n \n \n \n2 \n \nIntroduction \nMany studies in various disciplines have made use of individuals’ digital footprints, \ninterpreting uploaded information and making predictions about future behaviour based on \nbehavioural residue (e.g. De Choudhury, Counts, & Horvitz, 2013; De Choudhury, Counts, \nHorvitz, & Hoff, 2014; Eichstaedt et al., 2015; Matz & Netzer, 2017; Settanni & Marengo, \n2015). Behavioural residue is a trail of actions or deliberately placed markers which form \nidentity claims (Gosling, Ko, Mannarelli, & Morris, 2002, p. 381). Several studies have used \nbehavioural residue in digital footprints to assess and derive clues with regard to personality \npredictions (e.g. Azucar, Marengo, & Settanni, 2018; Li, Li, Hao, Guan, & Zhu, 2014; Qiu, \nLin, Ramsay, & Yang, 2012) and other psychological characteristics (Kosinski, Matz, Gosling, \nPopov, & Stillwell, 2015; Settanni, Azucar, & Marengo, 2018). In this paper, we suggest \nexamining anxiety in the naturally occurring setting (Qiu et al., 2012) of microblogs, using a \nmachine learning approach.  \nAnxiety is a particularly interesting phenomenon to study, since anxiety occurs in both \nstate and trait form. State-anxiety (Spielberger, Gorsuch, Lushene, Vagg, & Jacobs, 1983) is \ndefined as “a temporary state influenced by the current situation where the respondent notes \nhow he/she feels right now at this moment”, whereas trait anxiety is defined as “a general \npropensity to be anxious where the respondent notes how he/she feels generally”. Furthermore, \na closer examination of the State-Trait Anxiety Inventory (STAI) reveals that state and trait \nanxiety differ mostly in terms of frequency of occurrence. Hence, while state anxiety measures \nhow participants feel right now, trait anxiety captures the frequency of feeling anxious in \ngeneral (i.e., not at all, frequently, a lot, etc.). For example, individuals are more likely to feel \nmore anxious before certain events, e.g. an important presentation at work or an annual \nperformance review meeting (i.e. state anxiety). However, in order to provide a full picture and \n3 \n \nreduce the likelihood of misrecognising state anxiety as trait anxiety (more prevalent in cross-\nsectional and self-report data), a longitudinal analysis is much more adequate.  \nTo overcome this obstacle from a methodological point of view, we combine human \nzero-acquaintances ratings with a machine learning approach. Computational power allows us \nto evaluate a large amount of text input, and provides us with an unprecedented opportunity to \ntrack users’ anxiety levels over time, a large limitation in previous studies (e.g., Qiu et al., \n2012). Our machine learning approach paired with data crawling techniques allows us to collect \na large enough dataset (Kosinski, Stillwell, & Graepel, 2013; Wald, Khoshgoftaar, Napolitano, \n& Sumner, 2012), which we also overcomes small sample size biases and self-selection \nsampling in previous studies (Settanni & Marengo, 2015). Proper training and analysis could \nreduce the effect of the machine learning error through representative and multi-rater labelling, \nfounded modelling to reduce overfitting (e.g. through cross-validation), along with aggregate \nanalysis to offset the random machine prediction error.  \nIn order to test our presented approach and its implications regarding future outcomes, \nwe relate the degree of perceived user anxiety, both current (i.e. state anxiety) and frequency \nof expression (i.e. trait anxiety) to the degree of popularity and social engagement of \nTweeters, i.e. the number of followers and number of users one follows, respectively. Since \nthese two outcome variables are measured only at the point of data collection and anxiety as \ndetected in tweets is measured over time, we can make predictions about future popularity \nand social engagement using anxiety as a predictor. Related research in the information \nsystems literature (Quercia, Kosinski, Stillwell, & Crowcroft, 2011) found that predictive \nstatements can be made regarding traits based on just a handful of criteria. These include \npublicly available factors, namely the amount of following, followers and listed counts on \nTwitter. For example, popular users (those with a large group of followers) and listeners \n(those who follow many others) score low on neuroticism. Since individuals who score high \n4 \n \non neuroticism tend to withdraw to themselves, especially in stressful situations (Lee‐\nBaggley, Preece, & DeLongis, 2005), these findings also translate into real life, where \nneuroticism is a useful predictor of the number of friends in life (Swickert, Rosentreter, \nHittner, & Mushrush, 2002) as well as Facebook contacts (Golbeck, Robles, & Turner, 2011). \nTherefore, similarly to previous research, we use anxiety detected in tweets to make \npredictions about individuals’ degree of popularity and social engagement in life. Although \nimplied in previous research (Quercia et al., 2011), to the best of our knowledge, the \npresented study is the first to do so using very high volumes of data over time to derive useful \nimplications based on the detection of anxiety in microblogs. \nMeasuring Anxiety: Self-Report vs. Observer-Rated \nAnxiety can be measured in various ways, including self-report, physiological, and \nbehavioural measures (Eysenck, 2000), yet, concordance between these measures remains \nlow (Newton & Contrada, 1992). Most likely, this is due to cognitive biases associated with \nanxiety (Eysenck, 2000), in particular comparing self-report with observer-rated measures. \nFor example, since highly anxious individuals (i.e., high trait anxiety) tend to interpret \nperceived information in an exaggerated threatening fashion, these individuals usually report \nhigher self-report anxiety than observer-rated physiological or behavioural measures would \nindicate. Those who try to repress their anxiety levels, i.e. repressors, aim to reduce the threat \nlevel of new information (Eysenck, 2000). In this case, self-report anxiety levels are more \nlikely to be lower than observer-rated measures. Finally, individuals who score low on trait \nanxiety are not prone to the same cognitive biases. Hence, their self-report anxiety is \ncomparable to observer-rated anxiety. Due to the existence of these above-mentioned \ncognitive biases, as well as the human tendency to generally answer self-report survey \nquestions favourably (i.e. social desireability, Fisher, 1993), it would be much more effective \n5 \n \nto monitor and track observer-rated anxiety levels of individuals rather than self-report \nanxiety. \nNonetheless, observer-rated measurements are numerous, which hinders a direct \ncomparison of results. For example, based on a sample of outpatients, Schat et al. (2017) \nfound an overall strong and positive correlation between self-report and observer-rated \nmeasures of anxiety severity. However, in 12.6% of cases patients reported higher self-report \nanxiety than observer-rated anxiety (p. 9), while in 12.2% of cases higher observer-rated than \nself-report anxiety scores were reported. These results, however, likely provide a skewed \npicture of overall anxiety levels and likely are not representative of the general population. \nFor example, patient questions about anxiety would include a measurement of phobias, \nreduced sleep or muscular tension (BAS; observer-rated), and faintness, chest pains, and \ntrouble breathing (BSI; self-report). While such questions are important in assessing a \npatient’s anxious tendencies and determine treatment options (Dorz, Borgherini, Conforti, \nScarso, & Magni, 2004), the same factors could be confounding results in case of zero-\nacquaintance raters evaluating anxiety based on online data.  \nMeasuring Anxiety Online \nIn order to create a predictive model of anxiety in the general population, we base the \nmeasurement of perceived anxiety on zero-acquaintances, who rate perceived anxiety levels \nin others by rating micro-blogs. To do so we firstly need to address whether it is even \npossible to reliably do so. For example, De Choudhury et al. (2013) accurately measured \nusers’ depression levels (self-report/observer-rated scores of depression) by analysing user \ntweets. In addition, the respective authors could also make accurate predictions about the \nfuture onset of depression. Another study (Qiu et al., 2012) found that aggregated observer \nratings of neuroticism (and agreeableness) in participants’ tweets were significantly \n6 \n \ncorrelated to self-report personality ratings. This result is in line with previous studies (e.g. \nHolleran & Mehl, 2008).  \n Previous research (Youyou, Kosinski, & Stillwell, 2015) showed that even the mere \nexamination of Facebook likes can serve to make accurate predictions with regard to users’ \npersonality, showed higher interrater agreement, and were better predictors of other life \noutcomes such as physical health. Indeed, computer predictions were almost as accurate as \nparticipants’ spouses in the assessment of participants’ personality. Hence, the greater the \namount of behavioural residue, i.e. the more available data, the higher the accuracy of \nprovided ratings (Settanni et al., 2018).  \nLikewise, the same principle applies to the number of raters per behavioural clue in \nlinguistic form. Complete strangers (i.e., zero-acquaintance raters) can make accurate \npersonality judgments after observing participants’ behaviour (Funder, Kolar, & Blackman, \n1995; Macrae & Quadflieg, 2010; Ready, Clark, Watson, & Westerhouse, 2000). What makes \nthese zero-acquaintances ratings accurate is a connection between “the presence of deliberate \nor unintentional self-expressions and, importantly, communication of some form of \ninformation to others” (Tskhay & Rule, 2014). In addition, we do not ask our raters to rate \ntweets on anxiety specifically, but repurpose a well-established scale (STAI; Spielberger et al., \n1983) to evaluate each tweet on anxiety. We do so instead of using linguistic software such as \nLIWC (Pennebaker, Francis, & Booth, 2001). LIWC, although highly beneficial if the goal is \nlinguistic usage of words, overlooks more subtle clues such as higher-order semantic cues (Gill \n& Oberlander, 2002; Hirsh & Peterson, 2009). We have conducted an empirical comparison \nwith LIWC as explained in detail in the methodology section (Step 6). The comparison shows \nthat the machine learning approach outperforms LIWC in terms of regression to human rating. \nNonetheless, in the absence of any human labelling that can form a basis for machine learning, \n7 \n \nunsupervised methods, which are based on dictionary word counts, such as LIWC, can form \nan alternative approach. \nHowever, the number of raters is important. For example, Qiu et al. (2012) found that \na single observer cannot make accurate predictions when it comes to determining \nparticipants’ personality traits in micro-blogs (p. 713). Therefore, multiple raters are needed \nto achieve a respectable degree of judgment accuracy. Yet, observers likely rely on similar \ncues when providing their ratings, as long as inter-observer agreement is high (Graham & \nGosling, 2012; Vazire & Mehl, 2008). \nMeasuring Anxiety in Tweets \nIn this study, we focus on examining anxiety in micro-blogs, namely tweets. Twitter is the \nworld’s most popular microblogging platform, with over 328 million active users (Statista, \n2017), with 100 million daily users (Aslam, 2017) who produce on average 6,000 tweets \n(140-character text messages) per second, or 500 million tweets per day. Twitter users also \ncan subscribe to what other users post, known as followers. Microblogging is quick, short, \nand mostly captures what is going on at any particular moment (Oulasvirta, Lehtonen, \nKurvinen, & Raento, 2010). Twitter users’ news feed therefore provides a good fit for \nanalyses in the social sciences, as tweets mostly capture users’ thoughts, feelings, and \nconversations at a particular moment in time (Naaman, Boase, & Lai, 2010). One of the most \nimportant distinctions between Twitter and Facebook is the degree of anonymity. While \nTwitter allows users to create a pseudonymous profile to share opinions (Hughes, Rowe, \nBatey, & Lee, 2012; Kwak, Lee, Park, & Moon, 2010), Facebook requires its users to enter \ntheir real name and post actual user information, in order to find friends and interact with \n‘people you may know’ (Huberman, Romero, & Wu, 2009). Tweets (for the most part) are \npublic by default while on Facebook, the default setting of posts is set to private, as \n8 \n \ninformation is shared primarily with friends or familiar people in users’ social circles. \nAnother argument could be that Twitter and Facebook users also differ with regard to their \npersonality. However, two recent meta-analyses found no difference based on social media \nplatform type (public vs. private) with regard to the accuracy of personality prediction \n(Azucar et al., 2018; Settanni et al., 2018).  \nIn our study, participants’ behavioural residue is composed of tweet content and the \nway participants use words and phrases, rated by human raters and scaled by using a machine \nlearning algorithm. We use Twitter because Twitter data is publicly available and non-\nintrusive. Doing so allows us to capture naturally occurring expressions of a wide and \nrepresentative set of users (Qiu et al., 2012), which is in contrast to laboratory studies in \nwhich participants would not necessarily express themselves naturally (e.g. Kanagawa, Cross, \n& Markus, 2001). In addition, microblog data include a high degree of social interaction with \nothers. Users oftentimes engage in debates with others on social media platform, and share \nlike-minded posts with others. All these aspects contribute to the accumulation of linguistic \nand behavioural cues and the overall expression of oneself, in a way that was until recently \nvery difficult to analyse (Golbeck et al., 2011; Yee, Ducheneaut, Nelson, & Likarish, 2011). \nMethodology \nOur methodology is based on content analysis. Hence, for the analysis to take place \nanxiety scores are needed per tweet. Manual scoring is not feasible if the content is to span \nacross many tweets (i.e. millions), and over large time spans (i.e. years). For this purpose, we \npropose a methodology that is hybrid between human and machine rating, where human scaling \nfor a dataset of 600 tweets is used to train the machine how to score tweets. Machine learning \nis then used in a subsequent stage to score millions of tweets resulting in a comprehensive data \nanalysis. In Figure 1 we provide an overview and illustrate our research methodology. \n9 \n \n------------------------------------- \nInsert Figure 1 about here \n------------------------------------- \nThe three phases of the methodology include: \nA. Labelled data preparation: a set of 600 tweets (US tweeters) are manually rated by 604 \nparticipants (US participants only) on anxiety (Marteau & Bekker, 1992), each human \nrater rating 5 tweets on average, which resulted in 3,020 observations. \nB. Machine learning: features are extracted from tweets’ textual content to learn how \nhuman raters rated, resulting in learned machine models. \nC. Anxiety scoring and data analysis: a final dataset of about 3,33 million public tweets \nby 1,418 users, over an average of 18-months timeline, is prepared and scored using \nmachine learning. Data analysis takes place on this dataset as reported in the results \nsection. The subset of 1,418 users has been randomly selected for practical reasons to \nhandle the resulting volume of data, and is a large number sufficient for statistical \nanalysis. The number of 3.33 million tweets is a result of retrieving what the Twitter \nAPI allows for those users. Since the Twitter API allows the retrieval of up to 3,200 \ntweets for any user, the time span may vary per user’s tweeting activity. On average, \nthe time span is around 18 months per user.     \nStep 1: Search for Tweets \nThe purpose of this step is to retrieve a set of tweets using the keywords “work” and \n“feeling” to form the basis of a human-labelled dataset. The Twitter API is called with the \nstandard search API method and the mentioned keywords to retrieve tweets from the live \nstream. This was done over the period of two days in December 2017. Details and limits \nimposed by the Twitter API can be found in its online reference1.  \n                                                           \n1 https://developer.twitter.com/en/docs/tweets/search/api-reference/get-search-tweets \n10 \n \nThis step resulted in a dataset of 10,510 tweets, made by 10,386 users, each of which \nmentions the search terms. 60% of these tweets are retweets, and 9% are replies. Due to \nretweets and replies, textual content might repeat although tweet objects are different. In fact, \naround 46% of the tweets have unique textual content. \nStep 2: Manually Select a Subset of Tweets \nA subset of tweets is selected to reflect a balanced2 normal distribution of anxiety so \nthat subsequent machine learning avoids biases due to imbalanced data. 600 unique tweets have \nbeen selected by selecting non-retweets and non-replies, removing links, and removing \ncharacters that are not correctly appearing. The Twitter search API, originally used to retrieve \nthe tweets, may not include the geographical location of each user. This is because the user \nmight not provide this information. Thus, we have selected tweets with English content of users \nwhose location or time zone are explicitly mentioned and conform to the USA to avoid cultural \nbias.  \nStep 3: Rate Anxiety by Human Raters \nPerceived anxiety was measured with the short version of the traditional full scale State-\nTrait Anxiety Inventory (STAI; Spielberger et al., 1983). The final scale is composed of 6 items \non a four-point scale. For example, a tweet with the content “At work feeling terrible \u0001” is \nscored 3.4 out of 4 on average by six raters, representing high anxiety. In another instance, a \ntweet with the contnet “Was feeling myself at work today” is scored 1.5 on average by 5 raters, \nindicating low anxiety. \n------------------------------------- \nInsert Figure 2 about here \n------------------------------------- \n                                                           \n2 Balance of the selected set has been confirmed before moving on to final labelling, by refining Steps 1 and 2. \nWe also conducted two pre-tests of 50 tweets and 50 raters each, with each rater rating more than one tweet. This \nwas done in order to assure interrater agreements and distribution of anxiety. \n11 \n \nDue to the longitudinal nature of our study design, this scale is sufficient even though \nit only asks participants to evaluate how the person tweeting (i.e. the tweeter) feels in one tweet \nat a time, as trait anxiety can be measured at data analysis by consider multiple tweets over \ntime. After recoding reversed items, the total state-anxiety score is derived by summing all \nitems (α = .90). Interrater agreement was calculated based on Intra-Class Correlations  (ICC; \nKoch 1982) using STATA 15. Using the full labelled dataset of 600 tweets, we derived an \nacceptable ICC (= .69, SE=.015; (95% CI = [.66, .72]).  \nFigure 2 illustrates a dot plot of individual human rating per tweet for a random set of \ntweets from the 600 dataset. It shows a tendency for the dots to cluster for each tweet, which \nreflects a high correlation between raters on how they judge a particular tweet. The interclass \ncorrelation coefficient (ICC) of .69 summarizes this pattern for the entire dataset. We would \nargue that from a methodological perspective, it is important that the labelling process accounts \nfor multiple labels by different raters, and that raters’ ratings correlate with each other. This \nincreases the trust in the labelled data, which forms the basis of machine learning  to try to \nmimic human ratings. If human raters do not agree on their rating, one would not expect the \nmachine to be able to accurately learn how to score the data.  \nStep 4: Calculate Mean Anxiety Scores \nMultiple scores of multiple raters of the same tweet are averaged into one score per \ntweet, which is then used for machine learning. Scores were found to be balanced in the range \nof 1-4, which reduces bias in machine learning in later stages. \nStep 5: Feature Extraction \nNext we need to ensure that machine scores mimic human scores, i.e. to allow the \nmachine to replicate the human rater role, and then to rate many more tweets automatically. \nFeatures are extracted from the text of each tweet of the 600 labelled tweets. This is done since \n12 \n \nmachine learning algorithms are generally not suited to work directly on words and sentences, \nbut rather on numerical vectors, or features, of text. \nThe first type of feature is the semantic embedding vector, which is the mean of multiple \nvectors that map each word in the tweet to a distributional vector of 300 dimensions. This \naccounts for similarity between words such as synonyms, which typically have vectors closer \nthan those of unrelated words. Here, every tweet becomes a vector of 300 dimensions with \neach component having continuous negative or positive values. Such a vector summarizes the \nmeaning of the whole tweet. Two similar tweets in meaning would have close vectors in the \nmathematical sense (e.g. Cosine Similarity) rather than semantically different tweets. Words-\nto-vectors mapping is based on the deep neural network learning GloVe (Pennington, Socher, \n& Manning, 2014) embedding space built from the Common Crawl Web Data (42 Billion \ntokens, 1.9M vocab). \nThe second type of feature are words and emojis occurrence vectors. For example, a \ntweet that has the content \"no better feeling \u0002\u0002\u0002\" is converted into a vector of the form \n[no: 1, better: 1, feeling : 1, \u0002 : 3 ] to reflect word and emojis occurrence. Such a vector will \nhave entries with zeros for absent words. It will also have entries for bigrams such as no-better, \nbetter-feeling, \u0002\u0002, etc. Tweets with the same words or emoji occurrences will be considered \nclose when the machine learning tries to fit a model for the tweets and their scores. \nStep 6: Regression Models Machine Learning \nThe training data, consisting of the 600 tweets along with their mean anxiety scores \nassigned by human raters, have been used to train two models. Each model works on one type \nof features (i.e. semantic embedding vectors, and words and emoji occurrence vectors). This \nstage is experimental in a data science pipeline, in the sense that the models which perform \nbest when trained on a part of the labelled data, and tested on the rest, should be adopted. \n13 \n \nAmong the various models we have experimented with, the Bayesian Ridge Regression \n(MacKay, 1992) performed best. Hence, this is a supervised method, but one can also perform \nan unsupervised method, using the dictionary-based LIWC for instance, in the absence of any \ntraining data. We draw such a comparison at the end of this Step 6. \nThe problem is a regression problem since the predicted value, i.e. the anxiety score, is \ncontinuous. Bayesian Ridge Regression is based on our implementation of linear Ridge \nregression and follows the Python Scikit Learn library. If the features are X, and the anxiety \nscores are Y, Ridge Linear regression looks for W, which minimizes the loss function: \n‖\u0003 −\u0005\u0006‖\u0007\n\u0007 + \t‖\u0006‖\u0007\n\u0007 \nWhere ‖\n‖\u0007\n\u0007 denotes the L2 norm and \t is the weight of the regularization term. The \nRidge regression does not fit a linear model that has least squares only (i.e. ‖\u0003 −\u0005\u0006‖\u0007\n\u0007) but \nregularizes based on the norm of W (i.e. ‖\u0006‖\u0007\n\u0007). This makes it less likely to over-fit, and thus \ngeneralizes better on unseen tweets. The Bayesian Ridge Regression assumes prior \ndistributions of the hyper parameters, which are jointly estimated during the training process. \nThus, given the theoretical characteristics of the learning model, as well as its empirical \nvalidation discussed below, one can reasonably trust the model’s scoring on unseen tweets. \nWe fit two regression models to the two sets of features and the corresponding human-\ngiven anxiety scores. The two models are learned based on the two types of features. At \nprediction time of anxiety of non-labelled tweets, the mean of the two predicted scores of the \ntwo models is taken. \nThe learning and testing process has been performed through a six-fold cross-\nvalidation, in which the 600 tweets are split into 6 subsets of 100 tweets each, and every time \none of the subsets is used for testing while the rest is used for the training. The performance is \n14 \n \nthe average performance of the six folds. A good learned model should predict scores for the \ntweets that would correlate with the scores of the human raters. \n------------------------------------- \nInsert Figure 3 about here \n------------------------------------- \n \nPerformance measures (i.e., goodness of fit R2 = .49 and Spearman Rank Correlation = \n.69) suggest that if a human would rank tweet A more anxious than tweet B, then the machine \nwould likely do the same with a spearman correlation of .69, which is also illustrated in Figure \n3. Performance is also summarized in the Root-Mean-Square Error (RMSE) = .52 which \nrepresents the root of the mean of squared differences between the machine-predicted scores \nand the human-assigned scores. The value .52 is small with respect to the range [1-4] of the \nscale. \n------------------------------------- \nInsert Figure 4 about here \n------------------------------------- \n \nError is smaller when considering multiple tweets. It is noteworthy that the \nperformance and error discussion above is applicable when considering individual tweets only. \nHowever, if the downstream data analysis aggregates scores of multiple tweets, the error of the \nmachine learning starts to cancel out as some of the error would be negative and some would \nbe positive. This makes data analysis with aggregate (e.g. mean) scores more reliable and prone \nto smaller error, since the machine learning error is almost normally distributed with a mean \nof 0 as shown in Figure 4. \n \n------------------------------------- \n15 \n \nInsert Figure 5 about here \n------------------------------------- \nTo compare the performance with the LIWC software, we have run LIWC on the same \ntweets that the machine learning was performed on, and of which we know the human scoring. \nLIWC as a software is based on a dictionary and relies on counting words, in an unsupervised \nmanner. Words can be categorized under categories such as anxiety, positive emotions or \nnegative emotions. In this study, we used the most recent LIWC2015 dictionary. This \ndictionary uses 116 words or word roots to account for anxiety (ANX category), if such words \nappear in a text or tweet. \nLike other dictionary-based methods, this has the advantage of not relying on training \nand being an unsupervised method. On the other hand, the ability of LIWC is limited by the \nwords defined in its dictionary for specific categories, such as anxiety. For example, a tweet \nwith the content “At work feeling terrible \u0001” has been labelled by human raters and machine \nlearning to contain significant anxiety of around 3 out of 4 on the used scale. Nonetheless, \nLIWC found 0 words of its anxiety category in this tweet, and thus labelled it as zero-anxiety \ntweet. \nThe problem stems from three main reasons: (1) the dictionary may not cover all \npossible words that can describe a category like anxiety, (2) anxiety may be conveyed through \na complex sentence that relies on an interaction between several words that together, and no \nsingle word alone, can describe the feeling, and (3) tweets are generally short text and may \ncontain misspelled words or non-standard language which further challenges dictionary-based \nmethods. These limitations could be remedied by machine learning from human-labelled data, \ngiven that such training data is available. More complex features than bags-of-words could \nhelp, by accounting for groups of words (n-grams), and the use of embedding semantic models, \n16 \n \nwhich can learn meanings such as relations between synonyms, using neural networks trained \non large corpora of English-in-use, as the models used in this article. \nSince the ANX (anxiety) category in LIWC yielded 0% in most tweets, and to devise a \ncomparison with the machine-learning model, we turned to the emotion categories in LIWC \nsince they cover more words and can yield a score for tweets. While these do not represent \nanxiety directly, we derive here a sentiment measure from emotion as a proxy for anxiety to \nenable the comparison. Previous studies have also shown negative/positive correlations \nbetween anxiety and positive/negative emotions respectively (Pekrun, Goetz, Frenzel, \nBarchfeld, & Perry, 2011; Watson, Clark, & Carey, 1988). We derived the sentiment score \nmeasure from the positive and negative emotion categories and normalized the range to [1-4], \nfor comparison. The derived sentiment score is equal to (negative emotions negemo minus \npositive emotions posemo) normalized to [0-1], multiplied by 3, and finally added to 1: \n\u000b\f\r\u000e\u000f\u0010\f\r\u000e \u000b\u0012\u0013\u0014\f\u0015\u0016\u0017\u0018 = \u001a\u001b\u001c\u001b\u001d\u001e −\u001f\u001e \u001b\u001d\u001e ∈[−1, +1] \n\r\u001e&\u001d'()*\u001b+ \u000b\f\r\u000e\u000f\u0010\f\r\u000e \u000b\u0012\u0013\u0014\f\u0015\u0016\u0017\u0018\n= 3 ×\n\u000b\f\r\u000e\u000f\u0010\f\r\u000e \u000b\u0012\u0013\u0014\f\u0015\u0016\u0017\u0018 −\u0010)\u001a(\u000b\f\r\u000e\u000f\u0010\f\r\u000e \u000b\u0012\u0013\u0014\f\u0015\u0016\u0017\u0018)\n\u0010'/(\u000b\f\r\u000e\u000f\u0010\f\r\u000e \u000b\u0012\u0013\u0014\f\u0015\u0016\u0017\u0018) −\u0010)\u001a(\u000b\f\r\u000e\u000f\u0010\f\r\u000e \u000b\u0012\u0013\u0014\f\u0015\u0016\u0017\u0018) + 1 ∈[1,4] \nPerformance measures for LIWC, as shown in Figure 5, are lower than measures of the \nmachine learning model: goodness of fit R2 = .21 and Spearman Rank Correlation = .49, \ncompared to R2 = .49 and Spearman Rank Correlation = .69 in our machine learning model, \nrespectively. The Root-Mean-Square Error (RMSE) equals .63 and is greater than the score of \n.52 in the machine learning model.  Since LIWC counts words in text may sometimes find zero \nwords from its dictionary to categorize under positive or negative emotions. This shortcoming \nresults in a sentiment score of 2.5 (neither low nor high), which is seen as a horizontal line \npattern in Figure 5. Overall, the machine learning model outperforms the LIWC approach, as \nits features are derived from more complex semantic models learned through neural network \n17 \n \nembeddings. The machine learning model also accounts for multiple word frequencies (bi-\ngrams) and a larger set of emojis. However, dictionary and lexicon-based approaches such as \nLIWC, remain useful in applications with an absence of any training data as they run in an \nunsupervised manner. \nStep 7: Select Users Subset \nFrom the 10,386 users found in Step 1, we select a subset of users which we consider \nfor preparing the final large dataset of tweets. We randomly selected 1,418 users for practical \nconsiderations of potential data volume and limits of the Twitter API. \nStep 8: Retrieve Users Timelines \nFor each user selected in Step 7, we use the Twitter user timelines API 3 to retrieve each \nuser’s tweets from the past up to the day of collection. The API allows a maximum of 3,200 \ntweets per user to be retrieved, which in many cases spans back over several months or even \nyears of user’s activity. The result of this step is a set of 3,330, 387 public tweets, belonging to \n1,418 users. The average number of tweets per user is 2,348, with 52% of tweets being retweets \nand 17% being replies. The dataset forms a non-invasive longitudinal study with an average \ntime span of 18 months-worth of tweets per user. \nStep 9: Machine Learning Scoring \nThe machine learning models resulting from Step 6 are now used to score the 3.33 \nmillion tweets resulting from Step 8. This results in a large dataset of scored tweets on the \nanxiety scale (M = 2.34, SD = .36). A very small amount of these (around .23%) are scored \nby the machine outside of the [1-4] range due to extrapolation. Due to the small percentage of \nthose scores outside the range, we decided to ignore this data in our subsequent data analysis. \n                                                           \n3 https://developer.twitter.com/en/docs/tweets/timelines/api-reference/get-statuses-user_timeline.html \n18 \n \nStep 10: Data Analysis \nThe final dataset is subjected to data analysis in order to draw conclusions including, \nfor instance, the filtering of retweets and replies if needed, visualizing temporal user anxiety, \nthe aggregation and mean scores, and conducting prediction models regarding users popularity \nand social engagement with anxiety scores. Popularity and social engagement are static \nvariables in our dataset, i.e. they both were measured only at the point of data collection. That \nis due to a limitation in the data provided by Twitter. Although up to 3,200 tweets can be \ncollected by user, which can reach back in time several months or even years, users’ number \nof followers and number of users’ followed are determined at the point of data collection and \nare not displayed in a dynamic manner. Hence, since these two outcome variables are static \nand anxiety as detected in tweets is measured over time, we can make predictions about future \npopularity and social engagement using anxiety as a predictor. A reverse causal relationship, \nalthough possible, cannot be accounted for in this study. \nMeasurements \nAnxiety was measured with the short version of the traditional full scale (State-Trait \nAnxiety Inventory (STAI; Spielberger et al., 1983). Since the design of our study includes \nmultiple ratings of several tweets per participant, we chose an abbreviated format of the STAI \n(Marteau & Bekker, 1992) composed of 6 items on a four-point scale, with 1 = “Not at all” and \n4 = “Very much”. For example, a tweet with the content “At work feeling terrible \u0001” is scored \n3.4 out of 4 on average by 6 raters, representing high state anxiety. In another instance, the \ntweet with the content “Was feeling myself at work today” is scored 1.5 on average by 5 raters, \nindicating low anxiety. \n19 \n \nSocial engagement was measured by the number of people a tweeter follows, i.e. following \ncount, whereas popularity was measured by considering the number of followers a \nTwitteruser has, i.e. followers count. Results are detailed in the results section. \nResults \nCorrelations among variables are listed in Table 1: \n------------------------------------- \nInsert Table 1 about here \n------------------------------------- \nData Visualization. In order to provide data visualization we randomly looked at \nanxiety scores of four random users, over time. In the figure below we highlight one example, \na given time period of one week just before Christmas (from 15th – 23rd December). An example \noverview of four random tweeters in our database is shown in Figure 6. We observe for \nexample that tweeter #1 and tweeter #3 both have fluctuations of state anxiety scores as \nexpressed in their tweets; however, tweeter #1 has a higher mean (i.e. state) anxiety as opposed \nto tweeter #3. \n------------------------------------- \nInsert Figure 6 about here \n------------------------------------- \nRegressions. In our model, we examined whether anxiety scores can predict both \nfollower count (number of followers) as well as following count (number of people a tweeter \nfollows). An initial examination of collected data points showed that we would capture \napproximately 82% of all our data if we were to consider time periods of 12 months (i.e. 2017), \nor 69% considering a period of 6 months (i.e. second half of 2017). Given our complete dataset \nof over three million observations, with observations spanning from 2 – 3,204 tweets per user, \n20 \n \ngoing back further than one year would yield a somewhat unbalanced dataset. Therefore, in \nTable 2 we report results based on the time periods 6 months and 12 months. \n As explained above, each tweet was evaluated individually on the expression of state \nanxiety, combined to form an overall trait anxiety score per user. Since some tweeters tweet \nmore often than others at any given time, total tweet count per user needs to be considered in \nthe analysis and visualization of our data. \n------------------------------------- \nInsert Table 2 about here \n------------------------------------- \nThe aggregated data by user over time (n = 1322) show that anxiety scores significantly \npredict both social engagement (i.e. following count) as well as popularity (follower count). \nThe effects are quite strong, ranging from -.39 to -.77. Looking at the actual model fit, it is \nevident that our measure of perceived anxiety is a better predictor for social engagement over \ntime (i.e. the number of other users a tweeter follows). \nDiscussion \nWe presented a tool that can detect the onset of significant changes in individuals’ \nexpressed anxiety over time. Since anxiety is not always evident, especially if anxiety levels \nremain high for a longer period (induced by a non-specific event, i.e. trait anxiety) it would \nbecome difficult for individuals to recognize the onset of anxiety, or the association between \nhigh anxiety levels when encountering a specific person or situation. However, due to the \nbehavioural residue that is left behind in linguistic form, we can draw conclusions regarding \nhow individuals feel at a given time. Some statements are clearer than others of course; for \nexample, “I feel so anxious at work” much more reflects high anxiety levels than “Just not \nfeeling work today”. However, we are confident that these statements have been evaluated \nreliably, as interrater agreement was quite high (ICC = .69).  \n21 \n \nIt is important to distinguish that in this study we do not measure actual experienced \nuser anxiety, or short, anxiety. Instead, in this study we account for observer-rated perceived \nuser anxiety, based on ratings of perceived anxiety provided by zero-acquaintances. We do not \nmatch perceptions of anxiety with actual user anxiety.  \nHowever, the presented approach and manner of data collection does allow us to \nmeasure perceived user anxiety in a non-invasive, unobtrusive and naturally occurring manner. \nIn addition, our approach allows us to predict other outcomes as well. Based on previous work \nby Quercia et al. (2011), we analysed our data with the goal of predicting future outcomes, \nsuch as popularity and social engagement. Quercia et al. (2011) found that based on just a few \nTwitter profile characteristics, namely the following and followers count (and list count), one \ncan predict tweeters’ personality traits “with a root-mean-squared error below .88” (p. 183). \nAlthough quite impressive, their research design was only cross-sectional in nature, and does \nnot account for changes over time. One could argue, since the Big-5 personality traits are quite \nstable over time (Goldberg et al., 2006) a longitudinal design might not be necessary. However, \nanxiety has both state and trait properties, which requires observation over time. We aimed to \npredict the same outcomes, using a time-sensitive, longitudinal measure of anxiety, accounting \nfor anxiety intensity (state) and frequency (trait). \nInterestingly, we find that perceived anxiety significantly and negatively related to both \nsocial engagement (following count) as well as popularity (follower count). These findings are \nin line with previous research (Quercia et al., 2011). The effect sizes are quite large, which \nprovides confidence that a strong relationship between anxiety and online perception exists. It \nseems individuals who express a high degree of trait anxiety are less likely to follow others \n(social engagement), and are less often followed by others (popularity). Put differently the more \npopular a person is (on Twitter), the less anxiously rated statements they express or tweet, over \ntime. Anxious individuals, in particular those who score high on trait anxiety, would be more \n22 \n \ninclined not to follow others, or accumulate a large follower community. In terms of practical \nimplications of these findings, it is likely that highly anxious individuals potentially limit their \nsocial engagement with others. They are likely to do so as they would worry about being \nperceived negatively by others. Not wanting to show that one is anxious would lead to less \nproactive social engagement with others, and subsequently lower popularity. This negative \nview of self could even lead to increased experienced anxiety over time. Such feelings are \nlikely to be embedded in the behavioural residue such as individuals’ writing, expressions and \nwritten social media interactions. While elevated state anxiety is unlikely to cause such change \nof perceptions, due to the event-specific short duration, sustained elevated state anxiety at the \nworkplace could potentially lead to social exclusion and even hinder career and management \nopportunities (Park, Woo, Park, Kyea, & Yang, 2017).  \nThe interplay between perceived state and trait anxiety we found is vital and relates to \ntwo aspects in this study. Firstly, the method is intrinsically fine-grained, which allows the \ninvestigation of individual users’ expressed anxiety level. In fact, aggregate concepts such as \ntrait anxiety becomes a downstream data analysis step, as concepts of longitudinal study and \nfrequencies are mathematical properties of the state anxiety time-series. In this study, we \nconsidered the mean state anxiety score as trait anxiety and regressed this factor onto social \nengagement and popularity at the aggregated level. Secondly, there is also a methodological \nreason behind this step, which lies in the small error embedded in the methodology, due to the \nmachine learning limitation in exactly mimicking human raters. Such error, while small, can \nbe unsatisfying when looking at an individual tweet. Nonetheless, as discussed in the \nmethodology section, taking aggregates such as the mean, and hence trait anxiety, allows the \nerror to cancel out due to its distribution. Thus, the trait anxiety score is a rather reliable \nmeasure of a user from a methodological perspective.  \n23 \n \nFrom a methodological perspective, the hybrid human-machine approach to anxiety \nlabelling of tweets suggests that the sample of observations can be scaled vastly in multiple \ndimensions. For example, the temporal dimension of tweets conforming to a longitudinal \nextension, and the subjects’ dimensions (i.e. tweeters) which, in principle, can be extended to \na large proportion of the whole population on Twitter, spanning cultures, geographical zones, \netc. Naturally, this would require additional computational power, and Big Data techniques \nsuch as parallel computing can come to the rescue. From a statistical perspective, testing \nhypotheses would lead to higher statistical power compared to a non-machine-based approach. \nHowever, we do not claim to match perceptions of anxiety with actual experienced anxiety, as \nwe would need to ask all tweeters in our database to provide us with self-reports on their \nexperienced anxiety levels during each tweet; a task virtually impossible to accomplish. This \nwould also lead to the analysis of data in a non-natural environment, i.e. being taken out of the \nmoment every time you tweet, so you can fill out an anxiety scale. Reflecting on current anxiety \nlevels would likely also influence the tweet itself.  \nImplications \nThere are certain practical implications, which we can derive from our study. Our study \nlooked at microblogs as the content to analyse expression of anxiety. Microblogs are pervasive \nin many social environments but also in professional contexts. For instance, team collaboration \ntools such as Slack4 often include channels of messages to allow team members to \ncommunicate on certain project or topic. Automatic anxiety scoring of individuals and teams \ncan help monitor the workers wellbeing and prevent situations of excessive anxiety that can \nlead to burnouts affecting the workers and projects alike. At the very least, using this tool \nemployers would be less likely to foster an anxiety loaded work place.  \n                                                           \n4 https://slack.com/ \n24 \n \nOf course, as is the case with any data collection tools (Azucar et al., 2018), this tool \ncould also be exploited and misused. With recent data sharing incidents involving Facebook \n(Levin, 2017) and the possible dissemination of political propaganda to impressionable social \nmedia users (Cadwalladr, 2017; Confessore & Hakim, 2017), the possibilities of misconduct \nare numerous. Policy makers and the public should be made aware that such techniques are \nalready being applied and might need to be restricted in usage, in order to protect individual \nprivacy rights. On an organisational level, the monitoring of individual employees’ emotional \nstates, such as their state anxiety, could potentially also pose privacy violations, especially if \ncompanies exploit such knowledge at the expense of the employees.  \nAnother possible implication of abusing the presented approach revolves around the \nstigma of anxiety. For example, singling out employees who have high trait anxiety, could \nlead to lower employee self-esteem, social rejection and reluctance to seek appropriate \ntreatment (Barney, Griffiths, Jorm, & Christensen, 2006). In certain cases, employees might \nthink that their elevated anxiety levels are only temporary, not severe enough to seek help or \nthey misjudge the toll their elevated anxiety levels are taking on their health and well-being.  \nResearch on the issue of stigma of workplace health issues such as anxiety and depression \nhas found that oftentimes the experienced stigma can be as negative as the mental health \nissue itself (Overton & Medina, 2008). In addition, should employees in question become \nknown in the organization, it could lead to increased stereotyping and discrimination (Szeto \n& Dobson, 2010) with additional negative health consequences for the stigmatized employees \nas well as friends or close colleagues (Corrigan, 2004; Hinshaw, 2009; Thornicroft, Rose, \nKassam, & Sartorius, 2007).  \nThe findings of this study point towards the use of aggregate scores as they are more \naccurate than individual scores. That is due to the normal distribution of the error, which \ncancels out when many scores are aggregated. Thus, profiling based on anxiety scores may \n25 \n \nnot be as accurate at the individual level, let alone the ethical issues such an approach \nimplies. Using such a machine learning model to produce aggregate scores, is more accurate. \nConsequently, our approach could reflect the wellbeing of individuals or groups of \nindividuals, which would allow the implementation of measures, such as organizational or \ngovernmental policies to be implemented to address and hopefully reduce increased anxiety. \nWe encourage scholars to study the impact of the presented technology and its application in \nand out of the workplace in greater detail in future studies. \nLimitations \nFirstly, one of the limitations of this study is that the ratings provided by our zero-\nacquaintances, do not actually measure felt anxiety by the tweeter, but rather perceived anxiety. \nThis has been raised as an in issue in previous work as well (Qiu et al., 2012). In order to make \naccurate predictions with regard to actual user anxiety further validation of our approach is \nneeded. One potential validation would constitute combining the presented approach with other \nlongitudinally assessed repeated self-report measures of anxiety in a group of participants. \nParticipants’ would provide daily self-report assessments on anxiety, while their social media \ncommunication could be examined using the presented approach. Doing so would allow \nresearchers to compare the accuracy and validity of the presented method. \nSecondly, an argument could be made that online behaviour greatly differs from offline \nbehaviour, and hence deriving behavioural residue from online sources is not feasible in \nexplaining relationships to psychological characteristics. However, the contrary has been found \n(Roberts, Kuncel, Shiner, Caspi, & Goldberg, 2007). Social media users seem to view their \nonline profiles as an extension of the self, rather than a separate entity (Back et al., 2010; \nSeidman, 2013). Not only does online behaviour relate strongly to psychological \ncharacteristics, the accuracy to predict characteristics based on online data is becoming stronger \n26 \n \nover time, as data mining techniques become more sophisticated using machine learning \n(Azucar et al., 2018; Kosinski, Wang, Lakkaraju, & Leskovec, 2016). In addition, the more \ndata is available, the stronger the association and prediction accuracy of behaviour (Azucar et \nal., 2018). \nThirdly, the ratings by our human raters might have been influenced by the raters’ own \nanxiety or personality disposition. Even though we used a machine learning approach, it is \npossible that while learning how the human raters have rated each tweet, the machine learning \nalgorithm also picked up the raters’ personality. This point is vital and needs to be explored in \nfuture research. However, we are confident that this is potentially only a small influencing \nfactor. That is due to two reasons: a) each tweet was evaluated by several raters, and b) the sets \nof raters for each tweet are composed randomly. Hence, in merely a few instances would an \nexact set of raters (5-6 per tweet) evaluate multiple tweets, due to the randomized display of \ntweets, and the randomized rater allocation to each tweet.  \nFourthly, anxious individuals are more likely to disclose intimate information about \nthemselves to others to seem more approachable (Collins & Miller, 1994). Hence, they also \nuse social media to learn about others (Seidman, 2013). They are more likely to use Twitter to \ndo so, since most information on Twitter is public. Hence, it is possible that our results might \ndiffer if we had chosen Facebook as our data source. However, based on previous research \n(Azucar et al., 2018; Settanni et al., 2018) it is unlikely that social media type (public vs. \nprivate) would influence the prediction accuracy of the psychological characteristic anxiety.  \nFinally, one could argue that culture plays an important role as well. As has been noted \nin previous studies (Masuda & Nisbett, 2001; Tskhay & Rule, 2014), there is likely a difference \nin the ratings between participants who come from East Asian cultures rather than Western \ncultures. We are confident to have avoided this pitfall, since we included only participants as \n27 \n \nraters who are from the United States. Tweets were subsequently also screened for \ngeographical location, based on location and time zones, to ensure that American participants \nrate tweets only from American (or in the US residing) tweeters. \nConclusion \nIn this study, we have employed a machine learning model to scale the ability to score \nmore than three million tweets on a perceived anxiety scale. The method is non-invasive and \nlongitudinal providing fine-grained anxiety scores for 1,418 tweeters timelines, spanning 18 \nmonths on average per user. Data analysis reveals that perceived state anxiety fluctuates per \neach user over time, but some users have a higher long term mean trait anxiety than others do.  \nData analysis also showed a statistically significant, reverse relationship between trait anxiety \nand users’ social engagement and popularity, respectively. The presented method can have \npractical implications in organizations as it allows the automatic monitoring of employees’ \nwellbeing and could be used to prevent the onset of burnout, benefitting workers, organizations, \nand society alike. \n28 \n \nReferences \nAslam, S. (2017). Twitter by the numbers: Stats, demographics & fun facts. Omnicore. \nRetrieved August, 12, 2017.  \nAzucar, D., Marengo, D., & Settanni, M. (2018). Predicting the Big 5 personality traits from \ndigital footprints on social media: A meta-analysis. Personality and Individual \nDifferences, 124, 150-159.  \nBack, M. D., Stopfer, J. M., Vazire, S., Gaddis, S., Schmukle, S. C., Egloff, B., & Gosling, S. \nD. (2010). Facebook profiles reflect actual personality, not self-idealization. \nPsychological science, 21(3), 372-374.  \nBarney, L. J., Griffiths, K. M., Jorm, A. F., & Christensen, H. (2006). Stigma about depression \nand its impact on help-seeking intentions. Australian & New Zealand Journal of \nPsychiatry, 40(1), 51-54.  \nCadwalladr, C. (2017). The great British Brexit robbery: how our democracy was hijacked. the \nGuardian, 20.  \nCollins, N. L., & Miller, L. C. (1994). Self-disclosure and liking: a meta-analytic review. \nPsychological bulletin, 116(3), 457.  \nConfessore, N., & Hakim, D. (2017). Data firm says ‘secret sauce’aided Trump; many scoff. \nNew York Times, 6.  \nCorrigan, P. (2004). How stigma interferes with mental health care. American psychologist, \n59(7), 614.  \nDe Choudhury, M., Counts, S., & Horvitz, E. (2013). Predicting postpartum changes in \nemotion and behavior via social media. Paper presented at the Proceedings of the \nSIGCHI Conference on Human Factors in Computing Systems. \nDe Choudhury, M., Counts, S., Horvitz, E. J., & Hoff, A. (2014). Characterizing and predicting \npostpartum depression from shared facebook data. Paper presented at the Proceedings \nof the 17th ACM conference on Computer supported cooperative work & social \ncomputing. \nDorz, S., Borgherini, G., Conforti, D., Scarso, C., & Magni, G. (2004). Comparison of self‐\nrated and clinician‐rated measures of depressive symptoms: A naturalistic study. \nPsychology and Psychotherapy: Theory, Research and Practice, 77(3), 353-361.  \nEichstaedt, J. C., Schwartz, H. A., Kern, M. L., Park, G., Labarthe, D. R., Merchant, R. M., . . \n. Sap, M. (2015). Psychological language on Twitter predicts county-level heart disease \nmortality. Psychological science, 26(2), 159-169.  \nEysenck, M. W. (2000). A cognitive approach to trait anxiety. European Journal of \nPersonality, 14(5), 463-476.  \nFisher, R. J. (1993). Social desirability bias and the validity of indirect questioning. Journal of \nconsumer research, 20(2), 303-315.  \nFunder, D. C., Kolar, D. C., & Blackman, M. C. (1995). Agreement among judges of \npersonality: Interpersonal relations, similarity, and acquaintanceship. Journal of \nPersonality and Social Psychology, 69(4), 656.  \nGill, A. J., & Oberlander, J. (2002). Taking care of the linguistic features of extraversion. Paper \npresented at the Proceedings of the Cognitive Science Society. \nGolbeck, J., Robles, C., & Turner, K. (2011). Predicting personality with social media. Paper \npresented at the CHI'11 extended abstracts on human factors in computing systems. \nGoldberg, L. R., Johnson, J. A., Eber, H. W., Hogan, R., Ashton, M. C., Cloninger, C. R., & \nGough, H. G. (2006). The international personality item pool and the future of public-\ndomain personality measures. Journal of Research in personality, 40(1), 84-96. \ndoi:10.1016/j.jrp.2005.08.007 \n29 \n \nGosling, S. D., Ko, S. J., Mannarelli, T., & Morris, M. E. (2002). A room with a cue: personality \njudgments based on offices and bedrooms. Journal of Personality and Social \nPsychology, 82(3), 379.  \nGraham, L. T., & Gosling, S. D. (2012). Impressions of World of Warcraft players’ \npersonalities based on their usernames: Interobserver consensus but no accuracy. \nJournal of research in personality, 46(5), 599-603.  \nHinshaw, S. P. (2009). The mark of shame: Stigma of mental illness and an agenda for change: \nOxford University Press. \nHirsh, J. B., & Peterson, J. B. (2009). Personality and language use in self-narratives. Journal \nof research in personality, 43(3), 524-527.  \nHolleran, S. E., & Mehl, M. R. (2008). Let me read your mind: Personality judgments based \non a person’s natural stream of thought. Journal of research in personality, 42(3), 747-\n754.  \nHuberman, B. A., Romero, D. M., & Wu, F. (2009). Crowdsourcing, attention and productivity. \nJournal of Information Science, 35(6), 758-765.  \nHughes, D. J., Rowe, M., Batey, M., & Lee, A. (2012). A tale of two sites: Twitter vs. Facebook \nand the personality predictors of social media usage. Computers in Human Behavior, \n28(2), 561-569.  \nKanagawa, C., Cross, S. E., & Markus, H. R. (2001). “Who am I?” The cultural psychology of \nthe conceptual self. Personality and Social Psychology Bulletin, 27(1), 90-103.  \nKosinski, M., Matz, S. C., Gosling, S. D., Popov, V., & Stillwell, D. (2015). Facebook as a \nresearch tool for the social sciences: Opportunities, challenges, ethical considerations, \nand practical guidelines. American psychologist, 70(6), 543.  \nKosinski, M., Stillwell, D., & Graepel, T. (2013). Private traits and attributes are predictable \nfrom digital records of human behavior. Proceedings of the National Academy of \nSciences, 201218772.  \nKosinski, M., Wang, Y., Lakkaraju, H., & Leskovec, J. (2016). Mining big data to extract \npatterns and predict real-life outcomes. Psychological methods, 21(4), 493.  \nKwak, H., Lee, C., Park, H., & Moon, S. (2010). What is Twitter, a social network or a news \nmedia? Paper presented at the Proceedings of the 19th international conference on \nWorld wide web. \nLee‐Baggley, D., Preece, M., & DeLongis, A. (2005). Coping with interpersonal stress: Role \nof Big Five traits. Journal of personality, 73(5), 1141-1180.  \nLevin, S. (2017). Facebook promised to tackle fake news. But the evidence shows it’s not \nworking. the Guardian, 16.  \nLi, L., Li, A., Hao, B., Guan, Z., & Zhu, T. (2014). Predicting active users' personality based \non micro-blogging behaviors. PLoS One, 9(1), e84997.  \nMacKay, D. J. (1992). Bayesian interpolation. Neural computation, 4(3), 415-447.  \nMacrae, C. N., & Quadflieg, S. (2010). Perceiving people. Handbook of social psychology.  \nMarteau, T. M., & Bekker, H. (1992). The development of a six‐item short‐form of the state \nscale of the Spielberger State—Trait Anxiety Inventory (STAI). British Journal of \nClinical Psychology, 31(3), 301-306.  \nMasuda, T., & Nisbett, R. E. (2001). Attending holistically versus analytically: Comparing the \ncontext sensitivity of Japanese and Americans. Journal of Personality and Social \nPsychology, 81(5), 922-934.  \nMatz, S. C., & Netzer, O. (2017). Using big data as a window into consumers’ psychology. \nCurrent opinion in behavioral sciences, 18, 7-12.  \nNaaman, M., Boase, J., & Lai, C.-H. (2010). Is it really about me?: message content in social \nawareness streams. Paper presented at the Proceedings of the 2010 ACM conference \non Computer supported cooperative work. \n30 \n \nNewton, T. L., & Contrada, R. J. (1992). Repressive coping and verbal-autonomic response \ndissociation: The influence of social context. Journal of Personality and Social \nPsychology, 62(1), 159.  \nOulasvirta, A., Lehtonen, E., Kurvinen, E., & Raento, M. (2010). Making the ordinary visible \nin microblogs. Personal and ubiquitous computing, 14(3), 237-249.  \nOverton, S. L., & Medina, S. L. (2008). The stigma of mental illness. Journal of Counseling & \nDevelopment, 86(2), 143-151.  \nPark, K., Woo, S., Park, K., Kyea, J., & Yang, E. (2017). The Mediation Effects of Career \nExploration on the Relationship Between Trait Anxiety and Career Indecision. Journal \nof Career Development, 44(5), 440-452.  \nPekrun, R., Goetz, T., Frenzel, A. C., Barchfeld, P., & Perry, R. P. (2011). Measuring emotions \nin students’ learning and performance: The Achievement Emotions Questionnaire \n(AEQ). Contemporary educational psychology, 36(1), 36-48.  \nPennebaker, J. W., Francis, M. E., & Booth, R. J. (2001). Linguistic inquiry and word count: \nLIWC 2001. Mahway: Lawrence Erlbaum Associates, 71(2001), 2001.  \nPennington, J., Socher, R., & Manning, C. (2014). Glove: Global vectors for word \nrepresentation. Paper presented at the Proceedings of the 2014 conference on empirical \nmethods in natural language processing (EMNLP). \nQiu, L., Lin, H., Ramsay, J., & Yang, F. (2012). You are what you tweet: Personality expression \nand perception on Twitter. Journal of Research in personality, 46(6), 710-718.  \nQuercia, D., Kosinski, M., Stillwell, D., & Crowcroft, J. (2011). Our twitter profiles, our \nselves: Predicting personality with twitter. Paper presented at the Privacy, Security, \nRisk and Trust (PASSAT) and 2011 IEEE Third Inernational Conference on Social \nComputing (SocialCom), 2011 IEEE Third International Conference on. \nReady, R. E., Clark, L. A., Watson, D., & Westerhouse, K. (2000). Self-and peer-reported \npersonality: Agreement, trait ratability, and the “self-based heuristic”. Journal of \nresearch in personality, 34(2), 208-224.  \nRoberts, B. W., Kuncel, N. R., Shiner, R., Caspi, A., & Goldberg, L. R. (2007). The power of \npersonality: The comparative validity of personality traits, socioeconomic status, and \ncognitive ability for predicting important life outcomes. Perspectives on Psychological \nScience, 2(4), 313-345.  \nSchat, A., van Noorden, M. S., Giltay, E. J., Noom, M. J., Vermeiren, R. R., & Zitman, F. G. \n(2017). Concordance between self‐reported and observer‐rated anxiety severity in \noutpatients with anxiety disorders: The Leiden routine outcome monitoring study. \nPsychology and Psychotherapy: Theory, Research and Practice, 90(4), 705-719.  \nSeidman, G. (2013). Self-presentation and belonging on Facebook: How personality influences \nsocial media use and motivations. Personality and Individual Differences, 54(3), 402-\n407.  \nSettanni, M., Azucar, D., & Marengo, D. (2018). Predicting Individual Characteristics from \nDigital Traces on Social Media: A Meta-Analysis. Cyberpsychology, Behavior, and \nSocial Networking, 21(4), 217-228.  \nSettanni, M., & Marengo, D. (2015). Sharing feelings online: studying emotional well-being \nvia automated text analysis of Facebook posts. Frontiers in psychology, 6, 1045.  \nSpielberger, C. D., Gorsuch, R. L., Lushene, R., Vagg, P. R., & Jacobs, G. (1983). State-trait \nanxiety inventory for adults: Mind Garden. \nSwickert, R. J., Rosentreter, C. J., Hittner, J. B., & Mushrush, J. E. (2002). Extraversion, social \nsupport processes, and stress. Personality and Individual Differences, 32(5), 877-891.  \nSzeto, A. C., & Dobson, K. S. (2010). Reducing the stigma of mental disorders at work: a \nreview of current workplace anti-stigma intervention programs. Applied and Preventive \nPsychology, 14(1-4), 41-56.  \n31 \n \nThornicroft, G., Rose, D., Kassam, A., & Sartorius, N. (2007). Stigma: ignorance, prejudice or \ndiscrimination? The British Journal of Psychiatry, 190(3), 192-193.  \nTskhay, K. O., & Rule, N. O. (2014). Perceptions of personality in text-based media and OSN: \nA meta-analysis. Journal of research in personality, 49, 25-30.  \nVazire, S., & Mehl, M. R. (2008). Knowing me, knowing you: the accuracy and unique \npredictive validity of self-ratings and other-ratings of daily behavior. Journal of \nPersonality and Social Psychology, 95(5), 1202.  \nWald, R., Khoshgoftaar, T. M., Napolitano, A., & Sumner, C. (2012). Using Twitter content to \npredict psychopathy. Paper presented at the Machine Learning and Applications \n(ICMLA), 2012 11th International Conference on. \nWatson, D., Clark, L. A., & Carey, G. (1988). Positive and negative affectivity and their \nrelation to anxiety and depressive disorders. Journal of abnormal psychology, 97(3), \n346.  \nYee, N., Ducheneaut, N., Nelson, L., & Likarish, P. (2011). Introverted elves & conscientious \ngnomes: the expression of personality in world of warcraft. Paper presented at the \nProceedings of the SIGCHI Conference on Human Factors in Computing Systems. \nYouyou, W., Kosinski, M., & Stillwell, D. (2015). Computer-based personality judgments are \nmore accurate than those made by humans. Proceedings of the National Academy of \nSciences, 112(4), 1036-1040.  \n \n \n \n32 \n \nTable 1 – Correlations among variables \n \n \nM \nSD \n1 \n2 \n3 \n4 \n5 \n1 Anxiety \n2.34 \n.34 \n(.90) \n \n \n \n \n2 Follower Count \n4483.88 \n64562.07 \n-.01*** \n \n \n \n \n3 Following Count \n1221.43 \n4235.46 \n-.02*** \n.08*** \n \n \n \n4 Tweet Count \n35697.49 \n75479.47 \n.03*** \n.04*** \n.29*** \n \n \n5 Tweet Reply \n.18 \n.38 \n.03*** \n-.02*** \n-.03*** \n-.04*** \n \n6 Retweet \n.53 \n.49 \n.04*** \n-.01*** \n-.02*** \n.03*** \n-.49*** \n \n*** p < .001, n = 3,292,193 observations \n \nTable 2 – Impact of Perceived Anxiety on Popularity (Follower Count) and Social Engagement (Following Count) by User \n \n \nPopularity (Follower Count) \nSocial Engagement (Following Count) \n \n6 months \n12 months \n6 months \n12 months \n \nM1 \nM2 \nM1 \nM2 \nM1 \nM2 \nM1 \nM2 \nAnxiety \n-.60*** \n-.79 \n-.58* \n-.77** \n-.44† \n-.69 \n-.39 \n-.64* \n \n(-2.72) \n(-3.22) \n(-2.35) \n(-2.85) \n(-1.64) \n(-2.54) \n(-1.43) \n(-2.34) \nTweet Count \n \n.00*** \n \n.00*** \n \n.00*** \n \n.00*** \n \n \n(4.02) \n \n(4.04) \n \n(4.42) \n \n(4.43) \nconst \n9.56*** \n9.86*** \n9.50*** \n9.81 \n7.93*** \n8.33*** \n7.80*** \n8.22*** \n \n(16.75) \n17.85 \n(15.69) \n(16.56) \n(12.04) \n(12.31) \n(11.73) \n(12.01) \nPseudo R2 \n \n.034*** \n \n.034*** \n \n.16*** \n \n.16*** \n \nn = 1322 users; † p < .10, ***p < .001, **p < .01, *p < .05; z-statistics in parentheses.\n33 \n \n \n \nFigure 1 – Research (Machine Learning) Methodology \n \n \n34 \n \n \nFigure 2 – Interclass Correlation for Randomly Selected 20 Tweets.  \nEach dot in the dot plot represents a rating form a particular rater for the corresponding tweet. \nClustered dots for a tweet represent high inter-rater agreement. A random subset of tweets are \nselected for visualization purposes. \n \n \n \nFigure 3 – Correlation between Machine Learning Anxiety Scores and Human Scores \n \n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\n4\n4.5\n0\n40\n80\n120\n160\n200\n240\n280\n320\n360\n400\n440\n480\n520\n560\n600\nAnxiety Score by each Rater\nTweet ID\nIntraclass Correlation Coefficient (ICC)=0.69\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\n4\n0\n1\n2\n3\n4\nMachine Learning Score\nHuman Score\nR² = 0.47; Spearman Correlation = 0.69; RMSE= 0.52\n35 \n \n \n \n \n \n \nFigure 4 – Histogram of Machine Learning Error \n \n \n \nFigure 5 – Correlation between LIWC Normalized Sentiment Scores and Human Scores \n \n \n \n \n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\nNumber of Tweets\nMachine Learning Error\nRMSE= 0.52\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\n4\n4.5\n0\n1\n2\n3\n4\nLIWC  Sentiment Score\nHuman Score\nR² = 0.21; Spearman Correlation = 0.49; RMSE= 0.63\n36 \n \n \n \n \nFigure 6 – Visualization of Random Tweeters’ Anxiety Scores over Time \n \n \n"
    },
    {
        "Published": "2024-11-06",
        "Title": "WorryWords: Norms of Anxiety Association for over 44k English Words",
        "Authors": "Saif M. Mohammad",
        "Summary": "Anxiety, the anticipatory unease about a potential negative outcome, is a\ncommon and beneficial human emotion. However, there is still much that is not\nknown, such as how anxiety relates to our body and how it manifests in\nlanguage. This is especially pertinent given the increasing impact of\nanxiety-related disorders. In this work, we introduce WorryWords, the first\nlarge-scale repository of manually derived word--anxiety associations for over\n44,450 English words. We show that the anxiety associations are highly\nreliable. We use WorryWords to study the relationship between anxiety and other\nemotion constructs, as well as the rate at which children acquire anxiety words\nwith age. Finally, we show that using WorryWords alone, one can accurately\ntrack the change of anxiety in streams of text. The lexicon enables a wide\nvariety of anxiety-related research in psychology, NLP, public health, and\nsocial sciences. WorryWords (and its translations to over 100 languages) is\nfreely available. http://saifmohammad.com/worrywords.html",
        "Page_content": "WorryWords: Norms of Anxiety Association for over 44k English Words\nSaif M. Mohammad\nNational Research Council Canada\nsaif.mohammad@nrc-cnrc.gc.ca\nAbstract\nAnxiety, the anticipatory unease about a\npotential negative outcome, is a common\nand beneficial human emotion.\nHowever,\nthere is still much that is not known, such\nas how anxiety relates to our body and how\nit manifests in language. This is especially\npertinent given the increasing impact of\nanxiety-related disorders.\nIn this work, we\nintroduce WorryWords, the first large-scale\nrepository of manually derived word–anxiety\nassociations for over 44,450 English words.\nWe show that the anxiety associations are\nhighly reliable. We use WorryWords to study\nthe relationship between anxiety and other\nemotion constructs, as well as the rate at\nwhich children acquire anxiety words with\nage. Finally, we show that using WorryWords\nalone, one can accurately track the change of\nanxiety in streams of text. The lexicon enables\na wide variety of anxiety-related research in\npsychology, NLP, public health, and social\nsciences. WorryWords (and its translations to\nover 100 languages) is freely available.\nhttp://saifmohammad.com/worrywords.\nhtml\n1\nIntroduction\nAnxiety is the apprehensive uneasiness or nervous-\nness due to some anticipated or potential negative\noutcome. Even though it is often considered to be\nan unwanted and negative feeling, psychologists\nhave long posited its evolutionary benefits. As a\nspecies, we have benefited from feeling anxious:\nfor example, building safe dwellings to avoid being\nattacked by wild animals and poisonous insects,\nbeing respectful and kind to others to avoid social\nexclusion, and so on (Bateson et al., 2011). Yet,\nthere is much we do not know such as the mecha-\nnisms of how anxiety develops in our bodies and\nmind, how normal and clinical anxiety manifest in\nlanguage, and effective mechanisms to cope with\nexcessive anxiety. Further, the dramatic technologi-\ncal advances over the last few decades have rapidly\nand substantially changed our environments to such\nan extent (for instance, the widespread social me-\ndia usage and human–technology interactions) that\nthere is now a considerable mismatch between the\ncurrent environment and what our anxiety response\nslowly evolved to address over millennia (Blease,\n2015; Salecl, 2004; Qureshi-Hurst, 2022). This has\nled some to argue that we are in an ‘age of anxiety’\n(Parish, 2000; Blease, 2015).\nAnxiety has always been a part of normal hu-\nman life. Some might feel anxious occasionally\nand in particular circumstances (state anxiety), and\nsome might have a more diffuse sense of general\nanxiety over long periods of time (trait anxiety).\nSome of the major sources of anxiety include tests,\nsports, technology, and social anxiety (Zeidner and\nMatthews, 2010). More recently researchers have\nalso identified a growing amount of climate change\nanxiety (Clayton, 2020). Mental health practition-\ners clinically diagnose anxiety disorders when the\nsense of anxiety is so high or so frequent that it im-\npacts the day-to-day functioning of an individual.\nIn the US alone, 6.8 million adults (3.1% of the\npopulation) are believed to have Generalized Anxi-\nety Disorder (GAD), 15 million adults (7.1%) have\nSocial Anxiety Disorder (SAD), 7.7 million adults\n(3.6%) suffer from Post-traumatic Stress Disorder\n(PTSD), and everyone experiences stress from time\nto time.1 Anxiety disorders are highly co-morbid\nwith depression (Kalin, 2020), and together they\nconstitute the internalizing disorders.\nIn addition to impacting well-being and happi-\nness, anxiety (both normal and clinical) has been\nshown to impact cognitive outcomes such as learn-\ning, accurately performing tasks, productivity, as\nwell as our physical bodies (Kim and Gorman,\n2005). In contrast, calmness (being in a state of\npeace and tranquility) has been shown to improve\nhealth and cognitive outcomes (Siddaway et al.,\n1https://adaa.org/understanding-anxiety/facts-statistics\narXiv:2411.03966v1  [cs.CL]  6 Nov 2024\n2018). Siddaway et al. (2018) also show the impor-\ntance of conceptualizing anxiety as a continuum\nfrom high calmness to high anxiety; and that both\npromoting calmness and decreasing excessive anxi-\nety are important for overall health and well-being.\nThus, anxiety and calmness are active areas of re-\nsearch in Psychology, Medicine, Public Health, So-\ncial Science, Economics, and even the Humanities.\nAs is the case with many emotions, people ex-\npress anxiety through language (consciously and\nunconsciously). In this work, we study how anxi-\nety and calmness are associated with word mean-\ning. We asked over a thousand respondents to rate\n44,450 English words on a scale from −3 (associ-\nated with high calmness) to +3 (associated with\nhigh anxiety). We aggregated the responses to cre-\nate a word–anxiety association lexicon that has a\nreal-valued anxiety score for each of the words. We\nrefer to this resource by the name WorryWords. We\nshow that the scores in WorryWords are highly reli-\nable (a split-half reliability score of 0.82, which is\nin-line with scores for existing resources for other\nemotions). We use WorryWords to study how anxi-\nety is related to other emotion constructs (valence,\narousal, dominance, fear, anger, sadness, etc.). We\nshow the rate at which anxiety and calmness words\nare acquired with age. Finally, we show that Wor-\nryWords can be used with simple word-counting\nmethods to accurately track anxiety in text streams.\nWe make WorryWords, and its translations in\nover 100 languages, freely available for research\nthrough the project home page.2 Some areas where\nwe envisage its use include:\n1. Understanding anxiety and the underlying\nmechanisms; how anxiety relates to other emo-\ntions; how it relates to our body; how anxi-\nety changes with age, socio-economic status,\nweather, green spaces, etc.\n2. Determining how anxiety manifests in lan-\nguage; how language shapes anxiety; how cul-\nture shapes the language of anxiety; etc.\n3. Tracking the degree of anxiety towards targets\nof interest such as climate change, govern-\nment policies, biological vectors, etc.\n4. Identifying effective coping mechanisms and\nclinical interventions to manage anxiety.\n5. Developing automatic systems for detecting\nanxiety; developing chat systems that are sen-\nsitive to nuances and diverse expressions of\nanxiety by people from various demographics.\n2http://saifmohammad.com/worrywords.html\n6. Studying anxiety and uneasiness in story\ntelling; its relationship with central elements\nof narratology such as conflict and resilience.\n7. Studying how anxiety impacts social be-\nhaviour in physical and virtual environments.\nWe also created an extensive list of ethical consid-\nerations (Section 9) that must be taken into consid-\neration when using WorryWords.\n2\nRelated Work\nIt is generally agreed that the three primary di-\nmensions of affect (our sense of feeling) are\nvalence (positiveness–negativeness / pleasure–\ndispleasure), arousal (active–passive), and dom-\ninance (dominant–submissive) (Russell, 1980; Os-\ngood et al., 1957). There is also work showing\nthat certain categorical emotions such as joy, anger,\nand fear are particularly important (Ekman, 1992;\nPlutchik, 1980). More recent work shows that we\nconstruct and label these emotions (a cognitive pro-\ncess) in our minds from various interoceptive sig-\nnals (internal signals from our body to the brain)\n(Barrett, 2017).\nAnxiety is often considered a low-valence, high-\narousal, and low-dominance emotion, but there\nis little work empirically exploring the degree to\nwhich it is correlated with these affective dimen-\nsions. Anxiety is also often compared to fear, but\nunlike fear which generally tends to be a reaction\nto a threat from the present (something that has\nalready manifested), anxiety is often associated\nwith the possible negative outcome of a future\nevent (Bateson et al., 2011). Anxiety and stress\nare sometimes used synonymously and they are\ngenerally agreed to be very close emotions (both\nimpact mind and body through excessive worrying,\nloss of sleep, etc.), although stress is often associ-\nated with some physical stimulus and stress can be\none of the causes of anxiety.\nManually created word–emotion association lex-\nicons exist for valence, arousal, and dominance\n(Warriner et al. (2013) and Mohammad (2018a) for\nEnglish; Moors et al. (2013) for Dutch, and Võ et al.\n(2009) for German). The largest among these is the\nNRC VAD lexicon (Mohammad, 2018a, 2024a):\nversion 1 has entries for over 20,000 English words,\nand version 2 for over 44,000 unigrams and 10,000\nbigrams (two-word sequences). The NRC Emotion\nLexicon (Mohammad and Turney, 2010) is a popu-\nlar lexicon for categorical emotions; it has entries\nfor over 14,000 English words.\nWe do not know of existing large lexicons for\nanxiety; however, there exist some datasets of so-\ncial media posts manually annoatated with anxiety\nor stress labels. Rastogi et al. (2022) collected and\nannotated about 5,488 Reddit posts with the labels\n0 (no stress) and 1 (stress). Mitrovi´c et al. (2024)\ncollected a series of questions and answers from\nQuora and Reddit, where the question contained\nthe term ‘anxiety’. Turcan and McKeown (2019)\ncreated a dataset of 4000 5-sentence segments from\nReddit annotated for presence or absence of stress.\nThese social media datasets were compiled primar-\nily to train and test automatic systems that attempt\nto detect anxiety from text. For details on automatic\nanxiety detection, we refer the interested readers to\nMitrovi´c et al. (2024); Shen and Rudzicz (2017);\nRastogi et al. (2022); Winata et al. (2018). More\nrecent work interviewed volunteers and analyzed\ntheir responses to identify language features such\nas the use of personal pronouns, negations, and\nemotion words with anxiety (Stade et al., 2023).\nAs part of the WorryWords Project, we created\na large word–anxiety association lexicon with a\nfocus on reliable annotations.3 We used existing\nemotion lexicons to examine how anxiety is related\nto other emotions. We also made use of a the Ras-\ntogi et al. (2022) dataset to show the usefulness of\nWorryWords in tracking anxiety in text streams.\n3\nObtaining Human Ratings of Anxiety\nThe keys steps in creating the anxiety dataset were:\n1. selecting the terms to be annotated\n2. developing the questionnaire\n3. developing measures for quality control (QC)\n4. annotating terms on a crowdsource platform\n5. discarding data from outlier annotators (QC)\n6. aggregating data from multiple annotators to\ndetermine the anxiety association scores\nWe describe each of these steps below.\n1. Term Selection. To allow for the study of anxi-\nety with respect to other affectual and linguistically\ninteresting properties, we included terms from: the\nNRC Emotion Lexicon (Mohammad and Turney,\n2013, 2010), the NRC VAD Lexicon (Mohammad,\n2018a), and the terms from the Prevalence dataset\n(Brysbaert et al., 2019) (specifically, words marked\nas being known to over 70% of the respondents).\nSummary details of each of these is provided in the\nAppendix. The union of the above sets resulted in\n3In follow on work, we also compiled anxiety association\nnorms for over 10K English phrases (Mohammad, 2024b).\n44,450 terms that were then annotated for associa-\ntion with anxiety and calmness.\n2. Anxiety Questionnaire. The questionnaires\nused to annotate the data were developed across\ntwo rounds of pilot annotations. Detailed direc-\ntions, including notes directing them to consider\npredominant word sense (in case the word is\nambiguous) and example questions (with suitable\nresponses) were provided. (See Appendix.) The\nprimary instruction and the question presented to\nannotators is shown below.\nConsider anxiety to be a broad category that includes:\njittery, antsy, insecure, nervous, unease, tense, worried,\nunnerving, nerve-racking, apprehensive, fretful, troubled,\nself-doubting, discontented, concerned, and keyed up\nConsider calmness to be a broad category that includes:\ncalm, relaxed, comforted, serene, at ease, self-assured,\ncarefree, composed, collected, untroubled, peaceful,\ncontented, unconcerned, indifferent, and uninvolved\nSelect the options that most English speakers will agree with.\nQ1. <term> is often associated with feeling:\n3: very anxious\n-1: slightly calm\n2: moderately anxious\n-2: moderately calm\n1: slightly anxious\n-3: very calm\n0: not associated with feeling anxious or calm\n3. Quality Control Measures. About 2% of the\ndata was annotated beforehand by the authors and\ninterspersed with the rest. These questions are\nreferred to as gold (aka control) questions.\nHalf of the gold questions were used to provide\nimmediate feedback to the annotator (in the form\nof a pop-up on the screen) in case they mark them\nincorrectly. We refer to these as popup gold. This\nhelps prevent the situation where one annotates a\nlarge number of instances without realizing that\nthey are doing so incorrectly. It is possible, that\nsome annotators share answers to gold questions\nwith each other (despite this being against the\nterms of annotation). Thus, the other half of the\ngold questions were also separately used to track\nhow well an annotator was doing the task, but for\nthese gold questions no popup was displayed in\ncase of errors. We refer to these as no-popup gold.\n4. Crowdsourcing. We setup the anxiety annota-\ntion task on the crowdsourcing platform, Mechan-\nical Turk. In the task settings, we specified that\nwe needed annotations from ten people for each\nword. We obtained annotations from native speak-\ners of English residing around the world. Anno-\ntators were free to provide responses to as many\nterms as they wished. The annotation task was\napproved by our institution’s review board.\nDataset\n#words\nAnnotators\n#Annotators\n#Annotations\nMAI\nSHR (ρ)\nSHR (r)\nunigrams\n44,450\nUS, India, UK, Canada\n1,020\n375,796\n8.5\n0.82\n0.89\nTable 1: A summary of the WorryWords annotations. MAI = mean annotations per word. SHR, measured through\nboth Spearman rank and Pearson’s correlations (last two columns), indicate high reliability.\nFigure 1: Distribution of terms in WorryWords: per-\ncentage of terms associated with each class. (The total\nnumber is shown in parenthesis.)\nDemographics: About 87% of the respondents\nwho annotated the words live in USA. The rest\nwere from India, United Kingdom, and Canada.\nThe average age of the respondents was 38.9\nyears. Among those that disclosed their gender,\nabout 54% were female and about 45% were male.4\n5. Filtering. If an annotator’s accuracy on the gold\nquestions (popup or non-popup) fell below 80%,\nthen they were refused further annotation, and all\nof their annotations were discarded (despite being\npaid for). See Table 1 for summary statistics.\n6. Aggregation. Every response was mapped to\nan integer from -3 (very calm) to 3 (very anxious).\nThe final anxiety score for each term is simply the\naverage score it received from each of the anno-\ntators. We also created a categorical version of\nthe lexicon by labeling all words that got a score\n≥2.5 as associated with high anxiety, ≥1.5 and\n< 2.5 as moderate anxiety, ≥0.5 and < 1.5 as\nslight anxiety, > −0.5 and < 0.5 as neither anxi-\nety nor calmness, and so on. We refer to the list of\nwords along with their real-valued final scores and\ncategorical labels as the WorryWords Lexicon.\nTable 6 in the Appendix shows example entries\nfrom the lexicon. Figure 1 shows the distribution\nof the different classes. As expected, most words\nare associated with neither anxiety nor calmness\n(∼60%), but it is worth noting that about 27% of\nthe words are associated with anxiety (to some\ndegree) and about 13% of the words are associated\nwith calmness (to some degree).\n4Respondents were shown optional text boxes to disclose\ntheir demographic information as they choose; especially im-\nportant for social constructs such as gender, in order to give\nagency to the respondents and to avoid binary language.\n4\nReliability of the Annotations\nA useful measure of quality is the reproducibility\nof the end result—repeated independent manual an-\nnotations from multiple respondents should result\nin similar scores. To assess this reproducibility, we\ncalculate average split-half reliability (SHR) over\n1000 trials.5 All annotations for an item are ran-\ndomly split into two halves. Two separate sets of\nscores are aggregated, just as described in Section 3\n(bullet 6), from the two halves. Then we determine\nhow close the two sets of scores are (using a metric\nof correlation). This is repeated 1000 times and the\ncorrelations are averaged. The last two columns\nin Table 1 show the results (split half-reliabilities).\nScores of 0.82 (Spearman rank correlation) and\n0.89 (Pearson correlation) indicate high reliability\nof the real-valued scores obtained from the anno-\ntations. (For reference, if the annotations were\nrandom, then repeat annotations would have led to\nan SHR of 0. Perfectly consistent repeated annota-\ntions lead to an SHR of 1.)\nIf the real-valued scores are converted to discrete\ncategories (for example, into 3, 7, or 10, classes),\nthen we can make use of another measure of reli-\nability that factors in the classes. For example, if\nwe just want three classes: associated with anxiety,\nassociated with calmness, and neither. Then one\ncould simply split the -3 to 3 range into three equal\npartitions of -3 to -1 (calmness), -1 to 1 (neither),\nand 1 to 3 (anxiousness). To determine reliability\nof the discrete labels obtained from annotations,\nwe first randomly split all annotations into two\nhalves (just as before). Now, if scores for a term x\nobtained from the two halves place x in different\nclasses (e.g., if the two scores are 0.36 and 1.72),\nthen this contributes to a lower overall reliability.\nIn contrast, even if the scores for x from the two\nhalves vary a bit, but both scores place x in the\nsame class (e.g., if the two scores are 1.82 and\n1.79) then this contributes to a higher overall reli-\nability. Thus we can compute reliability from the\nextent to which the two halves of annotations result\nin the same discrete class. We will refer to this as\nthe Split-Half Class Match Percentage (SHCMP).\n5SHR is a common way to determine reliability of re-\nsponses to generate scores on an ordinal scale (Weir, 2005).\nRandom\nWorryWords\n#Bins\nBin size\nSHCMP\nSHCMP\nSHCloseP\n10\n0.60\n10.0\n0.62\n84.9\n7\n0.86\n14.3\n0.71\n91.6\n5\n1.20\n20.0\n0.78\n96.8\n4\n1.50\n25.0\n0.79\n98.4\n3\n2.00\n33.0\n0.87\n99.4\n2\n3.00\n50.0\n0.89\n100.0\nTable 2: Split-Half Class Match Percentage (SHCMP)\nand Split-Half Closeness Percentage (SHCloseP) ob-\ntained from the anxiety annotations when splitting the\n-3 to 3 score range into equal-sized bins (partitions) per-\ntaining to ordinal classes. SD: standard deviation.\nNote, however, that using discrete classes means\nthat many items that have similar real-valued scores\nfrom two independent sets of annotations may be\non different sides of a class boundary. Thus even if\nthe original annotations are reliable, using discrete\nclasses adds some unreliability inherently. To get a\nsense of this, we also calculate the degree to which\nthe split-half scores are close to each other (without\nregard to class boundaries): e.g., the percentage of\ntimes two independent sets of annotations for an\nitem lead to scores that are closer than a pre-chosen\nthreshold (0.1, 0.25, etc.). We will call this the\nSplit-Half Closeness Percentage (SHCloseP).\nTable 2 shows the SHCMP and SHCloseP for the\nWorryWords annotations for various levels of gran-\nularity (#classes). The second column shows the\nclass size—obtained by dividing the -3 to 3 range\nequally by #classes.6 The third column shows the\nexpected SHCMP when terms are given scores at\nrandom. The fourth column shows SHCMP when\nusing the actual WorryWords annotations. The fifth\ncolumn shows SHCloseP when using different bin\nsizes as threshold.\nObserve that the SHCMP scores are markedly\nhigher than what one would get with just random\nannotations. Further, SHCMP scores are fairly high\nin case of a small number of discrete classes (bins),\nbut drops off markedly as the number of classes is\nincreased. Note the considerably higher SHCloseP\nscores which indicate that much of the unreliability\nin discrete classes is due to items falling on either\nside of class boundaries, and that when there is a\nclass mismatch the involved classes are close to\neach other (smaller error) as opposed to distant\nclasses (bigger error).\n6SHCMP can also be determined from custom ranges that\nare not of the same size. Here we show SHCMP with equal\nsize bins for simplicity.\n5\nWorryWords: Research & Applications\nWorryWords has a wide variety of uses and appli-\ncations as listed in the Introduction. We explore:\n• Two diverse examples where lexicographic\nanalysis of the words helps answer research\nquestions about anxiety (Section 6).\n• An example (with evaluation) of how the Wor-\nryWords can be used to accurately track anxi-\nety in text streams (Section 7). This has both\ncommercial and research applications.\n6\nUsing WorryWords to Answer Research\nQuestions about Anxiety\n6.1\nFrom a lexical standpoint, how is anxiety\nrelated to other emotions?\nAn important question in understanding any emo-\ntion is how it relates to other emotions. With the\ncreation of the first large-scale lexicon of word–\nanxiety associations, we can now study how these\nnorms correlate with other key emotion constructs\nsuch as valence (V), arousal (A), and dominance\n(D), as well as categorical emotions such as sad-\nness, fear, and anger. Since anxiety is commonly\nunderstood to be a negative (low-valence emotion),\nwe expect it to have a negative correlation with\nvalence (negative situations are often associated\nwith anxiety). However, we have no prior evidence\nto indicate how strong this negative correlation is\nexpected to be; especially since, there can be many\nterm pairs w1 and w2 such that even though w1\nhas lower valence than w2, w2 is associated with\na higher degree of anxiety than w1. For example,\nhopeless and frenzy, lethargic and public speaking,\nweak and test, etc.\nSimilarly, we expect anxiety to have a positive\ncorrelation with arousal (since high anxiety terms\nare also expected to be high arousal terms), and a\nnegative correlation with dominance (since higher\nanxiety tends to co-occur with situations of loss of\ncontrol). Yet, again, it is unclear how strong these\ncorrelations truly are across a vast vocabulary of\nwords. Understanding these relationships has impli-\ncations in psycholinguistics and lexical semantics:\ne.g., whether anxiety moderates word recognition\neven when controlling for valence. Further, in the\ncontext of lexicon-creation: If the magnitudes of\nthese correlations are very high, then one can sim-\nply take an existing VAD lexicon, and keep only the\nlow valence, high arousal, and/or low dominance\nterms to create an anxiety lexicon.\nanxiety\nvalence\narousal\ndomin.\nanxiety\n1.000\n-0.471\n0.237\n-0.218\nvalence\n-0.471\n1.000\n-0.014\n0.568\narousal\n0.237\n-0.014\n1.000\n0.286\ndomin.\n-0.218\n0.568\n0.286\n1.000\nTable 3: Spearman rank correlations of association\nscores between various emotion pairs, for 44k terms.\nVAD: The first row (and also the first column) of Ta-\nble 3 shows the correlations of anxiety association\nscores of terms in WorryWords with the valence,\narousal, and dominance scores of terms in the NRC\nVAD Lexicon v2 (Mohammad, 2024a). Observe\nthat anxiety has a moderate negative correlation\nwith valence, a mild correlation with arousal, and\na mild negative correlation with dominance. For\nadditional context, the bottom 3 rows (and last 3\ncolumns) of Table 3 show the pair-wise correla-\ntions between valence, arousal, and dominance. It\nshows for example, that valence and dominance\ntend to be more correlated than any of the other\npairs (a result also seen in other VAD lexicons such\nas the Warriner Lexicon (2013)); and in terms of\nthe magnitude, the degree of (negative) correlation\nbetween valence and anxiety is lower than that of\nvalence and dominance.\nWe also created an interactive visualization that\nshows the WorryWords terms on valence–arousal\nand valence–dominance spaces (Figure 8 in the\nAppendix shows a screenshot). (Hovering over in-\ndividual points shows the corresponding term as\nwell as anxiety, V, A, and D scores.) We observe\nthat, as expected, a majority of the anxiety words\n(score > 0.5) occur in the top-left quadrant of the\nV–A space: low V and high A. Nonetheless, there\nare still non-negligible number of terms that oc-\ncur in the top-right quadrant (such as adrenalin,\nrevolutionist, and whizzing) and in the bottom-left\nquadrant (such as joylessness, disheartenment, and\ndisreputableness). Comparatively much fewer anx-\niety terms occur in the bottom right (high V and low\nA) quadrants. Examples include seatbelt and post-\noperative. In contrast, the majority of the calmness\nterms (score < −0.5) occur in the high V quad-\nrants. Examples, of low V terms associated with\ncalmness include pity and aloof. The V–D plots\nshow that anxiety terms tend to be concentrated in\nthe bottom-left quadrant, whereas calmness terms\nare most commonly found in the top-right quadrant.\nAnxiety terms associated with high D include terms\nsuch as skyrocket, canny, gunfight, and tyrant; anxi-\nety terms associated with low D include persecuted\nand gutlessness.\nCategorical Emotions: Table 4 shows the corre-\nlations of anxiety scores of terms in WorryWords\nwith the anger, anticipation, disgust, fear, joy, sad-\nness, surprise, and trust scores of terms in the\nNRC Emotion Intensity Lexicon v1 (Mohammad,\n2018b). Observe that anxiety seems to essentially\nhave no correlation with anticipation, joy, and sur-\nprise (correlation magnitudes less than 0.2); and\nlow correlation with the negative emotions: anger,\ndisgust, fear, and sadness. Among these emotions,\nanxiety has the highest correlation with fear.\nDiscussion: Overall, we see that while anxiety as-\nsociations follow some expected trends such as\npertaining to low valence, the magnitudes of cor-\nrelations are moderate with valence and low with\narousal and dominance. Thus anxiety presents it-\nself in many different ways and cannot be charac-\nterized simply with VAD. The fact that anxiety has\nthe highest correlation with fear (among the four\nnegative categorical emotions) is in line with the\nbelief that fear is a key aspect of anxiety (Rosen\nand Schulkin, 1998; Shin and Liberzon, 2010).\n6.2\nAt what rate do children acquire words\nassociated with anxiety? How does this\nchange with the Age of Acquisition?\nFeeling anxious is a normal part of childhood and\ngrowing up (Beesdo et al., 2009). The Cleveland\nClinic describes how very young children (6-month\nto 3-year olds) can have separation anxiety from\nparents and caregivers; pre-schoolers often develop\nphobias towards specific things such as insect, dark-\nness, thunder, heights, etc.; and school age brings\nmany sources of anxiety such as going to a new\nschool, exams, social interactions, and managing\nschool work.7 Over the course of development,\nthe way children express, experience, and commu-\nnicate their emotions, including anxiety, changes\n(Bailen et al., 2019; Thompson, 1991). Under-\nstanding these changes is instrumental in promot-\ning healthy socio-emotional functioning across all\nstages of development. Thus, the associations of\nemotions with different ages is a key aspect studied\nby researchers in child development.\nWith WorryWords we can now look specifi-\ncally at the relationship between anxiety-associated\nwords and age. Specifically, in our work, we ex-\namine the correlation between the age at which\nwords are acquired by children in their vocabulary\n7https://my.clevelandclinic.org/health/diseases/anxiety-\nin-children\nanxiety\nanger\nanticipn.\ndisgust\nfear\njoy\nsadness\nsurprise\ntrust\nanxiety\n1.000\n0.336\n-0.011\n0.279\n0.357\n-0.132\n0.272\n0.082\n-0.137\nTable 4: Spearman rank correlation between the word–emotion association scores for anxiety and 8 other emotions.\nFigure 2: Percent of WorryWords terms by AoA.\n(the age they learn the meanings of words) and the\nanxiety associated with those words.\nWe do so by examining the words with entries\nin both WorryWords and Kuperman et al. (2012)\nage of acquisition dataset (which includes the age\nat which ∼30K English words are commonly ac-\nquired by children). Figure 2 shows the percentage\nof words in WorryWords that are acquired at var-\nious ages. Subsets of words corresponding to the\nthree anxiety classes are shown in shades of orange,\ncorresponding to the three calmness classes are\nshown in shades of green, and the amount of words\nneither associated with anxiousness nor calmness\nare shown in grey.\nObserve that the percentage of words acquired\nincreases steadily with age, peaking at 11, and then\ndecreasing rapidly after that. The percentage of\nanxiety and calmness words also largely follows\nthe same pattern, but some notable additional ob-\nservations can be made. At a very early age (1 to 4\nyears) the percentage of calmness words acquired is\nhigher than the percentage of anxiety words. How-\never, from age 5 onwards, children learn more anx-\niety words than calmness words.\nFigure 3 shows the percentage of words acquired\neach year for each of the anxiety and calmness\nclasses; i.e., after disregarding the neither anxious\nnor calm words, what percentage of words acquired\nin a year correspond to each of the six other classes.\n(For every x-axis value, the six percentages sum\nup to 100%.) Observe that from age 3 onwards,\nthe percentage of anxiety words increases steadily\nwith age (for all three anxiety classes), whereas,\nthe percentage of calmness words decreases with\nage (for all three calmness classes).\nFigure 3: For all of the non-neutral WorryWords terms\nacquired at age x: the percentage corresponding to each\nof the non-neutral anxiety–calmness bins. (The six per-\ncentages for each age sum up to 100%.)\nDiscussion: The notable trends in the relative rates\nof acquisition of anxiety and calmness terms with\nage have implications in developmental psychology\nand evolutionary linguistics (Price, 2013; Breggin,\n2015). They may also be relevant in the under-\nstanding of and coping with childhood anxieties\n(Wright et al., 2010; Legerstee et al., 2010). We\nhope that WorryWords will spur further research in\nthese areas.\n7\nCapturing Anxiety Arcs in Text\nStreams using WorryWords\nA common use of emotion lexicons is to determine\nemotion arcs and trends in how emotions change in\na stream of textual data. For example, determining\nchanges in the degree of anger towards a product\nin social media over time (Breeze, 2020), tracking\nhappiness and well-being of different cities and\ncounties through geo-located posts on X (formerly\nTwitter) in public health research (Frank et al.,\n2013), generating emotion arcs of stories in dig-\nital humanities (Mohammad, 2011; Ohman et al.,\n2024), etc. The lexicons may be used in combina-\ntion with supervised systems and large language\nmodels (where such resources are available), or\nthey may be used on their own where interpretabil-\nity, low-carbon foot print, and simpler systems are\nvalued — which is often the case in psychology and\npublic health research. Lexicon-only methods are\noften markedly less accurate at determining emo-\ntions of individual sentences. However, Teodor-\nescu and Mohammad (2023) have shown that on\nthe task of generating emotion arcs (where emotion\nscores of hundreds, if not thousands, of individual\nsentences are averaged to determine points on the\nemotion arc) lexicon-only methods are competitive\nwith more sophisticated neural and large language\nmodels.8 In this section we explore:\n1. How accurate are anxiety arcs generated using\nWorryWords alone?\n2. Given the close relationship between anxi-\nety and other emotion categories such as fear,\nanger, and low valence, how good are lexicons\nfor other emotions at capturing anxiety arcs?\nTogether these results tell us about the usefulness\nof WorryWords in the task of generating emotion\narcs, as well as how anxiety-associated and other-\nemotion-associated words present themselves in\nsentences that have been marked for anxiety.\n7.1\nCreating the Anxiety Arcs\nFirst we quickly summarize how emotion arcs are\ncreated. The user (anyone interested in tracking\nanxiety for a text stream of interest) provides the:\n• Text Stream: A series of instances (sentences,\nposts, etc.) in order of interest (e.g., posts on\nX that mention #climatechange ordered by\ntimestamps, sentences from a novel).\n• Bins: A pre-chosen grouping (day, month,\nyear, k sentences, etc. — based on granularity\nof interest)9. An additional parameter relevant\nwhen the bin is specified in terms of number\nof sentences (say, k) is the step size. For\nexample, a step size of s instances means that\nafter including sentences 1 to k in the first\nbin, the next bin includes instances 1 + s to\n1 + s + k, then 1 + 2s to 1 + 2s + k, and so\non. Commonly used step sizes are 1 (highly\noverlapping bins – leading to smoother arcs)\nand k (non-overlapping bins).\n8Even though an individual lexicon entry only provides the\nemotion association with the predominant sense (and does not\ntake context into account), by tracking the emotions associated\nwith hundreds of co-occurring words in a text stream we make\nuse of context. If for example, an anger-inducing event occurs,\nthen the corresponding bin is likely include many words that\nwill have an association with anger.\n9For e.g., anxiety in tweets about climate change where\none wants to track changes month by month, each bin includes\nthe tweets posted in the corresponding month.\nWe generate the predicted arc for this text stream\nby simply taking the average anxiety association\nscores of words (taken from WorryWords) for each\nbin. Terms not found in the lexicon are disregarded\nwhen determining these scores. The gold arc can\nbe created by taking the averages of the manually\nlabeled anxiety scores (labels) of each of the posts\nin the bins. The closer the predicted arc to the gold\narc, the more accurate it is.\nHowever, there exists no cohesive text streams\ndataset with annotations for anxiety. That said,\nthere exist datasets where independent sentences\nare annotated for anxiety, such as the stress dataset\nby Rastogi et al. (2022). Since this dataset is not as-\nsociated with a particular event where there might\nbe ups and downs of emotions, a completely ran-\ndom ordering of the data or using timestamps to\norder the data into a text stream, produces of a\nflat line anxiety arc. Thus, we created new text\nstreams by sampling posts from the Rastogi et al.\n(2022) dataset (5,488 Reddit posts), with replace-\nment, such that the gold anxiety arc had portions\nwith various random amplitudes and slopes (spik-\niness).10 (Note that sampling is a way to create\na new ordering of the posts.) We continued sam-\npling until we created text streams that were 10,000\nsentences long. We then repeated the procedure\n1000 times to create 1000 different text streams\n(and corresponding gold arcs). These text streams\ncan now be used to evaluate automatic methods of\ndetermining anxiety arcs. The yellow line in Figure\n4 (a) shows the beginning portion of one of the gold\nanxiety arcs (the 1000th arc) for bin size of 50.\n7.2\nResults\nThe green line in Figure 4 (a) shows the beginning\nportion of the predicted anxiety arc when using\nthe lexicon-only method, word associations from\nWorryWords, and a rolling window with bin size\n50.11 Observe that the green line traces the gold\nline quite closely. There are also occasions where\nit overshoots or fails to reach the gold arc. The\ncolumn on the right in the figure lists the average\nSpearman correlation between the predicted and\n10Sampling without replacement led to the same results, but\nsampling with replacement allowed reuse of the limited la-\nbeled data to produce longer waves. The random arc sampling\nalgorithm is described in the Appendix.\n11Note that bin size is a user specified parameter. Bin size\nof 50 posts is relatively small and often only used when data\nis sparse, e.g., tracking character arcs in novels. Results with\nbigger bin sizes are often better (as more data is used to infer\nchange of emotion across bins) – as shown ahead.\nFigure 4: Predicted (green) anxiety arcs when applying four different types of association scores to one of the test\ndata text streams: a. anxiety association from WorryWords, b. valence (from NRC VAD), c. arousal (from NRC\nVAD), and dominance (from NRC VAD). The gold (yellow) arc pertaining to the same text stream is repeated in all\nfour figures for reference. Bin size used to create the arcs: 50 posts. On the right is the average correlation between\n1000 pairs of gold and predicted arcs for each case.\nWindow Size\nSpearman\nRMSE\n1\n0.554\n1.011\n10\n0.767\n0.517\n50\n0.903\n0.204\n100\n0.932\n0.136\n200\n0.946\n0.099\n500\n0.955\n0.075\n1000\n0.955\n0.073\nTable 5: Avg. Spearman corrn. and RMSE of 1K pairs\nof predicted and gold anxiety arcs for different bin sizes.\ngold arcs for all 1000 text streams (for the full\nlength of the text streams: 10,000 posts) . We note\nthat the arc generated using the anxiety lexicon has\na high correlation with the gold arc (greater than\n0.9) – sufficient for most applications.\nFigure 4 (b), (c), and (d) show the same gold\nanxiety arc but show predicted arcs using valence,\narousal, and dominance scores, respectively (taken\nfrom the NRC VAD Lexicon). These figures act as\ncontrol arcs (for comparison with the WorryWords\narc). The column on the right shows the average\ncorrelations for the 1000 pairs of gold and predicted\narcs. We see that the gold arc is highly negatively\ncorrelated with valence (-0.85). Just in terms of\nthe magnitude of correlation, arousal is closer to\nanxiety than dominance with anxiety.\nCategorical Emotions: Figure 9 in the Appendix\nshows similar gold and predicted arcs (and overall\naverage correlations) for the gold anxiety arc and\npredicted arcs generated using lexicons for eight\nother categorical emotions. The magnitudes of cor-\nrelation obtained using lexicons for these emotions\nis lower than that obtained using WorryWords.\nWindow Size Effect: We repeated the experi-\nments described above with many window sizes\nand found similar overall trends. However, using\nlarger window sizes generally led to higher corre-\nlations. Table 5 shows these results. In addition to\nSpearman rank correlation the table also shows an-\nother metric of arc–arc closeness: root mean square\nerror (RMSE). The closer the two arcs, the smaller\nthe RMSE. Observe that there is a plateauing effect\nin closeness after a window size of a few hundred\nposts (around ρ = 0.955 and RMSE = 0.075).\n8\nConclusion\nWe created WorryWords — a large lexicon of\nword–anxiety association scores with the help of\nresponses to a simple questionnaire, by over 1000\nrespondents (mainly from the US, but also from\nIndia, UK, and Canada). We showed that the re-\nsponses led to highly reliable scores. We compared\nhow anxiety association scores correlate with the\nscores for various other emotions. We determined\nthe rate at which anxiety words are acquired with\nage; specifically, how from ages 1 to 4 children\nlearn more calmness words than anxiety words,\nand that trend is reversed age 5 onwards. Finally,\nwe showed how WorryWords can be used to track\nanxiety in large text streams. We make Worry-\nWords freely available to enable a wide variety of\nanxiety associated research.\n9\nLimitations\nFor limitations associated with the dataset, please\nrefer to the Ethics Statement (§10).\nThe lexicographic experiments in Section 6\nmake use of existing emotion and Age of Acquisi-\ntion datasets. The labels for these datasets reflect\ntheir annotators, who were mainly US and Euro-\npean English speakers. Thus further experiments\nwith datasets pertaining to other locations and de-\nmographics are needed to determine how widely\napplicable or universal some of these conclusions\nare. The conclusions form our work should largely\nbe seen as applicable to the demographics of its\nannotators (and not beyond).\nThe emotion arc experiments were done on\nan existing stress-labeled dataset of Reddit posts.\nHowever, the datasets does not correspond to a\nnatural textstream such as tweets about a new gov-\nernment policy or utterances of a character in a\nnovel. (No such dataset has human annotations\nfor anxiety.) However, by creating text streams\ncorresponding to a thousand different emotion arcs\nfrom an existing Reddit dataset, we created a robust\nanxiety arc gold dataset.\n10\nEthics Statement\nEmotions are complex and nuanced mental states.\nAdditionally, each individual expresses emotions,\nincluding anxiety, differently through language,\nwhich results in large amounts of variation. See\nMohammad (2023) for a discussion of good prac-\ntises and ethical considerations when using emo-\ntion lexicons. See Mohammad (2022) for a broader\ndiscussion of ethical considerations relevant to au-\ntomatic emotion recognition. We discuss below\nnotable ethical considerations when computation-\nally analyzing anxiety.\nImportantly, WorryWords should not be used\nas a standalone tool for detecting anxiety disor-\nders. We hope future research, led by clinicians\nand medical practitioners, will assess the useful-\nness of WorryWords in mental health applications,\nin combination with various other sources of infor-\nmation.\nThe crowd-sourced task was approved by our\nInstitutional Research Ethics Board. Our annota-\ntion process stored no information about annotator\nidentity and as such there is no privacy risk to them.\nThe individual words selected did not pose any\nrisks beyond occasionally reading text on the in-\nternet. The annotators were free to do as many\nword annotations as they wished. The instructions\nincluded a brief description of the purpose of the\ntask (Figure 5).\nAny lexical dataset of emotion-association\nnorms entails several ethical considerations.\n• Coverage: We sampled a large number of En-\nglish words from many sources (which them-\nselves sample from many sources). Yet, it\nis possible that the words included do not\ncover all domains, genres, and people of dif-\nferent locations, socio-economic strata, etc.\nequally. It likely includes more of the vo-\ncabulary common in the United States with a\nsocio-economic and educational backgrounds\nthat allow for technology access.\n• Word Senses and Dominant Sense Priors:\nWords when used in different senses and con-\ntexts may be associated with different degrees\nof anxiety. The entries in WorryWords are\nindicative of the anxiety associated with the\npredominant senses of the words. This is usu-\nally not too problematic because most words\nhave a highly dominant main sense (which\noccurs much more frequently than the other\nsenses). In specialized domains, some terms\nmight have a different dominant sense than\nin general usage. Entries in the lexicon for\nsuch terms should be appropriately updated or\nremoved.\n• Not Immutable: The anxiety scores do not\nindicate an inherent unchangeable attribute.\nThe associations can change with time (e.g.,\nthe increase in anxiety associated with cough-\ning during a world-wide pandemic), but the\ndataset entries are largely fixed. They pertain\nto the time they are created.\n• Socio-Cultural Biases: The annotations for\nanxiety capture various human biases. These\nbiases may be systematically different for dif-\nferent socio-cultural groups. Our data was\nannotated by mostly US and Indian English\nspeakers, but even within the US and India\nthere are many diverse socio-cultural groups.\nNotably, crowd annotators on Amazon Me-\nchanical Turk do not reflect populations at\nlarge. In the US for example, they tend to\nskew towards male, white, and younger peo-\nple. However, compared to studies that in-\nvolve just a handful of annotators, crowd anno-\ntations benefit from drawing on hundreds and\nthousands of annotators (such as this work).\n• Inappropriate Biases: Our biases impact how\nwe view the world, and some of the biases\nof an individual may be inappropriate. For\nexample, one may have race or gender-related\nbiases that may percolate subtly into one’s no-\ntions of anxiety associated with words. Our\ndataset curation was careful to avoid words\nfrom problematic sources. We also ask people\nannotate terms based on what most English\nspeakers think (as opposed to what they them-\nselves think). This helps to some extent, but\nit can still capture historical anxiety associa-\ntions with certain identity groups. This can\nbe useful for some socio-cultural studies; but\nwe also caution that anxiety association with\nidentity groups be carefully contextualized to\navoid false conclusions.\n• Perceptions (not “right” or “correct” labels):\nOur goal here was to identify common per-\nceptions of anxiety association. These are not\nmeant to be “correct” or “right” answers, but\nrather what the majority of the annotators be-\nlieve based on their intuitions of the English\nlanguage.\n• It is more appropriate to make claims about\nanxiety word usage rather than anxiety of the\nspeakers. For example, ‘the use of anxiety\nwords grew by 20%’ rather than ‘anxiety grew\nby 20%’. A marked increase in anxiety words\nis likely an indication that anxiety increased,\nbut there is no evidence that anxiety increased\nby 20%.\n• Comparative analyses can be much more\nuseful than stand-alone analyses.\nOften,\nanxiety word counts on their own are not\nuseful. For example, ‘the use of anxiety words\ngrew by 20% when compared to [data from\nlast year, data from a different person, etc.]’\nis more useful than saying ‘on average, 5\nanxiety words were used in every 100 words’.\n• Inferences drawn from larger amounts of text\nare often more reliable than those drawn from\nsmall amounts of text. For example, ‘the use\nof anxiety words grew by 20%’ is informative\nwhen determined from hundreds, thousands,\ntens of thousands, or more instances. Do not\ndraw inferences about a single sentence or\nutterance from the anxiety associations of its\nconstituent words.\nWe recommend careful reflection of ethical consid-\nerations relevant for the specific context of deploy-\nment when using WorryWords.\nAcknowledgments\nMany thanks to Sophie Wu and Tara Small for\nhelpful discussions.\nReferences\nLisa Feldman Barrett. 2017. The theory of constructed\nemotion: an active inference account of interoception\nand categorization. Social cognitive and affective\nneuroscience, 12(1):1–23.\nMelissa Bateson, Ben Brilot, and Daniel Nettle. 2011.\nAnxiety: an evolutionary approach. The Canadian\nJournal of Psychiatry, 56(12):707–715.\nKatja Beesdo, Susanne Knappe, and Daniel S Pine.\n2009. Anxiety and anxiety disorders in children and\nadolescents: developmental issues and implications\nfor dsm-v. Psychiatric Clinics, 32(3):483–524.\nCR Blease. 2015. Too many ‘friends,’too few ‘likes’?\nevolutionary psychology and ‘facebook depression’.\nReview of General Psychology, 19(1):1–13.\nRuth Breeze. 2020. Angry tweets: A corpus-assisted\nstudy of anger in populist political discourse. Journal\nof Language Aggression and Conflict, 8(1):118–145.\nPeter R Breggin. 2015. The biological evolution of guilt,\nshame and anxiety: A new theory of negative legacy\nemotions. Medical hypotheses, 85(1):17–24.\nMarc Brysbaert, Paweł Mandera, Samantha F Mc-\nCormick, and Emmanuel Keuleers. 2019.\nWord\nprevalence norms for 62,000 english lemmas. Be-\nhavior research methods, 51:467–479.\nSusan Clayton. 2020. Climate anxiety: Psychologi-\ncal responses to climate change. Journal of anxiety\ndisorders, 74:102263.\nPaul Ekman. 1992. An argument for basic emotions.\nCognition and Emotion, 6(3):169–200.\nMorgan R Frank, Lewis Mitchell, Peter Sheridan Dodds,\nand Christopher M Danforth. 2013. Happiness and\nthe patterns of life: A study of geolocated tweets.\nScientific reports, 3(1):2625.\nNed H Kalin. 2020. The critical relationship between\nanxiety and depression.\nJean Kim and Jack Gorman. 2005. The psychobiology\nof anxiety.\nClinical Neuroscience Research, 4(5-\n6):335–347.\nVictor Kuperman, Hans Stadthagen-Gonzalez, and\nMarc Brysbaert. 2012. Age-of-acquisition ratings\nfor 30,000 english words. Behavior research meth-\nods, 44:978–990.\nJeroen S Legerstee, Nadia Garnefski, Francine C\nJellesma, Frank C Verhulst, and Elisabeth MWJ\nUtens. 2010. Cognitive coping and childhood anxiety\ndisorders. European child & adolescent psychiatry,\n19:143–150.\nSandra Mitrovi´c, Oscar William Lithgow-Serrano, and\nCarlo Schillaci. 2024. Comparing panic and anx-\niety on a dataset collected from social media. In\nProceedings of the 9th Workshop on Computational\nLinguistics and Clinical Psychology (CLPsych 2024),\npages 153–165, St. Julians, Malta. Association for\nComputational Linguistics.\nSaif Mohammad. 2011.\nFrom once upon a time to\nhappily ever after: Tracking emotions in novels and\nfairy tales. In Proceedings of the 5th ACL-HLT Work-\nshop on Language Technology for Cultural Heritage,\nSocial Sciences, and Humanities, pages 105–114,\nPortland, OR, USA. Association for Computational\nLinguistics.\nSaif Mohammad. 2018a. Obtaining reliable human rat-\nings of valence, arousal, and dominance for 20,000\nEnglish words. In Proceedings of the 56th Annual\nMeeting of the Association for Computational Lin-\nguistics (Volume 1: Long Papers), pages 174–184,\nMelbourne, Australia. Association for Computational\nLinguistics.\nSaif M. Mohammad. 2018b. Word affect intensities.\nIn Proceedings of the 11th Edition of the Language\nResources and Evaluation Conference (LREC-2018),\nMiyazaki, Japan.\nSaif M. Mohammad. 2022. Ethics sheet for automatic\nemotion recognition and sentiment analysis. Compu-\ntational Linguistics, 48(2):239–278.\nSaif M. Mohammad. 2023. Best practices in the cre-\nation and use of emotion lexicons. In Proceedings\nof the 17th Conference of the European Chapter\nof the Association for Computational Linguistics,\nDubrovnik, Croatia. Association for Computational\nLinguistics.\nSaif M. Mohammad. 2024a. NRC VAD Lexicon v2:\nNorms for valence, arousal, and dominance for over\n55k English terms. In ArXiv.\nSaif M. Mohammad. 2024b. Worrywords: A massive\nlexicon of anxiety associations for English words and\nphrases. In ArXiv.\nSaif M. Mohammad and Svetlana Kiritchenko. 2015.\nUsing hashtags to capture fine emotion categories\nfrom tweets. Computational Intelligence, 31(2):301–\n326.\nSaif M. Mohammad and Peter D. Turney. 2010. Emo-\ntions evoked by common words and phrases: Using\nMechanical Turk to create an emotion lexicon. In\nProceedings of the NAACL-HLT Workshop on Com-\nputational Approaches to Analysis and Generation\nof Emotion in Text, LA, California.\nSaif M. Mohammad and Peter D. Turney. 2013. Crowd-\nsourcing a word–emotion association lexicon. Com-\nputational Intelligence, 29(3):436–465.\nAgnes Moors,\nJan De Houwer,\nDirk Hermans,\nSabine Wanmaker, Kevin Van Schie, Anne-Laura\nVan Harmelen,\nMaarten De Schryver,\nJeffrey\nDe Winne, and Marc Brysbaert. 2013. Norms of\nvalence, arousal, dominance, and age of acquisition\nfor 4,300 dutch words. Behavior research methods,\n45(1):169–177.\nEmily Ohman, Yuri Bizzoni, Pascale Feldkamp Moreira,\nand Kristoffer Nielbo. 2024. EmotionArcs: Emotion\narcs for 9,000 literary texts. In Proceedings of the\n8th Joint SIGHUM Workshop on Computational Lin-\nguistics for Cultural Heritage, Social Sciences, Hu-\nmanities and Literature (LaTeCH-CLfL 2024), pages\n51–66, St. Julians, Malta. Association for Computa-\ntional Linguistics.\nC.E. Osgood, Suci G., and P. Tannenbaum. 1957. The\nmeasurement of meaning.\nUniversity of Illinois\nPress.\nJane Parish. 2000. The age of anxiety. The Sociological\nReview, 48(2_suppl):1–16.\nRobert Plutchik. 1980. A general psychoevolutionary\ntheory of emotion. Emotion: Theory, research, and\nexperience, 1(3):3–33.\nJohn Scott Price. 2013. An evolutionary perspective\non anxiety and anxiety disorders. New insights into\nanxiety disorders, 3:20.\nEmily Qureshi-Hurst. 2022. Anxiety, alienation, and es-\ntrangement in the context of social media. Religious\nStudies, 58(3):522–533.\nAryan Rastogi, Liu Qian, and Erik Cambria. 2022.\nStress detection from social media articles: New\ndataset benchmark and analytical study. In 2022\nIEEE World Conference of Computational Intelli-\ngence (WCCI).\nJeffrey B Rosen and Jay Schulkin. 1998. From normal\nfear to pathological anxiety. Psychological review,\n105(2):325.\nJames A Russell. 1980. A circumplex model of af-\nfect. Journal of personality and social psychology,\n39(6):1161.\nRenata Salecl. 2004. On anxiety. Routledge.\nJudy Hanwen Shen and Frank Rudzicz. 2017. Detecting\nanxiety through Reddit. In Proceedings of the Fourth\nWorkshop on Computational Linguistics and Clinical\nPsychology — From Linguistic Signal to Clinical\nReality, pages 58–65, Vancouver, BC. Association\nfor Computational Linguistics.\nLisa M Shin and Israel Liberzon. 2010. The neurocir-\ncuitry of fear, stress, and anxiety disorders. Neu-\nropsychopharmacology, 35(1):169–191.\nAndy P Siddaway, Peter J Taylor, and Alex M Wood.\n2018. Reconceptualizing anxiety as a continuum that\nranges from high calmness to high anxiety: The joint\nimportance of reducing distress and increasing well-\nbeing. Journal of personality and social psychology,\n114(2):e1.\nElizabeth C Stade, Lyle Ungar, Johannes C Eichstaedt,\nGarrick Sherman, and Ayelet Meron Ruscio. 2023.\nDepression and anxiety have distinct and overlapping\nlanguage patterns: Results from a clinical interview.\nJournal of psychopathology and clinical science.\nDaniela Teodorescu and Saif Mohammad. 2023. Eval-\nuating emotion arcs across languages: Bridging the\nglobal divide in sentiment analysis. In Findings of the\nAssociation for Computational Linguistics: EMNLP\n2023, pages 4124–4137, Singapore. Association for\nComputational Linguistics.\nElsbeth Turcan and Kathy McKeown. 2019. Dread-\ndit: A Reddit dataset for stress analysis in social\nmedia. In Proceedings of the Tenth International\nWorkshop on Health Text Mining and Information\nAnalysis (LOUHI 2019), pages 97–107, Hong Kong.\nAssociation for Computational Linguistics.\nMelissa LH Võ, Markus Conrad, Lars Kuchinke,\nKarolina Urton, Markus J Hofmann, and Arthur M\nJacobs. 2009. The berlin affective word list reloaded\n(bawl-r). Behavior research methods, 41(2):534–\n538.\nAmy Beth Warriner, Victor Kuperman, and Marc Brys-\nbaert. 2013. Norms of valence, arousal, and dom-\ninance for 13,915 English lemmas. Behavior Re-\nsearch Methods, 45(4):1191–1207.\nJoseph P Weir. 2005. Quantifying test-retest reliabil-\nity using the intraclass correlation coefficient and\nthe sem. The Journal of Strength & Conditioning\nResearch, 19(1):231–240.\nGenta Indra Winata, Onno Pepijn Kampman, and Pas-\ncale Fung. 2018. Attention-based lstm for psycho-\nlogical stress detection from spoken language using\ndistant supervision. In 2018 IEEE International Con-\nference on Acoustics, Speech and Signal Processing\n(ICASSP), pages 6204–6208. IEEE.\nMark Wright, Robin Banerjee, Willemijn Hoek, Car-\nolien Rieffe, and Sheida Novin. 2010. Depression\nand social anxiety in children: Differential links with\ncoping strategies. Journal of abnormal child psychol-\nogy, 38:405–419.\nMoshe Zeidner and Gerald Matthews. 2010. Anxiety\n101. Springer Publishing Company.\nA\nAPPENDIX\nA.1\nSources of Terms Selected for Annotation\nWorryWords includes terms selected from these\nresources:\n• All terms in the NRC Emotion Lexicon v1\n(Mohammad and Turney, 2013, 2010): It in-\ncludes about 14,000 common English words\nwith labels indicating whether they are asso-\nciated with any of the eight notable discrete\nemotions identified by Plutchik (1980): anger,\nanticipation, disgust, fear, joy, sadness, sur-\nprise, and trust.\n• All terms in the NRC VAD Lexicon v1 (Mo-\nhammad, 2018a): It includes about 20,000\ncommon English terms. Notably, it also in-\ncludes terms common in X (formerly Twitter).\nPosts on X include non-standard language\nsuch as creatively spelled words (happee),\nhashtags (#takingastand, #lonely) and con-\njoined words (loveumom). These were taken\nfrom the Twitter Emotion Corpus (Moham-\nmad and Kiritchenko, 2015).\n• Terms in the Prevalence dataset (Brysbaert\net al., 2019) that are marked as known to 70%\nor more respondents: This dataset has preva-\nlence scores (how widely a word is known by\nEnglish speakers), determined directly by ask-\ning people, for 62,000 lemmas. We included a\nterm if it was marked as known to at least 70%\nof the people who provided responses for the\nterm. From this set we removed terms that are\ncommon person names or city names.\nA.2\nAMT Questionnaire\nScreenshots of the detailed instructions, examples,\nand sample question presented to the annotators\nare shown in Figures 5, 6, and 7, respectively.\nA.3\nDistribution of WorryWords\nWorryWords is made freely available on the project\nwebsite as a compressed file. Terms of use will\nrequire that users not re-distribute the file and not\npost any form of the lexicon on the web. This is\nto prevent the resource being included in the data\nscrape fed to a large language model. See full list\nof terms of use at the project home page. Table 6\nshows entries for a random sample of words from\nWorryWords.\nWord\nAnxiety Score\nsuffocative\n3\nsmolder\n3\nexploder\n3\nexterminate\n2.71\nghastly\n2.66\nhaunted\n2.62\ncastrate\n2.62\nabusive\n2.5\nmanic\n2.4\nknifelike\n2.4\ncoercion\n2.33\nconniving\n2.16\naffliction\n2.14\nfrustrate\n2.05\nunforeseeable\n2\ngrueling\n2\nsnarling\n1.88\nobtrusion\n1.88\nhysterectomy\n1.87\nscum\n1.85\nreinjure\n1.83\nriskily\n1.72\ndownheartedly\n1.71\njailhouse\n1.71\nfrostbitten\n1.66\nstifled\n1.62\ndisturbed\n1.57\nprojectile\n1.55\ndisquieted\n1.55\ncentaur\n1.33\nbrusquely\n1.25\npsychosomatic\n1.12\nescapist\n1\ndiscordance\n0.8\npropagandize\n0.75\nbrandy\n0.14\nceramics\n0.12\nphotosphere\n0\nrhinoceros\n0\nparaphrase\n0\nforkless\n0\nwitting\n0\ngemini\n-0.1\nswordswoman\n-0.13\ncanto\n-0.41\nroller\n-0.5\nmotorcycle\n-0.71\nsemiprofessional\n-0.8\nsocialization\n-0.8\ncleanness\n-1.55\ncoldblooded\n-1.57\nfantail\n-1.6\nconformed\n-1.71\nunscratched\n-1.75\njournalistic\n-1.8\nfireless\n-1.85\nreaffirmation\n-2\naristocratic\n-2.1\nlimberness\n-2.5\nunblemished\n-2.62\nlullaby\n-2.79\ndelightfully\n-3\ngenerous\n-3\nTable 6: Randomly sampled terms and their anxiety-\nassociation score from WorryWords.\nFigure 5: Questionnaire: Detailed instructions.\nSummary Instructions \nonsider anxiety to be a broad category that includes: \nExamples \nSummary \nDetailed Instructions \njittery, antsy, insecure, nervous, unease, tense, worried, unnerving, nerve-racking, apprehensive, fretful, self-doubting, troubled, discontented, \nGood examples \nBad examples \nonsider calmness to be a broad category that includes: \ncalm, relaxed, comforted, serene, at ease, self-assured, carefree, composed, collected, untroubled, peaceful, contented, nonchalant, unconcern\nVery anxious: \nuninvolved \njittery, flooding, heart attack, ship sinking, etc. \n you do not know the meaning of a word or are unsure, you can look it up in a dictionary (e.g., the Merriam Webster ) or on the internet. \nModerately anxious: \nuality Control \nargument, sibling rivalry, elevated pulse, commotion, first day, confront, etc. \nSome questions have pre-determined correct answers. If you mark these questions incorrectly, we will give you immediate feedback in a pop-up box\nSlightly anxious: \nowever, if the rate of misanswering is high (e.g., >20%), then all of one's HITs may be rejected \nMarking a word to belong to a categ\nunclear, doubt, meeting, secluded, tricky, etc. \nthat most people would not agree \nwith will be considered a misanswer.\nNot associated with anxiousness or calmness: \nAn occasional misanswer is okay. \nfurniture, envelope, utencil, fyi, garage, profession, very, same, percent, etc. \nect the options that ** most English speakers ** will agree with. \nHowever, if the rate of misanswering \nSlightly calm: \n disease is often associated with feeling: \n(e.g., >20%), then all of one's HITs m\nrejected. \ngreenery, done, okay, good to know, in control, etc. \n3: very anxious \nModerately calm: \n2: moderately anxious \n1: slightly anxious \nstroll, soothed, fishing, fixed, smooth sailing, assured, confidently, etc. \n0: not associated with feeling anxious or calm \nVery calm: \n-1: slightly calm \n-2: moderately calm \nheaven, serence, meditate, sleep, massage, etc. \n-3: very calm \nedback (optional): \n hipster is often associated with feeling: \nFigure 6: Questionnaire: Examples.\nView instructions \nSummary Instructions \nConsider anxiety to be a broad category that includes: \njittery, antsy, insecure, nervous, unease, tense, worried, unnerving, \nnerve-racking, apprehensive, fretful, self-doubting, troubled, \ndiscontented, concerned, and keyed up \nConsider calmness to be a broad category that includes: \ncalm, relaxed, comforted, serene, at ease, self-assured, carefree, \ncomposed, collected, untroubled, peaceful, contented, \nnonchalant, unconcerned, indifferent, uninterested, and uninvolved \nIf you do not know the meaning of a word or are unsure, you can look it \nup in a dictionary (e.g., the Merriam Webster ) or on the internet. \nQuality Control \nSome questions have pre-determined correct answers. If you mark \nthese questions incorrectly, we will give you immediate feedback in a \npop-up box. An occasional misanswer is okay. However, if the rate of \nmisanswering is high (e.g., >20%), then all of one's HITs may be rejected \nSelect the options that ** most English speakers ** will agree with. \nQ1. disease is often associated with feeling: \n3: very anxious \n2: moderately anxious \n1: slightly anxious \n0: not associated with feeling anxious or calm \n-1: slightly calm \n-2: moderately calm \n-3: very calm \nFigure 7: Questionnaire: Sample Question.\nFigure 8: WorryWords terms in the Valence–Arousal (a and b) and Valence–Dominance (c and d) spaces.\nA.4\nRandom Arc Sampling Algorithm\nIn order to create a text stream (described in Section\n6) such that the gold arc has various components\nof random ups and downs of varying slopes, we\nsample posts from a dataset of anxiety (1) and no-\nanxiety (0) posts, with replacement, in short bursts\nas follows. For each burst (sub-arc), we first ran-\ndomly determine a slope and number of posts to\nmake up the sub-arc. Then we sample posts from\nthe source datasets accordingly. For example, sam-\npling only anxiety posts will lead to a slope of 90\ndegrees, sampling only no-anxiety posts will lead\nto a slope of -90 degrees, and sampling a mixture\nwill lead to a slope between -90 and +90 (depend-\ning on the proportion of anxiety and no-anxiety\nposts). We continue sampling until the randomly\nchosen length of the subarc is reached. Then the\nwhole procedure is repeated with new randomly\ngenerated slopes and lengths of subarcs until the\ntext stream includes 10,000 posts.\nA.5\nSupplementary Figures and Tables\nFigure 8 shows plots of the WorryWords terms\non valence–arousal and valence–dominance spaces\n(described in Section 6.1). Table 7 shows the Spear-\nman rank correlation between the word–emotion\nassociation scores for various emotion pairs (dis-\ncussed in Section 6.1).\nFigure 9 shows predicted (green) anxiety arcs\nwhen applying nine different emotion association\nscores to one of the test data text streams (described\nin Section 7).\nA.6\nComputational Resources and Carbon\nFootprint\nA nice advantage of using simple lexicon-based\napproaches is the low carbon footprint and compu-\ntational resources required. All of the experiments\ndescribed in the paper were conducted on a regular\npersonal laptop.\nFigure 9: Predicted (green) anxiety arcs when applying nine different types of association scores to one of the\ntest data text streams: 1. associations with anxiety (from WorryWords); 2–9. associations with each of the eight\nPlutchik emotions (from NRC Emotion Intensity Lexicon). The gold (yellow) arc pertaining to the same text stream\nis repeated in all nine figures for reference. Bin size used to create the arcs: 50 posts. On the right is the average\ncorrelation between 1000 pairs of gold and predicted arcs for each case.\nanxiety\nanger\nanticipn.\ndisgust\nfear\njoy\nsadness\nsurprise\ntrust\nanxiety\n1.000\n0.336\n-0.011\n0.279\n0.357\n-0.132\n0.272\n0.082\n-0.137\nanger\n0.336\n1.000\n0.025\n0.432\n0.461\n-0.023\n0.372\n0.117\n-0.048\nanticipn.\n-0.011\n0.025\n1.000\n-0.014\n0.074\n0.432\n0.020\n0.276\n0.252\ndisgust\n0.279\n0.432\n-0.014\n1.000\n0.328\n-0.036\n0.323\n0.059\n-0.054\nfear\n0.357\n0.461\n0.074\n0.328\n1.000\n-0.017\n0.439\n0.167\n-0.035\njoy\n-0.132\n-0.023\n0.432\n-0.036\n-0.017\n1.000\n-0.014\n0.283\n0.386\nsadness\n0.272\n0.372\n0.020\n0.323\n0.439\n-0.014\n1.000\n0.088\n-0.047\nsurprise\n0.082\n0.117\n0.276\n0.059\n0.167\n0.283\n0.088\n1.000\n0.106\ntrust\n-0.137\n-0.048\n0.252\n-0.054\n-0.035\n0.386\n-0.047\n0.106\n1.000\nTable 7: Spearman rank correlation between the word–emotion association scores for various emotion pairs. For\na given anxiety–emotion pair, the correlation is computed for terms that are included in corresponding emotion\nlexicons.\n"
    },
    {
        "Published": "2020-02-21",
        "Title": "A Study on Anxiety about Using Robo-taxis: HMI Design for Anxiety Factor Analysis and Anxiety Relief Based on Field Tests",
        "Authors": "Soyoung Yoo, Sunghee Lee, Seongsin Kim, Eunji Kim, Hwan Hwangbo, Namwoo Kang",
        "Summary": "Despite the approaching commercialization of robo-taxis, various anxiety\nfactors concerning the safety of autonomous vehicles are expected to form a\nlarge barrier against consumers' use of robo-taxi services. The purpose of this\nstudy is to derive the various internal and external factors that contribute to\nthe anxieties of robo-taxi passengers, and to propose a human-machine interface\n(HMI) concept to resolve such factors, by testing robo-taxi services on real,\ncomplex urban roads. In addition, a remote system for safely testing a\nrobo-taxi in complex downtown areas was constructed, by adopting the Wizard of\nOz (WOZ) methodology. From the results of our tests - conducted upon 28\nsubjects in the central area of Seoul - 19 major anxiety factors arising from\nautonomous driving were identified, and seven HMI functions to resolve such\nfactors were designed. The functions were evaluated and their anxiety reduction\neffects verified. In addition, the various design insights required to increase\nthe reliability of robo-taxis were provided through quantitative and\nqualitative analysis of the user experience surveys and interviews.",
        "Page_content": " \n \n \n \nA Study on Anxiety about Using Robo-taxis: \nHMI Design for Anxiety Factor Analysis and Anxiety Relief Based on Field Tests \n \nSoyoung Yoo1, Sunghee Lee1, Seongsin Kim1, Eunji Kim1, Hwan Hwangbo2, Namwoo Kang1,* \n1Mechanical Systems Engineering, Sookmyung Women’s University \n2Hyundai Motor Company \n*Corresponding author: nwkang@sm.ac.kr \n \nAbstract \nDespite the approaching commercialization of robo-taxis, various anxiety factors \nconcerning the safety of autonomous vehicles are expected to form a large barrier against \nconsumers’ use of robo-taxi services. The purpose of this study is to derive the various \ninternal and external factors that contribute to the anxieties of robo-taxi passengers, and \nto propose a human-machine interface (HMI) concept to resolve such factors, by testing \nrobo-taxi services on real, complex urban roads. In addition, a remote system for safely \ntesting a robo-taxi in complex downtown areas was constructed, by adopting the Wizard \nof Oz (WOZ) methodology. From the results of our tests – conducted upon 28 subjects \nin the central area of Seoul – 19 major anxiety factors arising from autonomous driving \nwere identified, and seven HMI functions to resolve such factors were designed. The \nfunctions were evaluated and their anxiety reduction effects verified. In addition, the \nvarious design insights required to increase the reliability of robo-taxis were provided \nthrough quantitative and qualitative analysis of the user experience surveys and \ninterviews. \n \nKeywords: Robo-taxi, Self-driving car, Anxiety, Human-machine interface, Field test \n \n \n \n \n \n1. Introduction \nWaymo, a subsidiary of Alphabet, recently launched the world’s first commercial robo-taxi service \n(LA Times, 2018), and formed a partnership with Renault-Nissan-Mitsubishi. Together they are \ndeveloping the robo-taxi services (reservation and payment systems) required to produce and operate \nrobo-taxis equipped with the autonomous driving technology of Waymo, by 2022 (Nikkei Asian Review, \n2019). Daimler-Benz have signed a contract with Bosch, a company specializing in components, and \nwill start road-testing complete robo-taxis in San Jose, USA. It will also provide car-sharing services \nby developing dispatch applications (Forbes, 2018). Tesla is preparing a robo-taxi service in which \nvehicles not being used by their owners can be instead used as robo-taxis, with the profits being shared \nbetween the owners and Tesla (USA Today, 2019). As described, major global companies are \naccelerating their service innovations, by combining car-sharing and autonomous driving technologies. \nIn South Korea, the world’s first 5G transmission began at the end of 2018, ushering in a \ncommunication era 20 times faster than before (Rcrwirelessnews, 2019). In addition, connected-car and \ncar-sharing services are being actively developed alongside these technological advances. In particular, \nSejong City designated \"free zone\" to regulate self-driving cars, and introduced a test bed of self-driving \nbuses for citizens residing in offroad areas. Sejong City aims to gradually increase the number of service \nareas and commercialize them in 2022 (Kang, 2019). Moreover, SKTelecom constructed a test bed in \nSeoul City, and set up infrastructures such as control platforms and 5G networks in Sangam Digital \nMedia City (DMC), so as to conduct tests on autonomous driving technologies (Koreatimes, 2019). The \ngovernment also designated regulation-free zones, including Hwaseong K city, where autonomous \nvehicles can be tested on ordinary roads, so as to promote active research and development \n(Koreajoongangdaily, 2019). Nevertheless, experimental data in South Korea are noticeably deficient \ncompared to that of the USA, where tests on autonomous vehicles are permitted on real public roads \n(Engadget, 2019). This is because most previous tests of autonomous vehicles in South Korea were \nconducted in controlled environments or in specially fabricated test beds (Forbes, 2017). \nThe commercialization of autonomous vehicles is approaching, and related services will bring many \n \n \nbenefits (Kang et al., 2017; Lee et al., 2019), however, issues surrounding their reliability and safety \nare becoming major barriers against consumers’ adoption of autonomous vehicles (Bansal et al., 2016; \nSchoettle, & Sivak, 2014). Reliability is known to be one of the most important factors affecting users’ \nacceptance of automated systems (Carter & Bélanger, 2005). Although research on reliability is well-\nestablished in the field of psychology, studies on the reliability of autonomous vehicles, as perceived \nby humans, are insufficient (Stanton et al., 2000; Shahrdar, Menezes, & Nojoumian, 2018).  \nShahrdar et al. (2019) assessed passenger perceptions of the reliability of autonomous vehicles in real \ntime, using a virtual reality (VR) simulator, they then analyzed the factors that increase or decrease this \nperceived reliability. Lee et al. (2016) tested a prototype autonomous vehicle after constructing a test \nbed on a road within a university campus. They showed that anxieties over unpredictable situations can \nbe reduced to some extent if passengers are made aware of the fact that the autonomous vehicle is in \nproper operation and can make accurate decisions in various driving situations. However, these tests \nuse only a simulator or test bed, and thus have only a limited capacity to investigate the various factors \naffecting the perceived reliability of autonomous vehicles. If the negative empirical data of users in real \nroad situations can be obtained in advance, problems surrounding the commercialization of robo-taxis \ncan be predicted and reflected in designs. Therefore, there is a growing demand for studies based on \nfield tests (Ghazizadeh et al., 2012). \nTo overcome the challenges of autonomous vehicle field tests, studies have been conducted using the \nWizard of Oz (WOZ) methodology. WOZ is a method in which a tester plays the role of the automated \nsystem from behind a curtain, even though a service that can actually operate the system is provided \n(Dahlbäck et al., 1993; Maulsby et al., 1993). Kim et al. (2020) implemented a robo-taxi service on real \nroads using WOZ and proposed a service design method to resolve pain points and to strengthen the \nelements that positively affected satisfaction with the service. Rothenbucher et al. (2016) conducted \nresearch upon the interactions between unmanned vehicles, pedestrians, and drivers on ordinary roads \nusing WOZ. \nThe purpose of this study is to determine the major factors that contribute to user anxieties, by testing \n \n \nrobo-taxi services on real, complex public road networks, and to propose a human-machine interface \n(HMI) design that can improve reliability using these factors. The WOZ method was adopted here in a \nway identical to that of Kim et al. (2020), so as to test anxiety using actual service situations in \ndowntown areas, where taxis are most frequently used. The subjects participated in the tests whilst \nunder the belief that the services were actual robo-taxi services, and the interactions between the \nsubjects and robo-taxis were remotely controlled from a control tower. \nFigure 1 shows the research framework of this study, which consists of four steps: test design, 1st \nfield test, HMI design, and 2nd field test. In the test design step, scenarios known to cause anxiety were \ncreated, and driving paths were designed accordingly. In addition, a robo-taxi, service application, and \ncontrol tower system were constructed for the field tests. In the 1st field test, the test results were \nanalyzed and key anxiety factors were identified. The test was divided into the pilot and main tests. The \ntest environment was examined by vehicle development experts and non-experts during the pilot test, \nand shortcomings were modified and reflected in the main test. In the HMI design step, HMI solutions \nto resolve the key factors were found and designed. Finally, in the 2nd field test we examined whether \nthe newly developed HMI was able to reduce the anxieties induced by the robo-taxi. Similar to the 1st \nfield test, the main test was conducted after the pilot. \nIn the remaining sections of this paper, each of the four steps of the research framework are \nintroduced in detail. Section 2 introduces the method of designing the robo-taxi anxiety test, and Section \n3 analyzes the results and anxiety factors obtained through the 1st field test. Section 4 proposes HMI \nsolutions to resolve such factors, and Section 5 analyzes the results of the 2nd field test as well as the \neffects of the HMI solutions. Finally, Section 6 summarizes the insights obtained with the experimental \nresults and suggests future studies. \n[Figure 1 near here] \n \n \n \n \n2. Test Design  \nIn this step, a number of scenarios known to contribute to autonomous vehicle-induced anxieties were \ncreated, and a survey was conducted upon the degree of anxiety expected for each scenario. Based on \nthese results, real driving paths were selected to reflect the major scenarios. In addition, a robo-taxi to \nbe used in field tests, an in-vehicle display and mobile application for passenger interactions, and a \ncontrol tower system to perform WOZ were implemented. Finally, the interviews to be conducted before \nand after each field test, as well as the relevant questionnaires, were designed. \n2.1. Design of anxiety scenarios and routes \nThere are 84 scenarios that may cause anxiety, arising from the driving environment, road conditions, \ndriver type, and vehicle controls, these problem were selected through a brainstorming session. In \naddition, the scenarios were classified depending on whether they could be resolved by HMI designs or \nonly by sensors and improved autonomous driving technologies. The scenarios that belonged to the \nlatter group were excluded, because the purpose of this study was to design a HMI that reduces anxiety. \nSimilar factors were then grouped together, resulting in 33 factors, then 22 scenarios that could be \nimplemented through field tests were selected.  \nFor the 22 scenarios selected, an online survey evaluating – on a 7-point Likert scale – the degree of \nanxiety expected for each scenario was conducted, with 320 ordinary (non-expert) respondents. In this \ncase, as the online respondents had no experience of robo-taxis, they were told to evaluate their anxiety \nassuming that, instead of being in a robo-taxi, they were in the passenger seat of a vehicle driven by a \nfriend who had recently acquired a driver’s license, for an effective survey. Of the respondents 70.7% \nwere male and 29.3% were female, 12.9% of them were in their twenties or younger, 16.2% in their \nthirties, 49.2% in their forties, 18.1% in their fifties, and 3.6% in their sixties. Based on the evaluation \nresults, Table 1 shows the top 11 scenarios out of 22 scenarios in which an average anxiety of 5 points \nor higher was expected were finally selected, and real roads that could reflect them were surveyed. \nVarious routes in which the scenarios were likely to occur were derived using the road view of an \n \n \nonline map, and the final test path was determined by visiting them. The final driving path started from \nSookmyung Women’s University and returned to the university via Gyeonggyojang, it required \napproximately 60 minutes of driving. Figure 2 shows the driving path, and Table 1 summarizes the \nanxiety scenarios that are likely to occur in each section. In actual tests, scenarios other than the selected \ntop 11 scenarios could also occur on the test path. \n[Figure 2 near here] \n[Table 1 near here] \nSection S1 contained a two-lane road and a right-turn road in front of a school. It was chaotic due to \nthe frequent jaywalking of pedestrians and the presence of large numbers of motorcycles. In addition, \nit was frequently observed that many porters unloaded objects from trucks directly onto the road. \nTherefore, it was expected that the scenarios of “when a pedestrian suddenly jumps out from a crosswalk \nin the driving signal (1st ranking)”, “when a large object falls from a truck in the middle of the road (2nd \nranking)”, and “when a motorcycle is running next to the vehicle (9th ranking)” could be implemented \nin this section. \nSection S2 passes in front of a train station. It was crowded due to a high concentration of taxis and \npassengers, as well as the many trucks and buses that cross the intersection. Therefore, it was expected \nthat “when the distance to the vehicle ahead is very small (5th ranking)”, “when the view is blocked by \na large vehicle ahead (8th ranking)”, and “when trying to change lanes in a congested area (11th ranking)” \ncould be implemented. Section S3 passes intersections consecutively and includes turns. In this section, \nthe occurrence of “when turning at high speed without slowing down (3rd ranking)” was expected. \nMoreover, an ‘accident notification application’ was developed and artificial accident situations were \ncreated to observe “when turning left with the right blinker on (malfunction) (6th ranking)”, “when there \nis a strange noise in the vehicle (7th ranking)”, and “when stopping in the middle of a crosswalk (10th \nranking)” at once. To simulate such situations, Section S4, which runs in front of an apartment complex \nwhere vehicles can travel at low speed, was selected. Finally, Section S5, an alleyway, was added to the \npath to examine “when traveling at high speed in a narrow alley (4th ranking)”. \n \n \n2.2. Experimental environment design \n2.2.1. Smartphone Application and Interaction Display \nThe robo-taxi service comprised four steps: (1) calling, (2) boarding, (3) traveling, and (4) \ndisembarking. For the services required at each step, a smartphone app (an app for calling) and an in-\nvehicle interaction display were developed. Figure 3 shows representative screens of the developed \nsoftware. In the calling step, the user enters a starting point and a destination using the smartphone app, \nthis requests the taxi. In the boarding step, the user checks the pick-up location of the taxi using the \nsmartphone app, and boards the taxi using the vehicle information and key, both provided through the \napp. When boarding is completed, basic comments (“hello, welcome to the robo-taxi” and “please fasten \nyour seat belt for a safe trip”) are heard from the display installed in front of the seat. When the user \nfastens the seat belt, the vehicle starts traveling and operates the navigation system to show the travel \npath. Finally, in the disembarkation step, when the taxi arrives at the destination, the operation of the \nnavigation system stops and the user gets out of the vehicle. Only the most basic functions were applied \nto the interaction display in the 1st field test, and specific HMI functions were applied in the 2nd field \ntest. \n[Figure 3 near here] \nFurthermore, in the 1st field test, an accident alarm function was applied to the interaction display, and \nthe user response was tested to implement “when there is a strange noise in the vehicle (7th ranking)” \nfrom the anxiety scenarios in Table 1. This function notifies passengers when an accident has occurred \nin the path ahead of the traveling autonomous vehicle. A standby button for the vehicle system – to \nallow the passenger to halt the vehicle, and a control tower connection button – to activate a phone call \nto a service representative, were created. Figure 4 shows how to use the accident occurrence alarm \nfunction. \n[Figure 4 near here] \n2.2.2. Robo-taxi implementation \n \n \nThe robo-taxi interior and exterior environments were constructed based on the passenger car model \nmost popularly employed for ordinary taxis in South Korea (see Figure 5). In the driver’s seat, an opaque \nbulkhead was installed to completely separate the passenger in the passenger seat from the driver’s seat. \nThe passenger was told that an autonomous driving technician was on board for an emergency. In \naccordance with the WOZ methodology, the driver in the driver’s seat actually drove the vehicle during \nthe tests. To resolve the view problem caused by the bulkhead, cameras were installed on the side and \nrear of the vehicle so that the driver could see the outside through the display. In addition, \ncommunication with the control tower was enabled. \n[Figure 5 near here] \nTo monitor and record the field test situations in real time, the images of the user, external road \nsituations, and vehicle speed data were collected. To this end, a camera was installed in the passenger \nseat. In addition, a 360-degree camera was installed outside the vehicle, while On-Board Diagnostics II \n(OBD2) was installed inside the vehicle. Moreover, a Wi-Fi terminal was installed inside the vehicle, \nto enable remote control of all functions from the control tower, all cameras were connected to a \nsmartphone, and this smartphone was connected to the internet so that it could be remotely accessed \nfrom the control tower. With this set-up, the status of the passenger and the driving situation could be \nobserved in real time, and the information required by the user could be provided through the display. \nThe interaction display was installed in front of the passenger seat. \nOne interaction display was used in the 1st field test, whereas four interaction displays were used in the \n2nd field test due to the addition of new HMI functions. The details will be introduced in Section 4. \n2.2.3. Control Center \nThe researcher operating the control tower provided the driver with voice instructions on the vehicle \ncontrol, the driver listened to the instructions through an earphone and carried them out. The display in \nthe passenger seat was directly controlled by the control tower, and it interacted with the user. Figure 6 \nshows the control tower environment and the monitoring for the driving situation in the 1st field test. \n \n \n[Figure 6 near here] \nIn the 2nd field test, the control tower and the driver were required to perform more controls, to \nimplement the new HMI functions. In particular, the control tower typed out response comments in real \ntime, to be implemented by an artificial intelligence speaker, and the comments were converted into \nvoice and delivered to the in-vehicle speaker (see Figure 7(a)). Moreover, for assurances at dangerous \nmoments during driving, the driver could transmit comments using an app developed in advance (see \nFigure 7(b)). For example, when a certain button was clicked, the message “a congested section is \nrecognized. I will drive safely.” was transmitted. A detailed description of the functions will be provided \nin Section 4. \n[Figure 7 near here] \n2.3. Design of image-based interviews and surveys \nInterviews and surveys were conducted before and after each field test. In the surveys and interviews \nconducted before each field test, the subject’s knowledge of and trust in autonomous driving were \nexamined. In the surveys and interviews conducted after each field test, the focus was that of deriving \nthe anxiety factors felt by subjects while they used the robo-taxi. Details of the questions can be found \nin the appendix. In particular, the interviews given after the field tests were conducted while watching \nrecorded videos of the subjects in the vehicle. In this study, a smartphone clicker app was created to \nrecord moments when the subjects felt anxious. The clicker app in the smartphone used to call the \nvehicle was automatically executed from the moment the vehicle began to move to the moment when \nthe subject got off, and the subjects were told to click whenever they felt anxious. During the video \ninterviews, the vehicle interior/exterior videos of the moments when the participants pressed the clicker \nwere shown, and the reasons for pressing the clicker and the degree of anxiety were queried. Figure 8 \nshows a scene of the interview using the clicker.  \n[Figure 8 near here] \nThe number of participants used in the field test was 28 in the 1st pilot test, 18 in the 1st main test, 1 \n \n \nin the 2nd pilot test, and 6 in the 2nd main test. Of the participants, 25% were male and 75% were female, \n50% of them were in their twenties, 18% in their thirties, 18% in their forties, and 14% in their fifties \nor older. As for the driving experience, 21% of the participants had no experience, 39% had less than 3 \nyears’ experience, 4% had 3-6 years, 7% had 6-10 years, and 29% had more than 10 years’ experience; \n61% of them drove less than once a week, 7% drove once a week, 18% 2-3 times a week, 7% 4-6 times \na week, and 7% every day. For the frequency of taxi usage, 54% of them took a taxi less than once a \nweek, 36% once a week, and 11% 2-3 times a week. \nThe interviews conducted before the field tests showed that the anxiety felt in vehicles driven by \nother people was, on average, 3.04 points on a 7-point scale. The average anxiety felt in ordinary taxis \nwas 3.64 points on a 7-point scale, indicating that people felt higher anxiety compared to when they \nwere in ordinary vehicles. When asked “how safe do you think autonomous vehicle technology is \ncompared to human drivers?”, an average of 3.79 points was obtained on a 7-point scale (e.g., 1 point \nfor high anxiety and 7 points for high safety). The result was slightly lower than 4 points, which \ncorresponded to the same safety, indicating that the respondents thought autonomous vehicle \ntechnology was less safe than human drivers. \n \n3. First field test \nThis section shows the major factors affecting the anxieties identified through the 1st field test. Section \n3.1 shows the results of analyzing the clicker usage, and Section 3.2 shows the results of the survey on \nanxiety for virtual scenarios. Section 3.3 analyzes the results of in-depth interviews, and Section 3.4 \nsummarizes the major factors that affect anxiety, based on the analysis results of previous sections. A \ntotal of 21 people participated in the 1st field test, including 3 in the 1st pilot test and 18 in the 1st main \ntest. \n3.1. Analysis of anxiety factors based on clicker usage results \nIn the field tests, the participants used the clicker whenever they felt anxious, and the usage logs were \n \n \nutilized in the video interviews. During the interview, participants were told to explain why they had \nfelt anxious, and they evaluated their degree of anxiety on a 7-point scale. Table 2 shows the anxiety \nfactors reported by the participants in the 1st test, the degree of anxiety (A), the number of clicks on the \nclicker (B), and the number of users who pressed the clicker (C). The total score was obtained by \nmultiplying the degree of anxiety (A) by the number of clicks (B). Based on this, the importance \nrankings were determined. Figure 9 gives examples of the top five factors. \n[Table 2 near here] \n[Figure 9 near here] \nThe top anxiety factors were found to be “cut-in, turning, pedestrian, illegal parking, alley, accident \noccurrence alarm, reckless driving (external vehicle), horn sound (external vehicle), speed, and \nprotruding vehicle”. The participants’ video interview results for the major anxiety factors are as follows. \nThe top-ranking “cut-in” factor occurred when vehicles, taxis, and buses were cutting in around the \nrobo-taxi. This situation most frequency occurred in congested downtown areas. Some of the \nparticipants complained about the fact that the robo-taxi allowed all cut-in vehicles, performing \nexcessively safe driving. Below are the interview replies regarding the cut-in factor. \n“Another vehicle was cutting in. I felt anxious because it was the first situation like this I had \nexperienced in the robo-taxi.” (p16) \n“I felt anxious because buses and taxes cut into my lane. I might have also felt anxious if it had been a \nconventional taxi.” (p17) \n“I felt anxious because the robo-taxi allowed all cut-in vehicles. Allowing all cut-in vehicles increases \nthe traveling time, and I thought the boarding purpose (of fast travel) could not be met.” (p19) \nThe second-ranking “turning” factor occurred when the robo-taxi was in close proximity to nearby \nvehicles whilst making a U- or left turn with them. Below are the interview replies regarding the turning \nfactor.  \n \n \n“I felt anxious because the robo-taxi was likely to collide with another taxi while making a U-turn.” \n(p21) \n“While the robo-taxi was making a left turn, tailgating occurred due to many vehicles on the road. If it \nhad been a conventional taxi, a safe lane change could have been made while making a left turn.” (p19) \n“The robo-taxi made a left turn with vehicles nearby. I felt anxious because the safety distance was not \nsecured.” (p18) \nThe third-ranking “pedestrian” factor occurred when pedestrians jaywalked in congested areas, or \nwhen they stepped out suddenly at right-turn sections. Below are the interview replies regarding the \npedestrian factor. \n“Pedestrians jaywalked while vehicles were stuck in traffic. I was worried about whether the robo-taxi \ncould detect the pedestrians well.” (p21) \n“A pedestrian jumped out in a right-turn section. I was worried about an accident.” (p16) \nAs for the fourth-ranking “illegal parking” factor, complex situations, such as crossing the centerline \nto avoid illegally parked vehicles on the road, caused the participants to feel anxious. Below are the \ninterview replies regarding the illegal parking factor. \n “The robo-taxi was bypassing a vehicle parked on the side of a two-lane road by crossing the centerline. \nI felt worried and anxious about whether the robo-taxi could detect the nearby vehicles well or if it \ncould cross the centerline well.” (p17) \nThe fifth-ranking “alley” factor occurred when the robo-taxi traveled in alleyways, due to the number \nof vehicles parked on the sides of roads and the large numbers of pedestrians. Various obstacles present \nin alleyways was also a source of anxiety for the passengers. Below are the interview replies for the \nalley factor. \n“There were many parked vehicles and pedestrians in an alley, and I was worried about an accident \nbecause the road was too narrow.” (p08) \n \n \n“A pedestrian was walking unaware of the robo-taxi. I was worried about a collision with the pedestrian. \nA function to warn the pedestrian with horns or alerts was necessary.” (p13) \nAs described above, the top five anxiety factors were mostly caused by external situations. In \nparticular, the passengers felt anxious about whether the robo-taxi could recognize and respond well to \nexternal vehicles and people. The sixth-ranking factor was the “accident occurrence alarm” factor. The \nalarm was an HMI function informing the passenger that an accident had occurred in the vicinity of a \ncertain section. With the comment “an accident has occurred up ahead!”, the accident occurrence app \nwas executed in the passenger’s display and two buttons were provided (see Figure 3.). One interesting \npoint of the test results was that the participants used the buttons in different ways, depending on their \ngender; 66% of the women participants used the control tower connection button and the remaining 33% \nattempted a connection to the control tower, but the function did not properly operate due to a control \ntower communication error. On the other hand, 66% of the male participants pressed the standby button \nand 33% did not press any button. These results showed that women have a tendency to actively identify \nthe current situation and to try to obtain information through communication with others in abnormal \nsituations, whereas men have a tendency to wait for the next guidance while judging the situation by \nthemselves. Below are the quotes taken from the interviews with participants. \n“After the robo-taxi successfully passed parked vehicles and a construction site, the accident occurrence \nalarm app was suddenly executed and made me anxious. I was wondering about cancellation or \nconnection to the control tower, but I pressed connection to the control tower because it was my first \nexperience of the situation.” (p17) \n“I felt anxious that the accident occurrence alarm app had been executed due to a problem inside the \nrobo-taxi. I was wondering if it was necessary to stop driving for an accident that had occurred in \nanother vehicle. It would be better if detailed information on an accident situation were provided.” (p19) \n“I kept waiting, not knowing how to respond in the accident occurrence area. I don’t think I would have \nbeen anxious if I had known about the buttons of the accident occurrence alarm app.” (p16) \n \n \nThe interview results indicate that detailed information on how to use the accident occurrence alarm \nfunction and on the details of the accident situation needs to be provided, and that it is more effective \nfor the robo-taxi to automatically select a detour method in the event of an accident in the driving path.  \nTo determine the cause of the ninth-ranking “speed” factor, the interview contents were examined \nand the following results were obtained. \n“The robo-taxi accelerated to keep up with other vehicles upon entering a wide road, and that made \nme anxious.” (p04) \n “The robo-taxi suddenly slowed down. I was anxious because it was my first experience of the \nsituation.” (p16) \nAlthough the robo-taxi changed its speed after recognizing the driving environment, the participants \nwho selected the speed factor sensitively responded to the speed change. The anxiety surrounding the \nspeed factor appears to have occurred because it was the participants’ first experience of an autonomous \nvehicle. It was expected that the user anxiety arising from speed will be reduced if the users have more \nopportunities to board robo-taxis, or if they can provide a desired speed control. \nIn addition, the correlation between anxiety and speed was investigated by mapping the driving speed \nas measured with OBD2, which was installed in the vehicle, and the degree of anxiety recorded using \nthe clicker in the driving situations. When the average speed by section, the number of clicks, and the \nnumber of people who pressed the clicker were examined on a graph (see Figure 10), anxiety was found \nto be high at low speeds and low at high speeds in many cases, contrary to expectations. The highest \nanxiety was found in the alley section, which contained many anxiety factors despite very slow driving. \nTherefore, it was found that anxiety is more affected by the characteristics of each section than by the \nspeed of the robo-taxi for driving in downtown areas. \n[Figure 10 near here] \n \n \n \n3.2. Virtual scenario anxiety factor analysis \nIn the field tests, anxiety scenarios that could not be artificially implemented could not be evaluated. \nTherefore, a survey on the virtual anxiety scenarios that were used in the online survey in Section 2.1 \nwas conducted in the same way as those conducted on people who had experienced the robo-taxi. For \nthem, more realistic evaluations were expected, despite the virtual scenarios. Table 3 shows the \ndifferences between the online respondents who did not experience the robo-taxi and the field test \nparticipants who experienced the robo-taxi. Their degree of anxiety was evaluated on a 7-point scale, \nand the ranking change shows the change in rankings of each anxiety factor between the evaluations of \nthe field test participants and those of the online respondents.  \n[Table 3 near here] \nBoth the field test participants and the online respondents evaluated “when a pedestrian suddenly \njumps out from a crosswalk in the driving signal” as the scenario with the highest anxiety. Of the \nscenarios whose rankings rose; “when the navigation system suddenly stops responding (machine \nmalfunction) (+17)\" and “when the robo-taxi drives without any explanation of the direction (+7)” were \nseen to rise most significantly in rankings. These scenarios are related to the malfunction of the \nnavigation system. The field test participants could judge the error of the navigation system as the \nproblem with autonomous driving technology, because they could predict the behavior of the vehicle \nonly by relying on the information of the navigation system. Therefore, it is expected that the \nmalfunction of the navigation system will significantly affect anxiety in actual robo-taxi services. \nMoreover, “when a vehicle approaches from the opposite direction in a narrow alley (+3)” was included \nin the updated top ten rankings. This appears to be because the participants had a similar experience \nwhen traveling in an alley in the field tests. On the other hand, the representative scenarios whose \nrankings were lowered included “when the distance to the vehicle ahead is very small (-6)” and “when \nthe view is blocked by a large vehicle ahead (-6)”. These results indicate that these are scenarios that \ncause less anxiety after previous experience of them, even though higher anxiety is expected before \nexperiencing them. \n \n \nIn general, the anxiety evaluation scores of the field test participants were lower than those of the \nonline respondents. This indicates that people who have experience of autonomous vehicles may feel \nsafer about autonomous driving than those who have no experience. Therefore, it is expected that the \nanxiety surrounding autonomous driving can be quickly reduced if many people are allowed to \nexperience robo-taxis at the beginning of the service. Many of the participants in the field tests also \nquickly adapted themselves to the robo-taxi, and felt comfortable after boarding. \n3.3. Anxiety factor analysis through in-depth interviews \nThe participants were interviewed on anxiety before and after boarding the robo-taxi, and in-depth \ninterviews were conducted on the following representative areas: (1) Concerns over the robo-taxi \nservice, (2) shortcomings compared to conventional taxis, (3) the most anxious moments in the robo-\ntaxi service, and (4) how to respond to errors of the robo-taxi. \n3.3.1. Concerns over the robo-taxi service \nThere were 28 overlapping answers to the question “do you have any concerns over the robo-taxi \nservice?” Among them, 53% mentioned that there were concerns due to the lack of reliability of the \ntechnology. Many other responses mentioned the inconvenience resulting from the fact that the \npassenger could not control the robo-taxi, and that communication with the robo-taxi was not possible. \nIt can be seen that the anxiety surrounding malfunctions resulting from a lack of reliability of the \nmachine was also ranked second, fourth, sixth, and eighth in the anxiety scenarios in Table 3. Below \nare the quotes from the interviews.  \n“I think I will be anxious without a stop button that can mechanically stop the robo-taxi. I am worried \nthat there is no device to help me handle the situation.” (p02) \n“I will be confused because there is nothing to communicate with in case of an emergency.” (p04) \n“Prompt responses are possible when an accident occurs while I am in a conventional taxi, but I was \nworried in the robo-taxi because there was no one to ask or communicate with in the event of an \naccident.”(p08) \n \n \n3.3.2. Shortcomings compared to conventional taxis \nOf the 25 overlapping answers to the question “what was not good about the robo-taxi compared to \nconventional taxis?”, 40% mentioned anxiety due to inflexible driving. Other responses included a lack \nof reliability, no communication with a driver, a lack of information and guidance, and no control over \nthe vehicle operation, as seen in the previous section. \nConventional taxis can reach the destination faster, as the driver violates traffic laws to some extent if \nthe passenger desires, and the driver generally predicts signals and traffic situations on familiar roads. \nThe robo-taxi, however, drove within the allowed speed range and sometimes even at lower speeds than \nthe regulations, to prevent an accident. This caused many of the participants to feel uncomfortable and \nanxious. In addition, they felt anxious about the lack of communication and information. The 3rd, 5th, \nand 7th rankings of the anxiety scenarios in Table 3, i.e. the cases of a narrow alleyways, high-speed \nturning, and large objects in the middle of the road also indicated anxiety resulting from the lack of \ncommunication with the robo-taxi, or the lack of driving information. It appears that anxiety can be \nreduced if the corresponding information is provided and the driving behavior of the robo-taxi can be \npredicted before the passenger feels anxious. Below are the quotes from the interviews. \n “When the robo-taxi could not exhibit the flexibility that humans do, I felt slightly uncomfortable \nbecause it traveled at lower speed than the allowed speed, even though I did not expect high speed.”(p16) \n“The robo-taxi could not meet its purpose because I usually take a taxi to reach the destination \nfaster.”(p01) \n“I felt uncomfortable because the system did not communicate with the passenger.”(p05) \n“I was not feeling good when disembarking, because there was no message that the destination had \nbeen reached.”(p10) \n3.3.3. The most anxious moment in the robo-taxi service \n Of the 23 overlapping answers to the question “what was the most anxious moment during the test?”, \n \n \n35% mentioned anxiety due to external factors, such as vehicles dangerously cutting in in front of the \nrobo-taxi, pedestrians who jaywalked, and pedestrians who walked in front of the vehicle in a narrow \nalley. As the robo-taxi traveled at constant speeds, it became the target of vehicles traveling fast by \nfrequently changing lanes, and the participants felt anxious about whether the robo-taxi could respond \nwell to vehicles suddenly cutting in. They also felt anxious about whether the robo-taxi could recognize \nand respond well to pedestrians when they walked in front of the vehicle in an alley, or when they \njaywalked. The participants felt uncomfortable because they could only watch such pedestrians from \nthe inside of the vehicle, and could not communicate with the outside, for example by sounding the \nhorn or using emergency lights. This shows that a method for the passenger to communicate with the \nexternal environment must be prepared, beyond the communication channels existing between the \npassenger and the robo-taxi. In the anxiety scenarios in Table 3, the 1st, 9th, and 10th rankings were also \n“when a pedestrian suddenly jumps out”, “when a vehicle approaches from the opposite direction in a \nnarrow alley”, and “when a motorcycle is running next to the vehicle”. These also indicated anxiety \nfrom external factors. Below are the quotes from the interviews. \n“Immediately after the robo-taxi started to move, the vehicle ahead started backing up. I felt anxious \nbecause it was my first time boarding a robo-taxi and because I did not know how the robo-taxi would \nrespond to the situation. I felt uncomfortable because there were unexpected pedestrians on the road.” \n(p04) \n“Another vehicle was approaching from the opposite direction in a narrow one-way alley. I was anxious \nbecause I did not know how to respond.” (p14) \n“I felt anxious when other vehicles came too close or when they cut in, even though the robo-taxi \noperated normally. The surrounding environment made me nervous, rather than the robo-taxi.” (p17) \n3.3.4. How to respond to the error of the robo-taxi \nOf the 29 overlapping answers to the question “what would you do if the robo-taxi showed abnormal \nactions, such as suddenly changing the driving path, or error signals?”, 41% mentioned that connection \n \n \nto the control tower was required, and that humans are required rather than machines when a problem \noccurs, 38% mentioned that the vehicle should be forcibly stopped. The other responses included \n“calling another taxi”, “driving without any action”, “waiting in the vehicle”, and “directly solving the \nproblem”. The need for a control tower capable of solving problems and an emergency exit protocol \nwas raised, to reduce the anxiety of users in preparation for accidents that may occur after the \ncommercialization of robo-taxis. There were also concerns that control towers would infringe privacy \nrights. Below are the quotes from the interviews. \n“As there is no driver who can respond to an emergency, a control tower is required to reduce anxiety \nand promote a sense of security. In this case, however, passengers cannot be free from the eyes of the \npeople in the control tower. An instruction from the control tower will be helpful before getting out of \nthe vehicle.” (p19) \n“I will get out if the vehicle is stopped, but I will jump out of the vehicle if it keeps driving while \ncontinuously exhibiting abnormal behavior.” (p07) \n“It is necessary to stop the vehicle in a fast and safe manner. If the robo-taxi cannot recognize an \nunexpected situation while the passengers are aware of it, a function to safely stop driving will be \nrequired.” (p18) \n3.4. Summary of the derived anxiety factors \nBased on the analysis results of Sections 3.1, 3.2, and 3.3, the major anxiety factors can be \nsummarized, as shown in Table 4. The top ten anxiety factors were selected based on the clicker use \nresults, and five anxiety factors that were not implemented in the field tests were selected from among \nthe top anxiety factors obtained through the virtual scenario evaluation results. Finally, the four \nfundamental anxiety factors obtained through the in-depth interviews were added. \n[Table 4 near here] \n \n \n \n4. HMI Design \nIn this section, the HMI solutions to the major anxiety factors in Table 4, derived from the 1st field \ntest results, are proposed and designed. HMI designs resolving each anxiety factor with the simplest \nand minimal functions were targeted. Table 5 summarizes the final determined HMI functions, which \nwere reflected in the 2nd field test. Among the anxiety factors, strange warning sounds, navigation \nsystem malfunction, and blinker malfunction were integrated as “abnormal operation”. Table 6 shows \nthe additional functions implemented to resolve the pain points found through the 1st field test, even \nthough they were not functions to reduce anxiety. \n[Table 5 near here] \n[Table 6 near here] \nFigure 11 shows the vehicle interior in which each function has been implemented. Although each \nfunction was implemented with different display devices for fast prototyping, they can be integrated \ninto a single display device for the final product. Figure 11(a) shows the actual environment that the \nparticipants experienced when seated in the robo-taxi. The first image from the left in Figure 11(b) \nshows the display by which the passenger can communicate with and control the vehicle. The second \nand third images show displays for providing information. The detailed contents of all functions will be \nintroduced in the following subsections. \n[Figure 11 near here] \n4.1. Speed control functions \nThe 1st field test results showed that many of the participants felt uncomfortable and anxious due to \nthe excessive cruise control of the robo-taxi. To address this problem, a function was created for the \nparticipants to directly control the speed at which they felt comfortable. The robo-taxi traveled in the \n“default” mode, and the mode could be changed to a “fast driving” mode that enabled faster and more \nflexible driving when the passenger was uncomfortable with slow driving, or to a “safe driving” mode \nwhen the passenger felt anxious. The three emoticons located at the top left of the first display in Figure \n \n \n11(b) are the buttons for these driving modes. Table 7 gives detailed descriptions of the three driving \nmodes. \n[Table 7 near here] \n4.2. AI voice function \nIn the 1st field test, many of the participants felt uncomfortable and anxious because they could not \nask and communicate with the robo-taxi. An AI speaker function was installed for communication with \nthe robo-taxi. When the user asked a question, the control tower produced a voice response through the \nspeaker installed inside the vehicle, using text-to-speech synthesis and the WOZ methodology instead \nof an actual AI speaker. Table 8 shows examples of the questions asked by the participants using the AI \nvoice function in the 2nd field test. For reference, “Taeksong” is the name of the AI speaker. \n[Table 8 near here] \nMoreover, in the 1st field test, the reliability of the robo-taxi in accurately recognizing external factors, \nsuch as pedestrians, illegal parking, and obstacles, was low. Because there was no way to examine such \nrecognition, the participants were very anxious about external factors. Therefore, a function by which \nthe robo-taxi provides vocal assurances to the user that it has recognized external situations when it \ndetects unsafe situations before the user does, was added to relieve the anxiety of the passenger. As \nshown in Table 9, insecure external situations were defined based on the experiences obtained through \nthe 1st field test, and voice guidance for each situation was created so that such guidance could be heard \nwhenever the corresponding situations occurred. All these forms of guidance were applied in the 2nd \nfield test. \n[Table 9 near here] \n4.3. Horn, emergency stop, direction guidance, camera, and sleep functions \nThe other HMI functions employed to reduce anxiety are as follows. The first function is the horn. \nThe participants in the 1st field test could not warn other vehicles of their incorrect driving, or \n \n \npedestrians walking in front in an alley, because they could not sound the horn. Therefore, they felt \nanxious, uncomfortable, and embarrassed while they could not take any action. The newly provided \ndisplay in Figure 11(b) allowed participants to send a signal by pressing the horn button. \nThe second is the emergency stop function. The participants could stop driving by pressing the stop \nbutton in the event of an emergency, or when they felt that the robo-taxi was performing abnormal \ndriving. The passengers could take care of personal matters, such as getting off and going to a rest room. \nThey could also stop the vehicle and get off when they wished to escape from an uncomfortable situation. \nWhen the vehicle is stopped, it departs again if the stop button is pressed again. \nThe third is the direction guidance function. In the 1st field test, the participants could hear the blinker \nsound, but they could not identify the direction. Therefore, animation was provided to the passengers \nto inform them of the turning direction, as shown in the middle display of Figure 11(b). This function \ncan also be used to provide information to the passengers in the rear seats. \nThe fourth is the 360° camera image. The real-time 360° camera image can be provided to the \npassengers using the camera installed on top of the vehicle. In the interviews with the participants of \nthe 1st field test, some feedback indicated that the participants felt anxious because they could not \nproperly see ambulances, despite the sound coming from behind the vehicle, and because they had to \nlook around for the ambulances. They also felt anxious when pedestrians were close to the vehicle \nbecause they were not sure about whether the robo-taxi properly recognized them. Therefore, the 360° \nview around the vehicle was provided to the passengers through a monitor, to reduce their anxiety. \nThe final function is the sleep mode. In the 1st field test, some of the participants had to endure \ndrowsiness and respond to the test even in situations where they were not significantly anxious. The 1st \nfield test interview results showed that “sleep” was the most desirable behavior in the robo-taxi. \nMoreover, in the 1st pilot test, passengers were seated in the rear seats for the test, and it was found that \nthey felt drowsy soon and this reduced their opportunity to feel anxious. This indicated that creating an \nenvironment that allows passengers to sleep in the robo-taxi when they are drowsy, and designing a \nsystem that wakes them up at the destination, to prevent them from feeling anxious, would reduce \n \n \nanxiety in the overall robo-taxi experience. When the sleep mode button in Figure 11(b) was pressed, \nan alarm was sounded 100 m before arrival at the destination, so that passengers could sleep when they \nwere drowsy without concern. \n4.4. Other additional functions \nFinally, the two functions in Table 6 that were added to reduce the discomfort of passengers are shown \nin Figure 12. The first function is the departure button. In the 1st field test, participants had to wait \nwithout receiving any information until the vehicle departed. It was found that waiting in the robo-taxi \nuntil something happens, in a participant’s first experience of it, could promote anxiety. Therefore, the \ndeparture button was created so that the vehicle could depart when the participant desired. \nThe second is the robo-taxi search function. In the 1st field test, some participants had difficulty \nfinding the vehicle in the boarding process. For the participants to more easily recognize the vehicle, \nthe vehicle sounded the horn twice to indicate its location when the participant entered a 3 m radius \nfrom it and unfolded its rear-view mirrors when they entered a 1 m radius. \n[Figure 12 near here] \n \n5. Second field test \nIn this section, the anxiety reduction effects of the HMI functions designed in Section 4 are verified \nthrough the 2nd field test, with a robo-taxi equipped with these functions1 . The 2nd field test was \nconducted on the same route as the 1st field test. Seven people participated in the 2nd field test (1 person \nin the 2nd pilot test and 6 people in the 2nd main test). \nThe clicker usage analysis, used in the 1st field test (see Table 2), was here also conducted. Table 10 \nshows the clicker use results of the 2nd field test. The change in the degree of anxiety represents a \n                                           \n1 To promote understanding of this study, videos of the 2nd pilot test and HMI function operation \nhave been posted at the following URL: https://youtu.be/etemMpwljeg \n \n \ndifference from the degree of anxiety in the 1st field test. For the factors common to the 1st and 2nd field \ntests, anxiety decreased in all case except the “alley” factor. \n[Table 10 near here] \nIn the 2nd field test, the ‘inter-vehicle distance’ and ‘obstacle on the road’ factors became apparent. \nThe inter-vehicle distance refers to the distance between the robo-taxi carrying the participant and an \nexternal vehicle, and obstacles on the road means any animals or objects found on the road that cause \nanxiety. These caused anxieties surrounding collisions with external objects. The participants indicated \nthat the drivers of conventional taxis could handle these factors well. It is judged that the robo-taxi may \nalso reduce anxiety if it detects a collision with external factors well, or if it provides vocal assurance \nthat it is well aware of such factors. Below are the relevant interview responses.  \n “When another vehicle approached, I was worried about a collision. If it had been a conventional taxi, \nI would have told the driver that it was too close…” (p27) \n “The robo-taxi travelled fast without avoiding the many pigeons on the road. A conventional taxi \nwould have handled the situation better. Sophisticated recognition technology or voice messages \nconfirming recognition would be helpful.” (p24)  \nIn the 2nd field test results, 15 anxiety factors that occurred in the 1st field test did not occur. Although a \nsimple comparison is difficult because the test was conducted with fewer participants than the 1st field \ntest, it appears that the effects of the HMI functions were observed in light of the fact that the degrees \nof anxiety decreased. For more quantitative evaluation, a survey on the degrees of helpfulness of the \nmajor HMI functions in relieving anxiety was conducted on a 7-point scale, and the results are shown \nin Figure 13(a). All the HMI functions exhibited scores of four points or higher, corresponding to \n“normal”, and indicating that they were helpful in reducing anxiety. In particular, direction guidance, \nemergency stopping, speed control, and AI voice guidance exhibited scores of five points or higher. \nThere were some differences in the results of the survey asking what functions were required for the \nrobo-taxi. As can be seen from Figure 13(b), the horn function was evaluated as the second necessary \n \n \nfunction for the robo-taxi. This means that the function is essential for communication with the external \nenvironment, even though it may be relatively less helpful in relieving anxiety. Moreover, after each \nfield test, a survey on the overall satisfaction with the robo-taxi service, and the participant’s willingness \nto use it, was conducted on a 7-point scale, and the results of the 2nd field test were compared with those \nof the 1st field test. As shown in Figure 13(c), the 2nd field test (with the HMI functions) exhibited higher \noverall satisfaction and participant willingness than the 1st field test (without HMI functions). This \nconfirms that the HMI functions added in this study reduced anxiety, thereby providing positive robo-\ntaxi usage experiences, and increasing willingness to use robo-taxis in the future. In addition, the vehicle \nsearch function was shown to be helpful, because it exhibited an average of 5.33 points on a 7-point \nscale. \n[Figure 13 near here] \nAlong with the positive results, shortcomings were found. Although the 2nd field test generally \nexhibited better results than the 1st field test, some participants were dissatisfied with the fact that the \nrobo-taxi was not as flexible in driving as conventional taxis. Furthermore, although a HMI function to \ncommunicate with passengers was added, it was not ideal for passengers who expected communication \ncomparable to that experienced with a human driver. In addition, the 360° camera showed the lowest \nsatisfaction, and its anxiety reduction effect was not significant. Below are the results of user interviews \non the major HMI functions. \n“I used various functions, and they were generally good. I feel uncomfortable with human taxi drivers, \nbut the voice guidance of the robo-taxi was comfortable. It was possible to look around with the camera.” \n(p27) \n“Everything went well. Before arrival at the destination, I asked Taeksong (AI speaker) about the \nexpected arrival time. Taeksong provided correct information, which was satisfactory.” (p25) \n“I felt safe because the robo-taxi told me that it was aware of the outside situation. I could not figure \nout what the 360° camera was showing. The horn function had some time delay between pressing the \n \n \nbutton and hearing the horn sound. There was no arrival guidance in the sleep mode. I think the sleep \nmode function is not necessary when I am anxious.” (p23) \n \n6. Discussion and Conclusion \n6.1. Discussion \nThe insights for reducing robo-taxi anxieties, obtained from the two field tests, are summarized as \nfollows. They will be helpful as guidelines for future robo-taxi HMI development. \nFirst, the robo-taxi required flexibility in its driving. In this study, the 3-level speed control functions \nwere presented and their anxiety reduction effects were confirmed. However, a large portion of the \nfeedback indicated that more driving flexibility is necessary, because the main purpose of using a taxi \nis to travel faster. In the event of an outside accident, the robo-taxi also should have been more flexible, \nby providing detailed information on the situation and bypassing the site. As safety and flexibility are \nconflicting items, they will be very important issues in future robo-taxi developments. The relevant \nparticipant interview segments are as follows. \n “The purpose of taking a taxi instead of other mass transportations is to travel faster, because the \npassengers are in a hurry, but the autonomous driving mode could only perform normal behavior. This \nmade me uncomfortable because human taxi drivers could travel faster, even illegally if I was in a rush.” \n(p26) \n“The robo-taxi was not good at judgments and simply stopped when there were illegally parked vehicles. \nI thought its judgment ability was poor and I felt uncomfortable.” (p28) \nSecond, effective interaction with the outside is required. This is because several major anxiety \nfactors, such as cut-ins, reckless driving, protruding vehicles, external horn sounds, and pedestrian \nfactors, are related to external vehicles and pedestrians. The most frequent answer to the question “what \nwas the most anxious moment during the test?” corresponded to the moment when there was an \n \n \nunexpected situation outside. In this study, the horn function was provided to allow the participants to \ncommunicate with the outside. Although this is the most basic function, its necessity was highly \nevaluated, as it was selected as the second most important function in the survey conducted on the \nfunctions required of the robo-taxi. Therefore, various methods for passengers or robo-taxis to interact \nwith external vehicles and pedestrians need to be considered in addition to horns. Extracts from the \nrelated interviews with the participants are as follows. \n“I was anxious about whether the robo-taxi could cope well with the signal violations of other vehicles.” \n(p27) \n“I was nervous because I felt the robo-taxi could not respond well to vehicles cutting in. The reaction \nspeed was poor.” (p28) \n“I was worried about whether the robo-taxi could respond well to motorcycles or buses cutting in.” (p24) \n“A motorcycle passed by while the robo-taxi was passing through a crosswalk after turning left. I felt \nthat the horn mode was necessary, to inform nearby vehicles of a risk.” (p26) \nThird, many of the participants had a low confidence in robo-taxi technology due to the risk of an \naccident. Therefore, it is necessary to test specific scenarios on the occurrence of accidents and faults, \nand to examine pain points before establishing robo-taxi services. To increase the reliability of robo-\ntaxis and decrease anxiety, large quantities of accurate information on how to respond to unexpected \nsituations while driving need to be provided to users. For example, it is necessary to produce guidance \nvideos for passengers to watch before boarding robo-taxi services or while on the move, and to \ndetermine specific protocols for the responses of robo-taxis in the event of accidents. The relevant \ninterview extracts are as follows. \n“The comments, such as ‘the robo-taxi had an emergency stop’, ‘an emergency stop will occur’, and \n‘the robo-taxi will bypass an illegally parked vehicle’, were very good. I thought urgent situations can \nbe better handled with guidance.” (p26) \n“Guidance is necessary for all functions and precautions. If guidance is not possible, information needs \n \n \nto be provided through in-vehicle voice guidance.” (p25) \n“Anxiety will be reduced if descriptions on several specific situations and how to respond to them are \nprovided to passengers before boarding the robo-taxi.” (p24) \nFourth, basic functions required to relieve robo-taxi anxiety could be confirmed in this study. The \nresults of this study showed that robo-taxis must provide not just the information that would be provided \nby human taxi drivers, but also extra information to reduce anxiety. Seven major HMI functions were \ndesigned in this study. Among them, the direction guidance, emergency stop, speed control, and AI \nvoice guidance functions exhibited relatively large effects on anxiety relief. It was found that a horn \nfunction must be included as a basic function of robo-taxis, to facilitate communication with external \nenvironments. In particular, speed control, AI voice guidance, and horn functions have not been \nimplemented in currently available robo-taxi services, such as Waymo. They need to be reflected in \nfuture robo-taxi services (The Verge, 2018). The navigation system is the most basic function of the \nrobo-taxi, but its malfunction could provide relatively high anxiety because it is regarded as a problem \nwith autonomous driving technology. The relevant interview extracts are as follows. \n“I was not using the fast driving function because I was worried about an accident, but the speed was \nappropriate. The stop and horn functions were satisfactory, but the 360° camera images were complex \nand dizzying. I was also satisfied with the AI voice guidance function.” (p25) \n“The fast driving mode was good because it was faster and safer than I thought.” (p22) \nIn addition to the major insights described above, several interesting phenomena could also be found \nthrough the field tests. First, differences in behavior between men and women in the event of an accident \nwere found through the accident occurrence alarm app scenarios. While women showed a tendency to \naggressively identify the current situation by communicating with real people, men tended to wait for \nthe next guidance while they further observed and judged the situation. \nSecond, there was no correlation between speed and anxiety. When the relationship between the \nclicker usage record and the vehicle speed was examined, it was found that the anxiety of the users was \n \n \ncaused by surrounding elements, and that the sections where they had felt high anxiety had a low \ncorrelation with the vehicle speed.  \n6.2. Conclusion \nWith the accelerating commercialization of robo-taxi services, there is a growing need for research \non the anxieties produced in potential customers by autonomous vehicles. To relieve such anxieties, it \nis necessary to provide solutions through the improvement of autonomous driving technologies, and to \nidentify the fundamental causes of the anxieties. If these factors can be resolved using uncomplicated \nHMI methods, the methods will contribute to the stable establishment of robo-taxi services. The purpose \nof this study was to provide robo-taxi usage experiences of real road situations in complex downtown \nareas, to identify the factors responsible for anxiety during such experiences, and to provide HMI \nsolutions to resolve such factors. A robo-taxi service that can be safely tested in downtown Seoul was \nimplemented using the Wizard of Oz (WOZ) methodology, and the one-hour driving distance was tested \nwith 28 participants to evaluate various anxiety occurrence scenarios. From the 1st field test, 19 major \nanxiety factors were derived, and seven HMI functions were designed to resolve the factors. The effects \nof the HMI functions were verified in the 2nd field test. \nThe anxiety factor analysis results – based on the customer experiences obtained through the field \ntests – are expected to be used as guidelines in HMI design for robo-taxi services in the future. In \naddition, various ways of resolving the major anxiety factors identified will be created, and it will be \npossible to develop better HMI concepts for anxiety relief, by benchmarking the HMI concept presented \nin this study. Finally, the WOZ methodology implemented in this study can be used in various robo-taxi \nfield tests. \nThe following future studies will be conducted. First, intensive user experience (UX) evaluation and \nsolution development will be performed for specific scenarios presenting a high customer demand. For \nexample, it was found that the demand of female consumers for the late-night use of robo-taxis was \nhigh. This is because robo-taxis carry no risks of the crimes sometimes committed by human taxi drivers. \nMoreover, UX solutions are required for autonomous vehicles to be adequately prepared for accidents. \n \n \nIn particular, as it is likely that those from socially underprivileged groups, such as the elderly, children, \nand people with disabilities, will board robo-taxis alone, solutions are required for them to easily cope \nwith accidents. \nSecond, UX evaluation is required for specific HMI functions. For example, in the results of this \nstudy, there was a high customer need for interaction with external vehicles and pedestrians. Effective \ninteraction solutions and specific HMI solutions to improve kindness and friendliness need to be \ndeveloped, and UX evaluation for such solutions is required. \nThird, an upgrade of HMI functions is required for commercialization. For example, satisfaction with \nthe sleep mode HMI was not high in this study, because it consisted of only an alarm function. When \nthe function is applied to real vehicles, however, it will be possible to design better sleep environments, \nby using automatically tilting seats, reducing the illuminance, installing automatic sun shades on \nwindows, playing autonomous sensory meridian response (ASMR) videos, and burning sleep-inducing \nincense. \n \nAcknowledgements \nThis work was supported by Hyundai Motor Company and the National Research Foundation of \nKorea (NRF) grants funded by the Korean government (No.2017R1C1B2005266 and \nNo.2018R1A5A7025409). The authors wish to thank Eunju Jeong, Ah-hyeon Jin, Seohui Joung, Woojin \nKwak, Gyuwon Lee, Jihyun Lee, Yunha Park, Hanyoung Ryu and Seungyeon Shin, who were \nundergraduate intern researchers, for their support in setting the tests, conducting surveys, and \nsummarizing the survey results. \n \n \n \n \n \nReferences \nBansal, P., Kockelman, K. M., & Singh, A. (2016). Assessing public opinions of and interest in new \nvehicle technologies: An Austin perspective. Transportation Research Part C: Emerging \nTechnologies, 67, 1–14. https://doi.org/10.1016/j.trc.2016.01.019 \nCarter, L., & Bélanger, F. (2005). The utilization of e-government services: Citizen trust, innovation \nand acceptance factors. Information Systems Journal, 15(1), 5–25. https://doi.org/10.1111/j.1365-\n2575.2005.00183.x \nDahlbäck, N., Jönsson, A., & Ahrenberg, L. (1993). Wizard of oz studies-why and how. International \nConference on Intelligent User Interfaces, Proceedings IUI, Part F127502, 193–200. \nhttps://doi.org/10.1016/0950-7051(93)90017-N \nEngadget. (2019). Waymo will test its self-driving taxis on employees in California. Retrieved from \nhttps://www.engadget.com/2019/07/03/waymo-test-self-driving-taxis-employees-california/ \nForbes. (2017). How South Korea Plans to Put Driverless Cars on The Road By 2020. Retrieved from \nhttps://www.forbes.com/sites/elaineramirez/2017/02/07/how-south-korea-plans-to-put-driverless-\ncars-on-the-road-by-2020/#4dbd89f1448f \nForbes. (2018). Daimler And Bosch Choose San Jose for Their Silicon Valley Robo-Taxi Service. \nRetrieved https://www.forbes.com/sites/samabuelsamid/2018/11/08/daimler-and-bosch-to-launch-\nautomated-mobility-pilot-in-san-jose-in-2019/#19ca2828601b \nGhazizadeh, M., Peng, Y., Lee, J. D., & Boyle, L. N. (2012). Augmenting the Technology Acceptance \nModel with trust: Commercial drivers’ attitudes towards monitoring and feedback. Proceedings of \nthe Human Factors and Ergonomics Society, 2286–2290. \nhttps://doi.org/10.1177/1071181312561481 \nKang, N., Feinberg, F. M., and Papalambros, P. Y. (2017). Autonomous Electric Vehicle Sharing \nSystem Design. Journal of Mechanical Design, 139(1), 011402. \nKang, K. (2019). South Korea to offer autonomous bus services by 2022. Intelligenttransport. \nRetrieved from https://www.intelligenttransport.com/transport-news/91770/south-korea-to-offer-\nautonomous-bus-services-by-2022/ \nKim, S., Chang, J., Park, H. H., Song, S. U., Cha, C. B., Kim, J. W., and Kang, N. (2020). \nAutonomous Taxi Service Design and User Experience. International Journal of Human–Computer \nInteraction, 36(5), 429–448. \nKoreatimes. (2019). SKT to build 5G-powered traffic system in Seoul. Retrieved from \nhttp://www.koreatimes.co.kr/www/tech/2019/01/133_262245.html \nLA Times. (2018). Waymo One, the first commercial robotaxi service, is now picking up passengers \nin Arizona - Los Angeles Times. Retrieved from https://www.latimes.com/business/autos/la-fi-hy-\nwaymo-one-20181205-story.html \nLee, J. I., Kim, N., Imm, C., Kim, B., Yi, K., … J. K. (2016). A Question of Trust: An Ethnographic \nStudy of Automated Cars on Real Roads. Proceedings of the 8th International Conference on \nAutomotive User Interfaces and Interactive Vehicular Applications, 16(3), 7–8. \nhttps://doi.org/10.1016/S0969-4765(08)70079-1 \nLee, U., Kang, N., and Lee I. (2019). Shared Autonomous Electric Vehicle Design and Operations \nUnder Uncertainties: A Reliability-based Design Optimization Approach. Structural and \n \n \nMultidisciplinary Optimization, doi:10.1007/s00158-019-02434-0 \nMaulsby, D., Greenberg, S., & Mander, R. (1993). Prototyping an intelligent agent through Wizard of \nOz. Conference on Human Factors in Computing Systems - Proceedings, 277–284. https://doi.org/1 \n0.1145/169059.169215 \nMaulsby, D., Greenberg, S., & Mander, R. (1993). Prototyping an intelligent agent through Wizard of \nOz. Conference on Human Factors in Computing Systems - Proceedings, 277–284. https://doi.org/1 \n0.1145/169059.169215 \nNikkei Asia Review (2019). Nissan-Renault-alliance-to-join-Google-on-self-driving-cars @ \nasia.nikkei.com. Retrieved from https://asia.nikkei.com/Business/Companies/Nissan-Renault-\nalliance-to-join-Google-on-self-driving-cars \nRothenbucher, D., Li, J., Sirkin, D., Mok, B., & Ju, W. (2016). Ghost driver: A field study \ninvestigating the interaction between pedestrians and driverless vehicles. 25th IEEE International \nSymposium on Robot and Human Interactive Communication, RO-MAN 2016, 795–802. \nhttps://doi.org/10.1109/ROMAN.2016.7745210 \nSchoettle, B., & Sivak, M. (2014). A Survey of Public Opinion about Autonomous and Self-Driving \nVehicles in the U.S., the U.K., and Australia. Report No. UMTRI-2014-21, (July), 1–42. \nhttps://doi.org/10.1109/ICCVE.2014.7297637 \nShahrdar, S., Park, C., & Nojoumian, M. (2019). Human Trust Measurement Using an Immersive \nVirtual Reality Autonomous Vehicle Simulator. Conference: AAAI/ACM Conference on AI. \nRetrieved from www.aaai.org \nShahrdar, S., Menezes, L. F., & Nojoumian, M. (2018). A survey on trust in autonomous systems. \nIEEE Computing Conference, (May). IEEE Computing Conference. \nStanton, N. A., & Young, M. S. (2000). A proposed psychological model of driving automation. \nTheoretical Issues in Ergonomics Science, 1(4), 315–331. \nhttps://doi.org/10.1080/14639220052399131  \nUSA Today. (2019). Can Elon Musk’s robotaxi plan help Tesla owners make $30,000 a year? USA \nTODAY. Retrieved from https://www.usatoday.com/story/tech/2019/04/23/elon-musk-says-tesla-\nowners-could-make-30-000-robotaxi- network/3549652002/ \n \n \n \n \nTable 1. Anxiety scenario rankings and their application to service sections \nAnxiety ranking \nSection \nVirtual scenario \n1 \nS1 \nWhen a pedestrian suddenly jumps out from a crosswalk in the driving signal \n2 \nS1 \nWhen a large object falls from a truck in the middle of the road \n3 \nS3 \nWhen turning at high speed without slowing down \n4 \nS5 \nWhen traveling at high speed in a narrow alley \n5 \nS2 \nWhen the distance to the vehicle ahead is very small \n6 \nS4 \nWhen turning left with the right blinker on (malfunction) \n7 \nS4 \nWhen there is a strange noise in the vehicle \n8 \nS2 \nWhen the view is blocked by a large vehicle ahead \n9 \nS1 \nWhen a motorcycle is running next to the vehicle \n10 \nS4 \nWhen stopping in the middle of a crosswalk \n11 \nS2 \nWhen trying to change lanes in a congested area \n \n \n \n \n \n \n \nTable 2. Results of deriving anxiety factors based on the clicker \nRank \nAnxiety factor \nTotal score \n(A × B) \nDegree of anxiety \n (7-point scale) \n(A) \nNumber of clicks \n(B) \nNumber of users \nwho pressed the \nclicker (C) \n1 \nCut-in \n58.5 \n3.25 \n18 \n11 \n2 \nTurning (left-turn/right-turn/U-\nturn) \n42.5 \n4.25 \n10 \n8 \n3 \nPedestrian \n41.5 \n3.78 \n12 \n10 \n4 \nIllegal parking \n40.0 \n3.33 \n12 \n11 \n5 \nAlley/narrow road \n33.5 \n4.79 \n8 \n8 \n6 \nAccident occurrence alarm \n27.0 \n4.50 \n6 \n6 \n7 \nReckless driving/overtaking \nvehicle \n26.5 \n4.42 \n7 \n6 \n8 \nHorn sound (external vehicle) \n24.5 \n3.50 \n7 \n5 \n9 \nSpeed (fast or slow) \n24.5 \n4.10 \n6 \n5 \n10 \nProtruding vehicle \n24.0 \n4.00 \n6 \n5 \n11 \nBacking vehicle (external \nvehicle) \n21.0 \n4.20 \n5 \n5 \n12 \nCongested area \n21.0 \n4.20 \n5 \n5 \n13 \nLane change \n19.5 \n3.90 \n6 \n4 \n14 \nLack of information (getting \noff, stop, and detour) \n15.0 \n3.00 \n5 \n4 \n15 \nSystem errors (GPS error and \ntraveling path error) \n13.5 \n3.40 \n4 \n3 \n16 \nVehicle delay \n10.5 \n3.50 \n3 \n3 \n17 \nJoining section \n10.0 \n5.00 \n2 \n1 \n18 \nInterrupted view \n7.5 \n3.75 \n2 \n2 \n19 \nMotorcycle \n7.0 \n4.50 \n2 \n2 \n20 \nExcessive information \n7.0 \n3.50 \n2 \n2 \n21 \nDriving without flexibility \n(compliance with stop lines and \ntraffic laws) \n7.0 \n3.50 \n3 \n3 \n22 \nLack of adaptation to new \ntechnology \n5.0 \n2.50 \n2 \n2 \n23 \nUphill road \n2.0 \n2.00 \n1 \n1 \n24 \nSudden stop \n1.5 \n1.50 \n1 \n1 \n25 \nGround imbalance \n1.0 \n1.00 \n1 \n1 \n26 \nDriving at a yellow signal \n1.0 \n1.00 \n1 \n1 \n \n \n \n \n \n \nTable 3. Anxiety virtual scenario comparison \nRank \nVirtual scenario \nField test \nparticipants \nOnline \nrespondents \nRanking \nchange \n1 \nWhen a pedestrian suddenly jumps out from a crosswalk in the \ndriving signal \n6.00 \n6.59 \n0 \n2 \nWhen there is a strange warning sound in the vehicle while \ndriving \n(When the sound is heard whenever the driver is anxious) \n5.71 \n5.72 \n+5 \n3 \nWhen traveling at high speeds in a narrow alley \n5.57 \n5.99 \n+1 \n4 \nWhen the navigation system suddenly stops responding \n(navigation system malfunction) \n5.56 \n4.45 \n+14 \n5 \nWhen turning at high speed without slowing down \n5.40 \n6.09 \n-2 \n6 \nWhen turning left with the right blinker on (machine \nmalfunction) \n5.36 \n5.76 \n0 \n7 \nWhen a large object falls from a truck in the middle of the road \n5.21 \n6.22 \n-5 \n8 \nWhen stopping in the middle of a crosswalk \n5.14 \n5.11 \n+2 \n9 \nWhen a vehicle approaches from the opposite direction in a \nnarrow alley \n5.00 \n4.93 \n+3 \n10 \nWhen a motorcycle is running next to the vehicle \n4.96 \n5.13 \n-1 \n11 \nWhen the distance to the vehicle ahead is very small \n4.86 \n5.86 \n-6 \n12 \nWhen trying to change lanes in a congested area \n4.82 \n5.04 \n-1 \n13 \nWhen the robo-taxi (driver) drives without any explanation of \nthe direction \n4.82 \n4.32 \n+ 7 \n14 \nWhen the view is blocked by a large vehicle ahead \n4.50 \n5.42 \n- 6 \n15 \nWhen crossing an intersection with blinking yellow traffic lights \n4.50 \n4.85 \n- 2 \n16 \nWhen traveling on a road under construction without lanes \n4.46 \n4.34 \n+3 \n17 \nWhen nearby vehicles travel at high speed \n4.36 \n4.82 \n-3 \n18 \nWhen traveling on unfamiliar roads \n4.33 \n4.50 \n-1 \n19 \nWhen an ambulance is following with a siren \n4.32 \n4.62 \n-4 \n20 \nWhen going down a steep area \n4.25 \n4.60 \n-4 \n21 \nWhen turning left or right at a crosswalk \n3.93 \n4.20 \n+1 \n22 \nWhen trying to make a U-turn \n3.68 \n4.28 \n-1 \n \n \n \n \nTable 4. Derived anxiety factors (19 factors) \nAnalysis method \nMajor anxiety factors \nRemark \nClicker use results \n(Section 3.1) \nCut-in, turning, pedestrian, illegal parking, alley, accident occurrence \nalarm, reckless driving (external vehicle), horn sound (external vehicle), \nspeed, and protruding vehicle \nTop ten factors \nVirtual scenario \nevaluation   \n(Section 3.2) \nStrange warning sound, navigation system malfunction, obstacle on the \nroad, vehicle stop in the middle of a crosswalk, and blinker malfunction \nTop five factors that did \nnot occur in the field tests \nIn-depth interviews \n(Section 3.3) \nLack of technical reliability, communication with external environments, \nlack of information, and robo-taxi out of control \nFour fundamental anxiety \nfactors \n \n \n \n \n \n \n \n \n \n \n \n \n \nTable 5. Major HMI solutions \nNo \nHMI \nDetailed function \nAnxiety factors that can be resolved \n1 \nSpeed control \nThe passenger can adjust speed in three \nsteps \nFast or slow speed / turning / alley / robo-taxi out \nof control \n2 \nAI voice guidance \nGuidance after detecting anxious \nsituations / \nResponse to passenger questions / \nProviding diverse information \nCut-in / pedestrian / illegal obstacle / alley / \nabnormal operation / reckless driving / protruding \nvehicle / stopping in the middle of a crosswalk / \nlack of technical reliability \n3 \nHorn function \nWarning or alerting pedestrians / \nWarning or alerting nearby vehicles \nProtruding vehicle / horn sound / reckless driving \n/ alley / illegal parking / obstacle on the road / \npedestrian / communication with external \nenvironments \n4 \nEmergency stop \nThe passenger can stop the vehicle \nforcibly / \nDriving can be re-started when desired \nby the passenger \nAbnormal operation / robo-taxi out of control \n5 \nDirection guidance \nNotifying turning directions in advance \nTurning / lack of information \n6 \n360° camera view \nProviding a real-time 360° view around \nthe vehicle \nAlley / pedestrian / lack of information \n7 \nSleep mode \nWaking the passenger up at the desired \ntime when the destination is reached \nOverall anxiety relief \n \n \n \n \n \n \nTable 6. Other additional functions \nNo \nHMI \nDetailed function \n1 \nDeparture button \nAfter boarding, the vehicle can depart when the passenger desires. \n2 \nVehicle search \nWhen the passenger approaches the robo-taxi they called, it will sound the horn or unfold \nmirrors. \n \n \n \n \n \nTable 7. Details of the speed control functions \nFunction name \nDriving characteristics \nApplication situations \nFast driving \n \nMaximum speed: 60 km/h.  \n \nInter-vehicle distance when stopped: 1 m or less \n \nInter-vehicle distance while driving: 1-3 m \n \nFor departure from the stop, speed is rapidly \nincreased. After quickly detecting a congested \narea, pass the area through lane changes. \nWhen uncomfortable with slow robo-\ntaxi driving (ex. on roads without \nvehicles and for faster arrival at the \ndestination). \nDefault \n \nMaximum speed: 50 km/h. Inter-vehicle distance \nwhen stopped: 1 m.  \n \nInter-vehicle distance while driving: 3-5 m \n \nFor departure from the stop, speed is slowly and \nsmoothly increased.  \n \nPerform safe driving after recognizing all \nsituations. \nWhen stable speed is desired \nWhen not in a rush \n(ex. general road conditions) \nSafe driving \n \nMaximum speed: 30 km/h. Inter-vehicle distance \nwhen stopped: 2 m or longer \n \nSafe driving: The inter-vehicle distance of 4-7 m \nto be maintained while driving \n \nAlmost no lane change while driving. For \ndeparture from the stop, speed is increased very \nslowly.  \n \nYielding and defensive driving is performed as \nmuch as possible. Very slow driving in alleys. \nWhen very nervous and anxious \n(ex. in alleys and on market streets) \n \n \n \n \n \n \nTable 8. Examples of AI voice communication \nFunction name \nExamples of voice questions in the 2nd field test \nApplication situations \nAI speaker \n(aka Taeksong) \n“Taeksong, how is the weather today?” \n“Taeksong, turn on the radio” \n“Taeksong, turn on the heater” \n“Taeksong, activate the sleep mode” \n“Taeksong, when will we arrive?” \n“Taeksong, why are we stuck in traffic?” \n“Taeksong, is there any problem with the car?” \n“Taeksong, why did you stop here?” \n- When travel-related information is \nrequired \n- When it is necessary to control the \nbasic functions of the vehicle (e.g., \nopening windows and turning on the \nheater) \n- When questions are asked out of \nboredom \n \n \n \n \n \n \nTable 9. AI voice guidance by situation \nSituation \nVoice guidance \nPedestrian: When pedestrians walk or jump out in \nfront of the vehicle \n“The robo-taxi has recognized pedestrians. Rest assured.” \nNarrow path: When passing through alleys or very \nnarrow roads due to parked vehicles \n“The robo-taxi has recognized a narrow alley. It will drive safely.” \nTraffic congestion: When violating a centerline in a \ncongested area due to large numbers of vehicles, \nafter turning left/right \n“A congested area has been recognized. The robo-taxi will drive \ncarefully.” \nIllegal parking: When violating a centerline or a lane \nwhile attempting to pass vehicles illegally parked on \nthe sides of a road \n“Illegal parking has been recognized. The robo-taxi will drive \ncarefully.” \nSudden stop: When a sudden stop is required due to \nthe traffic signal or external vehicles (reckless \ndriving) \n“The robo-taxi made a sudden stop. Are you all right?” \nSleep mode: When the sleep mode is in operation. \n“300 m to the destination. Please wake up, bang bang!” \nRecommendation on the use of the function: When \nthe user is bored and does not use the provided \nfunction. \n“Various modes are available. Please give them a try as the robo-\ntaxi will drive safely.” \nOn departure \n“Hello, welcome aboard the robo-taxi.” “Please fasten your seat belt \nfor safety.” “The robo-taxi’s destination is the entrance to \nGyeonggyojang.” “Please press the departure button when ready.” \nOn arrival \n”100 m to the destination. Please check if all your belongings are \nwith you.” ”When the door is open, please look outside before \nleaving the vehicle.”, “Thank you for using the robo-taxi. See you \nagain next time.” \n \n \n \n \n \n \nTable 10. Comparison of the 1st and 2nd field test results through the clicker \nRank \nAnxiety factor \nTotal Score \n(A×B) \nDegree of \nanxiety \n(7-point \nscale)(A) \nNumber of \nclicks (B) \nNumber of \npeople who \npressed the \nclicker (C) \nChange in \nthe degree of \nanxiety \n1 \nCut-in \n(external \nvehicle) \n16.0 \n3.20 \n5 \n2 \n-0.05 \n2 \nInter-vehicle distance \n14.5 \n4.83 \n3 \n2 \nNew \n3 \nAlley \n15.5 \n5.20 \n3 \n3 \n+0.40 \n4 \nSudden stop \n7.5 \n3.75 \n2 \n2 \n-2.25 \n5 \nLeft turn \n4.0 \n4.00 \n1 \n1 \n-0.25 \n6 \nInflexible driving \n3.0 \n3.00 \n1 \n1 \n-0.50 \n7 \nPedestrian \n2.0 \n2.00 \n1 \n1 \n-1.70 \n8 \nObstacle on the road \n5.0 \n5.00 \n1 \n1 \nNew \n9 \nSlow driving \n3.0 \n3.00 \n1 \n1 \n-1.80 \n \n \n \n \n \n \nFigure 1. Research Framework \n \n \n \n \n \n \n \nFigure 2. Robo-taxi service path (Yongsan-gu, Seoul) \n \n \n \n \n \n \nFigure 3. Smartphone Application and Interaction Display \n \n \n \n \n \n \n \nFigure 4. Accident occurrence alarm function \n \n \n \n \n \n \n \nFigure 5. Robo taxi exterior/interior environment \n \n \n \n \n \n \n \nFigure 6. Control tower environment in the 1st field test \n \n \n \n \n \n \nFigure 7. Control tower and driver’s seat environments in the 2nd field test \n \n \n \n \n \n \nFigure 8. Example of clicker and video interview \n \n \n \n \n \n \nFigure 9. Examples of the major anxiety factors \n \n \n \n \n \n \nFigure 10. Correlation between speed and anxiety \n \n \n \n \n \n \nFigure 11. HMI Solution \n \n \n \n \n \n \nFigure 12. Other HMI functions \n \n \n \n \n \n \nFigure 13. HMI effects \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"
    }
]